{"pageProps":{"page":{"slug":"about.phpversions.md","content":"## Версії PHP, документовані у цьому посібнику\n\nДаний посібник містить інформацію про минулі, справжні та майбутні версії PHP. Зміни поведінки документовані зауваженнями, історією змін і у тексті самого керівництва. Найпершою документованою версією PHP є 7.0.0.\n\nЯкщо документація доступна для останньої (ще невипущеної) версії PHP, що розробляється, вона позначається або як \"доступно в Git\", або \"версія, що розробляється\". І хоча ці зміни заплановані, в окремих випадках вони можуть змінитися.\n\nВся технологія ведеться в Git і може бути отримана способом, описаним на сторінці [» анонімний доступ до Git](https://www.php.net/git.php)\n\nДля ясності керівництво вказує основну, проміжну і дробову версію релізів PHP. Візьмемо для прикладу версію PHP `7.3.1` *7* є основною версією, *3* є проміжною, та є дрібною версією. Зазвичай нові можливості PHP додаються тільки в основних і проміжних версіях, а виправлення помилок - в дробових. Однак, ця угода не завжди вірна.\n\nТакож врахуйте, що посібник з PHP пишеться в теперішньому, а не в майбутньому часі, навіть для задокументованих, але ще недоступних можливостей. Це зроблено для того, щоб полегшити випробування часом для цього посібника, таким чином можна уникнути рутинних граматичних правок із кожною новою випущеною версією PHP.\n\nБагато разів у посібнику вказуються \"значення за промовчанням\" для різних директив PHP. Ці значення засновані на тому, як поводиться PHP без конфігураційного файлу php.ini, тому вони можуть відрізнятися від тих, що наведені в файлах php.ini-development і php.ini-production, що розповсюджуються разом з PHP. Вони також відносяться до останньої версії PHP, хоча історія змін згадує лише попередні значення. За детальною інформацією про ці значення та їх історію змін звертайтесь до [додатку зі списком PHP директив](ini.list.md)\n","title":"Версії PHP, документовані у цьому посібнику","contentType":2,"navigation":[{"about.prototypes.md":"Як читати визначення функції (прототип)"},{"about.more.md":"Як дізнатися більше про PHP »"},{"index.md":"PHP Manual"},{"about.md":"Про це керівництво"}]}},"__N_SSG":true}