{"pageProps":{"page":{"slug":"about.howtohelp.md","content":"## Як допомогти у написанні документації\n\nІснує кілька способів допомогти нам у покращенні документації.\n\nЯкщо ви зустрічаєте помилки в цьому посібнику, будь-якою мовою, повідомляйте про них за допомогою системи відстеження помилок за адресою [» https://github.com/php/doc-ru](https://github.com/php/doc-ru); про помилки у посібнику англійською мовою слід повідомляти за адресою [» https://github.com/php/doc-en/issues](https://github.com/php/doc-en/issues). Усі проблеми з документацією, включаючи помилки з різними форматами посібника, повинні бути надіслані як повідомлення про помилку.\n\n> **Зауваження** :\n> \n> Будь ласка, не зловживайте системою відстеження помилок для того, щоб отримати будь-яку допомогу. Натомість скористайтеся будь-якими [» видами підтримки](https://www.php.net/support.php), згаданими вище.\n\nНадсилаючи нотатки, користувачі можуть надати різні приклади, застереження та роз'яснення для інших читачів. Але, будь ласка, не використовуйте систему анотації для повідомлень про помилки. Більш детальну інформацію про нотатки користувачів ви можете отримати, ознайомившись із розділом ['Про нотатки користувачів'](about.notes.md) цієї програми.\n\nТакож можна відправити пулреквести до [» дзеркало репозиторію документації на GitHub](https://github.com/php/doc-ru)\n\nПосібник з PHP було перекладено на багато мов. Знання англійської та іншої іноземної мови дає вам ще один спосіб покращити цей посібник, працюючи в команді перекладачів. Якщо ви збираєтеся розпочати переклад, зверніться до [» http://doc.php.net/tutorial/](http://doc.php.net/tutorial/)\n\nПроект документації PHP також має IRC канал (чат), де можна знайти багато авторів цього посібника. Заходьте на `#php.doc`на сайте`irc.efnet.org` та обговорюйте різні способи покращити цей посібник.\n","title":"Як допомогти у написанні документації","contentType":2,"navigation":[{"about.more.md":"« Як дізнатися більше про PHP"},{"about.generate.md":"Як створюються формати документації"},{"index.md":"PHP Manual"},{"about.md":"Про це керівництво"}]}},"__N_SSG":true}