{"pageProps":{"page":{"slug":"about.formats.md","content":"## Формати\n\nПосібник з PHP доступний у кількох форматах. Ці формати можна розділити на дві групи: формат для читання онлайн і формати, доступні для завантаження.\n\n> **Зауваження** :\n> \n> Деякі видавництва випустили друковані версії цього посібника. Однак ми не рекомендуємо користуватися ними внаслідок їх швидкого старіння.\n\nВи можете користуватися посібником онлайн [» на сайті PHP.net](https://www.php.net/). В даний момент онлайн версія PHP посібника має два окремі стилі CSS - для перегляду онлайн (веб) і призначений для друку.\n\nПеревагою онлайн керівництва над більшістю офлайн форматів є інтеграція з [зауваженнями користувачів](about.notes.md) і [» швидкими посиланнями](https://www.php.net/urlhowto.php), дуже зручним для швидкого доступу до бажаної частини керівництва. Очевидним недоліком є ​​те, що вам потрібно перебувати в онлайні, щоб скористатися керівництвом в онлайн форматах.\n\nІснує кілька форматів для використання в офлайн, і ви можете вибрати формат, найбільш підходящий для використання у вашій операційній системі і відповідатиме вашим читацьким уподобанням. Щоб дізнатися більше про те, як створюється така кількість форматів посібника, зверніться до розділу ['Як ми створюємо формати керівництва'](about.generate.md)\n\nНайбільш кросплатформним форматом цього посібника є HTML-версія. Вона доступна як у вигляді одного HTML-файлу, так і у вигляді архіву, що містить кілька тисяч файлів, кожен з яких є окремим розділом посібника. Ми надаємо ці версії посібників стислими, тому вам знадобиться утиліта розархівування для доступу до файлів усередині архіву.\n\nНа платформах Windows доступна версія посібника у форматі Windows HTML Help, який можна переглядати за допомогою програми Windows HTML Help. Ця версія передбачає пошук за текстом посібника, зміст та підтримку використання закладок. Багато середовищ розробки PHP-програм у Windows також використовують цю версію через легкість доступу. Існують також програми перегляду CHM під Linux. Дивіться [» xCHM](http://xchm.sourceforge.net/) або [» GnoCHM](http://gnochm.sourceforge.net/)\n\nЄ також [» розширена версія CHM](https://www.php.net/docs-echm.php), вона оновлюється рідше, але забезпечує безліч додаткових можливостей. На жаль, через технологію створення цього формату, вона працює тільки на Microsoft Windows.\n","title":"Формати","contentType":2,"navigation":[{"about.md":"« Про це керівництво"},{"about.notes.md":"Про нотатки користувачів »"},{"index.md":"PHP Manual"},{"about.md":"Про це керівництво"}]}},"__N_SSG":true}