{"pageProps":{"page":{"slug":"collator.setstrength.md","content":"# Collator::setStrength\n\n# collator\\_set\\_strength\n\n(PHP 5 >= 5.3.0, PHP 7, PHP 8, PECL intl >= 1.0.0)\n\nCollator::setStrength -- collator\\_set\\_strength - Встановлює силу зіставлення\n\n### Опис\n\nОб'єктно-орієнтований стиль\n\n```methodsynopsis\npublic Collator::setStrength(int $strength): bool\n```\n\nПроцедурний стиль\n\n```methodsynopsis\ncollator_set_strength(Collator $object, int $strength): bool\n```\n\nСлужба сопоставления[» ICU](https://icu.unicode.org/) підтримує безліч рівнів порівняння (званих \"Рівні\", але також відомих як \"Сила порівняння\"). Наявність цих категорій дозволяє ICU сортувати рядки точно відповідно до місцевих угод. Однак, дозволяючи вибірково використовувати рівні, пошук рядка в тексті може виконуватися з різними умовами зіставлення.\n\n1.  *Первинний рівень*: Зазвичай використовується для позначення відмінностей між основними символами (наприклад, \"a\" < \"b\"). Це найбільша різниця. Наприклад, словники розбиті на різні розділи за основним символом. Також називається силою `level 1`\n    \n2.  *Вторинний рівень*: Акценти в символах вважаються вторинними відмінностями (наприклад, as < as < at). Інші відмінності між літерами можна вважати вторинними, залежно від мови. Вторинна відмінність ігнорується, якщо є первинна відмінність десь у рядках. Також називається силою `level 2`\n    \n    > **Зауваження** :\n    > \n    > Примітка: У деяких мовах (наприклад, датському) певні літери з діакритичними знаками є окремими базовими символами. Однак, у більшості мов, літера з наголосом має лише другорядну відмінність від версії цієї літери без наголосу.\n    \n3.  *Третічний рівень*: Відмінності у верхньому та нижньому регістрі символів розрізняються на третинному рівні (наприклад, «ao» < «Ao» < «aò»). Крім того, варіант літери відрізняється від базової форми на третинному рівні (наприклад, «a» та «𝒶»). Інший приклад - різниця між великою та маленькою Кана. Третинна відмінність ігнорується, якщо десь у рядках є первинна або вторинне відмінність. Також називається силою `level 3`\n    \n4.  *Четвертичний рівень*: Коли пунктуація ігнорується (див. Ігнорування розділових знаків) на рівнях 1-3, можна використовувати додатковий рівень для розрізнення слів з пунктуацією і без неї (наприклад, «ab» < «a-b» < «aB»). Ця різниця ігнорується, якщо є первинна, вторинна чи третинна різниця. Також називається силою `level 4`. Четвертинний рівень слід використовувати тільки в тому випадку, якщо потрібне ігнорування розділових знаків або при обробці японського тексту (дивіться Обробка хірагани).\n    \n5.  *Ідентичний рівень*: Коли всі рівні рівні рівні, ідентичний рівень використовується як тай-брейк. Значення кодових точок Unicode форми NFD кожного рядка порівнюються цьому рівні, про всяк випадок, якщо немає різниці рівнях 1-4. Наприклад, кантиляційні знаки івриту різняться лише цьому рівні. Цей рівень слід використовувати з обережністю, оскільки різниця лише у значеннях кодових точок між двома рядками є вкрай рідкісним явищем. Використання цього рівня істотно знижує продуктивність як інкрементного порівняння, так і для генерації ключа сортування (а також збільшує довжину ключа сортування). Також називається силою`level 5`\n    \n\nНаприклад, люди можуть ігнорувати акценти або ігнорувати акценти та регістр під час пошуку тексту. Майже всі символи розрізняються за першими трьома рівнями, тому в більшості мов значення за замовчуванням - третинний. Однак, якщо для параметра «Альтернативний» встановлено значення «Shifted», то четвертинну силу можна використовувати для розриву зв'язків між пробілами, пунктуацією та символами, які інакше були б проігноровані. Якщо потрібні дуже тонкі відмінності між символами, тоді можна використовувати Ідентичний рівень (наприклад, Ідентичний рівень розрізняє Mathematical Bold Small A та Mathematical Italic Small A.). Однак використання рівнів вище, ніж третинний, ідентична сила призводить до значно довших ключів сортування та зниження продуктивності порівняння рядків для рівних рядків.\n\n### Список параметрів\n\n`object`\n\nОб'єкт [Collator](class.collator.md)\n\n`strength`\n\nStrength to set.\n\nДопустимі значення:\n\n-   **`Collator::PRIMARY`**\n    \n-   **`Collator::SECONDARY`**\n    \n-   **`Collator::TERTIARY`**\n    \n-   **`Collator::QUATERNARY`**\n    \n-   **`Collator::IDENTICAL`**\n    \n-   **`Collator::DEFAULT_STRENGTH`**\n    \n\n### Значення, що повертаються\n\nПовертає **`true`** у разі успішного виконання або \\*\\*`false`\\*\\*в случае возникновения ошибки.\n\n### Приклади\n\n**Приклад #1 Приклад використання** collator\\_set\\_strength()\\*\\*\\*\\*\n\n```php\n<?php\n$arr  = array( 'aò', 'Ao', 'ao' );\n$coll = collator_create( 'en_US' );\n\n// Сортировка массива с использованием силы по умолчанию.\ncollator_sort( $coll, $arr );\nvar_export( $arr );\n\n// Сортировка массива с использованием первичной силы.\ncollator_set_strength( $coll, Collator::PRIMARY );\ncollator_sort( $coll, $arr );\nvar_export( $arr );\n?>\n```\n\nРезультат виконання наведеного прикладу:\n\n```\narray (\n  0 => 'ao',\n  1 => 'Ao',\n  2 => 'aò',\n)\narray (\n  0 => 'aò',\n  1 => 'Ao',\n  2 => 'ao',\n)\n```\n\n### Дивіться також\n\n-   [Константи](class.collator.md#intl.collator-constants) [Collator](class.collator.md)\n-   [collator\\_get\\_strength()](collator.getstrength.md) \\- набуває поточної сили зіставлення\n","title":"Collator::setStrength","contentType":2,"navigation":[{"collator.setattribute.md":"« Collator::setAttribute"},{"collator.sortwithsortkeys.md":"Collator::sortWithSortKeys »"},{"index.md":"PHP Manual"},{"class.collator.md":"Collator"}]}},"__N_SSG":true}