{"pageProps":{"page":{"slug":"com.construct.md","content":"# com::\\_\\_construct\n\n(PHP 4 > 4.1.0, PHP 5, PHP 7, PHP 8)\n\ncom::\\_\\_construct - Конструктор класу com\n\n### Опис\n\npublic **com::\\_\\_construct**  \nstring`$module_name`,  \narray|string|null`$server_name` **`null`**,  \nint`$codepage` **`CP_ACP`**,  \nstring`$typelib` = \"\"  \n) .\n\nСтворює об'єкт класу com.\n\n### Список параметрів\n\n`module_name`\n\nProgID, Class ID або Moniker, що вказує на компонент для завантаження. Зазвичай ProgID це ім'я програми або DLL і ім'я об'єкта, розділені точкою. Наприклад: `Word.Application`. Class ID – це UUID, унікальний для заданого класу. Moniker - спеціальна форма іменування, схожа за концепцією URL, яка ідентифікує ресурс і спосіб його завантаження. Наприклад, ви можете завантажити Word і отримати об'єкт, що представляє документ, вказавши повний шлях до документа word як ім'я модуля, або використовувати `LDAP:`в качестве моникера для использования ADSI интерфейса к LDAP.\n\n`server_name`\n\nІм'я сервера DCOM, на якому компонент має бути завантажений та запущений. Якщо поставлено як **`null`**, об'єкт буде запущено на сервері за промовчанням для програми. Зазвичай сервер за промовчанням – це локальний комп'ютер, якщо адміністратор не налаштував інакше. Якщо для сервера вказано значення, відмінне від **`null`**, PHP не завантажуватиме об'єкт, доки ви не встановите опцію конфігурації php.ini [com.allow\\_dcom](com.configuration.md#ini.com.allow-dcom)в\\*\\*`true`\\*\\*\n\nЯкщо `server_name` заданий як масив, цей масив повинен містити такі елементи (регістр символів важливий). Зверніть увагу, що всі вони необов'язкові (єдино, що Username і Password повинні йти парою); Якщо ви не вкажете Server, то буде обрано сервер за промовчанням і створення об'єкта не залежатиме від значення налаштування директиви php.ini [com.allow\\_dcom](com.configuration.md#ini.com.allow-dcom)\n\n**Ім'я сервера DCOM**\n\n| ключ | тип | описание |\n| --- | --- | --- |\n| Server | string | Ім'я сервера. |\n| Username | string | Ім'я користувача. |\n| Password | string | Пароль для`Username` |\n| Domain | string | Домен для `server` |\n| Flags | integer | Одна або кілька констант, об'єднаних логічним АБО: **`CLSCTX_INPROC_SERVER`** **`CLSCTX_INPROC_HANDLER`** **`CLSCTX_LOCAL_SERVER`** **`CLSCTX_REMOTE_SERVER`** **`CLSCTX_SERVER`** і **`CLSCTX_ALL`**Значение по умолчанию**`CLSCTX_SERVER`**, якщо `Server` не заданий і \\*\\*`CLSCTX_REMOTE_SERVER`\\*\\*якщо заданий. Про призначення цих констант можна прочитати в документації Microsoft CoCreateInstance. Але насправді вони вам навряд чи знадобляться. |\n\n`codepage`\n\nКодова сторінка для перетворення в юнікод і назад. Конвертація відбувається коли рядок PHP передається як параметр COM об'єкту і коли від нього надходить відповідь. Зверніть увагу, що ця кодова сторінка буде використовуватися для всіх об'єктів та варіантів, що повертаються цим об'єктом. Допустимі значення: **`CP_ACP`** (Значення за замовчуванням. Системна кодова сторінка ANSI), **`CP_MACCP`** **`CP_OEMCP`** **`CP_SYMBOL`** **`CP_THREAD_ACP`**(Использовать кодовую страницу/локаль, установленную для запущенного потока),**`CP_UTF7`** і **`CP_UTF8`**. Також можна використовувати число, яке означає кодову сторінку. Подробиці читайте у документації Microsoft.\n","title":"com::\\_\\_construct","contentType":2,"navigation":[{"class.com.md":"« com"},{"class.dotnet.md":"dotnet »"},{"index.md":"PHP Manual"},{"class.com.md":"com"}]}},"__N_SSG":true}