{"pageProps":{"page":{"slug":"configuration.changes.md","content":"## Як змінити налаштування конфігурації\n\n### Запуск PHP як модуль Apache\n\nКоли PHP працює як модуль Apache, налаштування конфігурації змінюються через директиви у файлах конфігурації Apache (наприклад, httpd.conf) та файлах .htaccess. Для цього будуть потрібні привілеї «AllowOverride Options» або «AllowOverride All».\n\nВ Apache передбачені директиви, які дозволяють змінити конфігурацію PHP у файлах конфігурації Apache. Список директив **`INI_ALL`** \\*\\*`INI_PERDIR`** і **`INI_SYSTEM`\\*\\*смотрите в приложении «[Список директив php.ini](ini.list.md)».\n\n`php_value` `name` `value`\n\nВстановлює значення директиви. Дозволено вказувати тільки з директивами типу **`INI_ALL`** і **`INI_PERDIR`**. Щоб очистити встановлене значення, як значення вказують `none`\n\n> **Зауваження**: Не используйте директиву`php_value` для встановлення логічних значень. Цю функцію виконує директива `php_flag`; її опис нижче.\n\n`php_flag` `name` `on|off`\n\nВстановлює директиви логічні значення. Дозволено вказувати тільки з директивами типу **`INI_ALL`** і **`INI_PERDIR`**\n\n`php_admin_value` `name` `value`\n\nВстановлює значення директиви . *Не можна вказувати* у файлах .htaccess. Директиви будь-якого типу, встановлені через директиву `php_admin_value`, не можна перевизначати через файли .htaccess або функцію [ini\\_set()](function.ini-set.md). Щоб очистити встановлене значення, вказують значення `none`\n\n`php_admin_flag` `name` `on|off`\n\nВстановлює директиви логічні значення . *Не можна вказувати* у файлах .htaccess. Директиви будь-якого типу, встановлені через директиву `php_admin_flag`, не можна перевизначати через файли .htaccess або функцію [ini\\_set()](function.ini-set.md)\n\n**Приклад #1 Приклад конфігурації Apache**\n\n<IfModule mod\\_php5.c> php\\_value include\\_path \".:/usr/local/lib/php\" php\\_admin\\_flag engine on <IfModule mod\\_php4.c> php\\_value include\\_path \".:/usr/local/lib/php\" php\\_admin\\_flag engine on\n\n**Застереження**\n\nPHP-константи недоступні поза PHP. Наприклад, у httpd.conf ви не можете використовувати константи PHP, такі як **`E_ALL`** або **`E_NOTICE`**, щоб встановити директиву [error\\_reporting](errorfunc.configuration.md#ini.error-reporting), тому що вони не будуть мати значення і будуть прирівнюватися до . Використовуйте натомість відповідні значення типу bitmask (бітова маска). Ці константи можуть бути використані у php.ini\n\n### Зміна конфігурації PHP через реєстр Windows\n\nПри використанні PHP у Windows значення конфігурації можуть бути змінені на рівні директорії за допомогою реєстру Windows. Значення конфігурації зберігаються у ключі реєстру `HKLM\\SOFTWARE\\PHP\\Per Directory Values`, у підключах, що включають повний шлях. Наприклад, значення конфігурації для директорії `c:\\inetpub\\wwwroot`могут храниться в ключе`HKLM\\SOFTWARE\\PHP\\Per Directory Values\\c\\inetpub\\wwwroot`. Налаштування для директорії будуть дійсними для будь-яких скриптів, запущених із цієї директорії або її піддиректорії. Значення ключа повинні мати назву конфігураційної директиви PHP та рядкове значення. PHP-константи у значеннях ігноруються. Однак тільки значення конфігурації, що змінюються в **`INI_USER`** можуть бути встановлені таким чином, значення ж **`INI_PERDIR`** не можуть, тому що ці конфігураційні значення перечитуються для кожного запиту.\n\n### Інші інтерфейси у PHP\n\nНезалежно від того, як ви запускаєте PHP, ви можете змінювати деякі значення під час виконання ваших скриптів за допомогою [ini\\_set()](function.ini-set.md). Для більш детальної інформації дивіться документацію на сторінці функції [ini\\_set()](function.ini-set.md)\n\nЯкщо вам цікавий повний список конфігураційних налаштувань вашої системи з поточними значеннями, ви можете запустити функцію [phpinfo()](function.phpinfo.md) та переглянути результуючу сторінку. Ви також можете отримати доступ до значень індивідуально налаштованих директив у процесі виконання, використовуючи [ini\\_get()](function.ini-get.md) або [get\\_cfg\\_var()](function.get-cfg-var.md)\n","title":"Як змінити налаштування конфігурації","contentType":2,"navigation":[{"configuration.changes.modes.md":"« Місця встановлення параметрів конфігурації"},{"langref.md":"Довідник мови »"},{"index.md":"PHP Manual"},{"configuration.md":"Конфігурація часу виконання"}]}},"__N_SSG":true}