{"pageProps":{"page":{"slug":"dba.requirements.md","content":"## Вимоги\n\nПоведінка у різних аспектах може відрізнятися залежно від реалізації бази даних. такі функції як [dba\\_optimize()](function.dba-optimize.md) і [dba\\_sync()](function.dba-sync.md) можуть працювати як обіцяно для одних баз даних та не працювати взагалі для інших. Вам необхідно завантажити та встановити підтримувані обробники dba.\n\n**Список обробників DBA**\n\n| Обработчик | Замечания |\n| --- | --- |\n| `dbm` | Dbm – це найстаріший (оригінальний) тип баз даних Berkeley DB. Краще, наскільки можна, уникати його використання. Ми не підтримуємо сумісність функцій, вбудованих у DB2 та gdbm, тому що вони сумісні лише на рівні вихідного коду, але не можуть обробляти оригінальний формат dbm. |\n| `ndbm` | Ndbm - це новий, набагато більш гнучкий ніж dbm, тип бази. Він також має більшість обмежень dbm (отже є застарілим). |\n| `gdbm` | Gdbm – це [Менеджер баз даних GNU](https://ftp.gnu.org/pub/gnu/gdbm/) |\n| `db2` | DB2 - використовується для [» Oracle Berkeley DB 2](http://www.sleepycat.com/). . Він описується як \"програмний інструментарій, що надає підтримку високопродуктивної вбудованої бази даних для окремостоящих та клієнт-серверних додатків\". |\n| `db3` | DB3 - використовується для [» Oracle Berkeley DB 3](http://www.sleepycat.com/) |\n| `db4` | DB4 - використовується для [» Oracle Berkeley DB 4 або 5](http://www.sleepycat.com/). . Може використовуватися з BDB 5, починаючи з PHP 5.3.3. |\n| `cdb` | Cdb - це \"швидкий, надійний, легкий пакет для створення та читання постійних баз даних.\" від автора qmail. Може бути знайдений за посиланням [» http://cr.yp.to/cdb.md](http://cr.yp.to/cdb.md). . Оскільки база незмінна, ми підтримуємо лише операції читання. PHP 4.3.0 також підтримує запис (не UPDATE!) через внутрішню бібліотеку cdb. |\n| `cdb_make` | З PHP 4.3.0 ми підтримуємо створення (не зміну) файлів cdb під час використання вбудованої бібліотеки cdb. |\n| `flatfile` | Доступно з PHP 4.3.0 тільки для підтримки сумісності із застарілим модулем `dbm`. . Використовувати не рекомендується. Тим не менш, ви можете використовувати цей обробник для файлів, які раніше були створені в такому форматі. |\n| `inifile` | Доступно з PHP 4.3.3 для реалізації можливості зміни файлів php.ini із скриптів PHP. Працюючи з ini-файлами ви повинні передавати масиви формату array(0=>group,1=>value\\_name) або рядки формату \"\\[group\\]value\\_name\", де group - опціонально. Оскільки функції [dba\\_firstkey()](function.dba-firstkey.md) і [dba\\_nextkey()](function.dba-nextkey.md) повертають рядкове подання ключів, в PHP 5 було введено нову функцію [dba\\_key\\_split()](function.dba-key-split.md), що дозволяє конвертувати рядкові ключі у ключі масиву без втрати **`false`** |\n| `qdbm` | Бібліотека qdbm доступна за посиланням [» http://fallabs.com/qdbm/index.md](http://fallabs.com/qdbm/index.md) |\n| `tcadb` | Бібліотека Tokyo Cabinet доступна за посиланням [» http://fallabs.com/tokyocabinet/](http://fallabs.com/tokyocabinet/) |\n| `lmdb` | Доступно з PHP 7.2.0. Бібліотеку Lightning Memory-Mapped Database можна завантажити із сайту [» https://symas.com/lmdb/](https://symas.com/lmdb/) |\n\nПри виклику функцій [dba\\_open()](function.dba-open.md) або [dba\\_popen()](function.dba-popen.md)Як один з аргументів необхідно передати ім'я обробника. Актуальний список доступних обробників можна переглянути за допомогою функцій [phpinfo()](function.phpinfo.md) або [dba\\_handlers()](function.dba-handlers.md)\n","title":"Вимоги","contentType":2,"navigation":[{"dba.setup.md":"\" Встановлення та налаштування"},{"dba.installation.md":"Встановлення »"},{"index.md":"PHP Manual"},{"dba.setup.md":"Встановлення та налаштування"}]}},"__N_SSG":true}