{"pageProps":{"page":{"slug":"errorfunc.constants.md","content":"# Обумовлені константи\n\nНаведені нижче константи завжди доступні як частина ядра PHP.\n\n> **Зауваження**: Ці імена констант можна використовувати у файлі php.ini але не поза PHP, як наприклад у файлі httpd.conf, де замість них необхідно використовувати значення їх бітових масок.\n\n**Помилки та протоколювання**\n\n| Значение | Константа | Опис | Примечание |\n| --- | --- | --- | --- |\n|  | **`E_ERROR`**(int) | Фатальні помилки часу виконання. Це непереборні засобами самого скрипта помилки, такі як помилка розподілу пам'яті і т.п. Виконання скрипта у разі припиняється. |  |\n|  | **`E_WARNING`**(int) | Попередження часу виконання (не фатальні помилки). Виконання скрипта у разі не припиняється. |  |\n| 4 | **`E_PARSE`**(int) | Помилки на етапі компіляції. Повинні генеруватися лише парсером. |  |\n| 8 | **`E_NOTICE`**(int) | Повідомлення часу виконання. Вказують на те, що під час виконання скрипту сталося щось, що може вказувати на помилку, хоча це може відбуватися і при звичайному виконанні програми. |  |\n| 16 | **`E_CORE_ERROR`**(int) | Фатальні помилки, що відбуваються під час запуску РНР. Такі помилки схожі з **`E_ERROR`**, крім того, що вони генеруються ядром PHP. |  |\n| 32 | **`E_CORE_WARNING`**(int) | Попередження (не фатальні помилки), що відбуваються під час початкового запуску РНР. Такі попередження схожі з **`E_WARNING`**, крім того, що вони генеруються ядром PHP. |  |\n| 64 | **`E_COMPILE_ERROR`**(int) | Фатальні помилки на етапі компіляції. Такі помилки схожі з **`E_ERROR`**, Крім того, що вони генеруються скриптовим двигуном Zend. |  |\n| 128 | **`E_COMPILE_WARNING`**(int) | Попередження на етапі компіляції (не фатальні помилки). Такі попередження схожі з **`E_WARNING`**, Крім того, що вони генеруються скриптовим двигуном Zend. |  |\n| 256 | **`E_USER_ERROR`**(int) | Повідомлення про помилки, згенеровані користувачем. Такі помилки схожі з **`E_ERROR`**, за винятком того, що вони генеруються в коді скрипту засобами функції PHP [trigger\\_error()](function.trigger-error.md) |  |\n| 512 | **`E_USER_WARNING`**(int) | Попередження згенеровані користувачем. Такі попередження схожі з **`E_WARNING`**, за винятком того, що вони генеруються в коді скрипту засобами функції PHP [trigger\\_error()](function.trigger-error.md) |  |\n| 1024 | **`E_USER_NOTICE`**(int) | Повідомлення, згенеровані користувачем. Такі повідомлення схожі з **`E_NOTICE`**, крім того, що вони генеруються в коді скрипта, засобами функції PHP [trigger\\_error()](function.trigger-error.md) |  |\n| 2048 | **`E_STRICT`**(int) | Включаються для того, щоб PHP пропонував зміни в коді, які забезпечать кращу взаємодію та сумісність коду. |  |\n| 4096 | **`E_RECOVERABLE_ERROR`**(int) | Фатальні помилки із можливістю обробки. Такі помилки вказують, що, ймовірно, виникла небезпечна ситуація, але при цьому скриптовий двигун залишається в стабільному стані. Якщо така помилка не обробляється функцією, визначеною користувачем для обробки помилок (див. [set\\_error\\_handler()](function.set-error-handler.md)), виконання програми переривається, як відбувається при помилках **`E_ERROR`** |  |\n| 8192 | **`E_DEPRECATED`**(int) | Сповіщення часу виконання використання застарілих конструкцій. Включаються для того, щоб отримувати попередження про код, який не працюватиме у наступних версіях PHP. |  |\n| 16384 | **`E_USER_DEPRECATED`**(int) | Повідомлення часу виконання використання застарілих конструкцій, згенеровані користувачем. Такі повідомлення схожі з **`E_DEPRECATED`** за винятком того, що вони генеруються в коді скрипта, за допомогою функції PHP [trigger\\_error()](function.trigger-error.md) |  |\n| 32767 | **`E_ALL`**(int) | Усі підтримувані помилки, попередження та зауваження. |  |\n\nПредставлені вище значення (як числові, так і символьні) використовуються для завдання бітової маски, що визначає помилки якого типу буде даватися звіт. Ви можете використовувати [побітові оператори](language.operators.bitwise.md), щоб поєднувати ці значення для вказівки певних типів помилок. Варто зазначити, що в php.ini допустимі лише наступні оператори: '|', '~', '!', '^' і '&'.\n","title":"Обумовлені константи","contentType":2,"navigation":[{"errorfunc.resources.md":"« Типи ресурсів"},{"errorfunc.examples.md":"Приклади »"},{"index.md":"PHP Manual"},{"book.errorfunc.md":"Обробка помилок"}]}},"__N_SSG":true}