{"pageProps":{"page":{"slug":"exif.configuration.md","content":"## Налаштування під час виконання\n\nПоведінка цих функцій залежить від установок у php.ini.\n\nExif підтримує автоматичне перетворення кодувань символів Unicode і JIS користувальницьких коментарів, коли модуль [mbstring](ref.mbstring.md) доступний. При цьому коментар спочатку декодується за допомогою вказаного набору символів. Потім результат кодується в іншому наборі символів, який має збігатися з вашим `HTTP`\\-висновком.\n\n**Опції конфігурації Exif**\n\n| Имя | По умолчанию | Место изменения | Список изменений |\n| --- | --- | --- | --- |\n| [exif.encode\\_unicode](exif.configuration.md#ini.exif.encode-unicode) | \"ISO-8859-15\" | **`INI_ALL`** |  |\n| [exif.decode\\_unicode\\_motorola](exif.configuration.md#ini.exif.decode-unicode-motorola) | \"UCS-2BE\" | **`INI_ALL`** |  |\n| [exif.decode\\_unicode\\_intel](exif.configuration.md#ini.exif.decode-unicode-intel) | \"UCS-2LE\" | **`INI_ALL`** |  |\n| [exif.encode\\_jis](exif.configuration.md#ini.exif.encode-jis) | \"\" | **`INI_ALL`** |  |\n| [exif.decode\\_jis\\_motorola](exif.configuration.md#ini.exif.decode-jis-motorola) | \"JIS\" | **`INI_ALL`** |  |\n| [exif.decode\\_jis\\_intel](exif.configuration.md#ini.exif.decode-jis-intel) | \"JIS\" | **`INI_ALL`** |  |\n\nДодаткова інформація та опис режимів INI\\_\\* дано у розділі «[Місця встановлення параметрів конфігурації](configuration.changes.modes.md)».\n\nКоротке пояснення конфігураційних директив.\n\n`exif.encode_unicode`string\n\n`exif.encode_unicode` визначає набір символів UNICODE при обробці коментарів користувача. За замовчуванням це ISO-8859-15, який має працювати для більшості неазіатських країн. Ця установка може бути порожньою або повинна бути кодуванням, що підтримується mbstring. Якщо воно порожнє, використовується поточне внутрішнє кодування mbstring.\n\n`exif.decode_unicode_motorola`string\n\n`exif.decode_unicode_motorola` визначає внутрішнє кодування символів зображення для Unicode-кодованих коментарів, якщо зображення має байтовий порядок motorola (big-endian). Ця установка не може бути порожньою, але ви можете вказати список кодувань, які підтримуються mbstring. Типово UCS-2BE.\n\n`exif.decode_unicode_intel`string\n\n`exif.decode_unicode_intel` визначає внутрішнє кодування символів зображення для Unicode-кодованих коментарів користувача, якщо зображення має байтовий порядок intel (little-endian). Ця установка не може бути порожньою, але ви можете вказати список кодувань, які підтримуються mbstring. Типово UCS-2LE.\n\n`exif.encode_jis`string\n\n`exif.encode_jis` визначає набір символів JIS для обробки коментарів користувача. За промовчанням - порожнє значення, яке змушує функції використовувати поточне внутрішнє кодування mbstring.\n\n`exif.decode_jis_motorola`string\n\n`exif.decode_jis_motorola` визначає внутрішнє кодування символів зображення для JIS-кодованих коментарів, якщо зображення має байтовий порядок motorola (big-endian). Ця установка не може бути порожньою, але ви можете вказати список кодувань, які підтримуються mbstring. Типово JIS.\n\n`exif.decode_jis_intel`string\n\n`exif.decode_jis_intel` визначає внутрішнє кодування символів зображення для JIS-кодованих коментарів користувача, якщо зображення має байтовий порядок intel (little-endian). Ця установка не може бути порожньою, але ви можете вказати список кодувань, які підтримуються mbstring. Типово JIS.\n","title":"Налаштування під час виконання","contentType":2,"navigation":[{"exif.installation.md":"« Встановлення"},{"exif.resources.md":"Типи ресурсів »"},{"index.md":"PHP Manual"},{"exif.setup.md":"Встановлення та налаштування"}]}},"__N_SSG":true}