{"pageProps":{"page":{"slug":"faq.misc.md","content":"# Різні питання\n\nДеякі питання можуть не відповідати іншим категоріям. Ви можете знайти їх тут.\n\n1.  [Як поводитися зі стислими bz2 посібниками під Windows?](#faq.misc.bz2)\n\n**Як поводитися зі стислими bz2 посібниками під Windows?**\n\nЯкщо у вас немає архіватора для роботи з файлами bz2, то [» скачайте](https://www.sourceware.org/bzip2/)утилиту для командной строки от Redhat (пожалуйста, ищите подробности ниже).\n\nЯкщо ви не бажаєте використовувати утиліту командного рядка, ви можете спробувати безкоштовні кошти, такі як [» Stuffit Expander](http://www.stuffit.com/) [» UltimateZip](http://www.ultimatezip.com/) [» 7-Zip](http://www.7-zip.org/) або [» Quick Zip](http://www.quickzip.org/). Якщо у вас є такі утиліти як [» WinRAR](http://www.rarlab.com/) або [» Power Archiver](http://www.powerarchiver.com/), то за допомогою їх можна легко розпакувати файли bz2. Якщо ви користуєтеся Total Commander (колишній Windows Commander), модуль bz2 для цієї програми доступний безкоштовно з сайту [» Total Commander](http://www.ghisler.com/)\n\nУтиліта командного рядка bzip2 від Redhat:\n\nКористувачі Win2K Sp2 повинні взяти останню версію 1.0.2, користувачі інших Windows повинні взяти версію 1.00. Після завантаження перейменуйте файл, що виконується в bzip2.exe. Для зручності покладіть його в директорію у вашому шляху, наприклад C:\\\\Windows, де C відповідає диску, на якому встановлено Windows.\n\nПримітка: lang означає вашу мову і x - бажаний формат, наприклад pdf. Щоб розпакувати php\\_manual\\_lang.x.bz2, дотримуйтесь цих простих інструкцій:\n\n-   відкрийте вікно з командним рядком (command prompt)\n-   перейдіть в директорію (команда cd), куди ви зберегли завантажений php\\_manual\\_lang.x.bz2\n-   викличте bzip2 -d php\\_manual\\_lang.x.bz2 для вилучення php\\_manual\\_lang.x до тієї ж директорії\n\nУ випадку, якщо ви завантажили php\\_manual\\_lang.tar.bz2, що містить безліч html файлів, процедура така сама. Єдина відмінність полягає в тому, що ви отримали файл php\\_manual\\_lang.tar. Відомо, що формат tar обробляється більшістю поширених архіваторів під Windows, наприклад, такими як [» WinZip](http://www.winzip.com/)\n","title":"Різні питання","contentType":2,"navigation":[{"faq.com.md":"« PHP і COM"},{"appendices.md":"Програми »"},{"index.md":"PHP Manual"},{"faq.md":"ЧАВО"}]}},"__N_SSG":true}