{"pageProps":{"page":{"slug":"faq.installation.md","content":"# Установка\n\nЦей розділ містить спільні питання про те, як виконується установка PHP. Дистрибутиви PHP доступні майже для всіх операційних систем та веб-серверів.\n\nДля установки PHP, следуйте инструкциям: [Встановлення та налаштування](install.md)\n\n1.  [Чому краще не користуватися Apache2 з багатопоточним \"MPM\" (event, worker) у промисловій експлуатації?](#faq.installation.apache2)\n2.  [ОС \"Unix\"/\"Windows\": Де шукати файл php.ini?](#faq.installation.phpini)\n3.  [Unix: Я встановив PHP, але при кожному відкритті будь-якого документа бачу 'Document Contains No Data', що це означає?](#faq.installation.nodata)\n4.  [Unix: Я встановив PHP, використовуючи RPMS, але Apache не обробляє PHP-сторінки, в чому справа?](#faq.installation.processing)\n5.  [Unix: Я пропатчив Apache модулем FrontPage, і тепер PHP не працює. Тобто. PHP несумісний із модулями Apache FrontPage?](#faq.installation.frontpage)\n6.  [Unix/Windows: Я встановив PHP, але при спробі відкрити PHP-файл браузером бачу просто порожній екран.](#faq.installation.blankscreen)\n7.  [Unix/Windows: Я встановив PHP, але коли намагаюся переглянути створену PHP-сторінку через браузер, то отримую помилку 500.](#faq.installation.500error)\n8.  [Деякі операційні системи: Я встановив PHP без будь-яких помилок, але коли намагаюся запустити Apache, мені виводиться помилка: \\[mybox:user /src/php5\\] root# apachectl configtest apachectl: /usr/local/apache/bin/httpd Undefined symbols :\\_compress\\_uncompress](#faq.installation.undefinedsyms)\n9.  [Windows: Я встановив PHP, але коли намагаюся відкрити сторінку скрипту через браузер, отримую помилку: cgi error: specified CGI application misbehaved by returning a complete set of HTTP headers. The headers it did return are:](#faq.installation.cgierror)\n10.  [Windows: Я все зробив за інструкцією, але PHP та IIS не хочуть працювати разом!](#faq.installation.phpandiis)\n11.  [Коли я запускаю PHP як CGI на IIS, PWS, OmniHTTPD або Xitami, я отримую таку помилку: Security Alert! PHP CGI може бути accessed directly..](#faq.installation.forceredirect)\n12.  [Як я можу зрозуміти, що мій php.ini знайдено та використовується? Таке враження, що зміни, що вносяться мною, ігноруються.](#faq.installation.findphpini)\n13.  [Як я можу додати директорію з PHP до PATH у Windows?](#faq.installation.addtopath)\n14.  [Як я можу зробити файл php.ini доступним для PHP у windows?](#faq.installation.phprc)\n15.  [Чи можна використовувати узгодження контенту Apache (опція MultiViews) із PHP?](#faq.installation.apache.multiviews)\n16.  [PHP обмежений роботою лише з методами GET та POST?](#faq.installation.requestmethods)\n\n**Чому краще не користуватися Apache2 з багатопоточним \"MPM\" (event, worker) у промисловій експлуатації?**\n\nPHP подібний до сполучної ланки. Це сполучна ланка для створення хороших веб-додатків шляхом об'єднання розрізнених сторонніх бібліотек в єдине ціле через використання інтуїтивно зрозумілого і простого для вивчення мовного інтерфейсу. Гнучкість та сила PHP заснована на стабільності та стійкості, що лежить в основі платформи. Щоб все працювало, потрібна робоча операційна система, робочий веб-сервер та робочі сторонні бібліотеки. Але коли хоч щось із них перестає працювати - PHP потребує способів швидкого визначення причини неполадки та її усунення. І коли ви ускладнюєте базовий фреймворк тим, що не ізолюєте потоки та сегменти пам'яті, що виконуються, і не надаєте потокам окремих ізольованих \"пісочниць\" - послаблюється вся PHP-система.\n\nЯкщо ви хочете використовувати багатопотоковий \"MPM\" - ознайомтеся з конфігурацією \"FastCGI\", згідно з якою PHP працює у власному просторі пам'яті.\n\n**ОС \"Unix\"/\"Windows\": Де шукати файл php.ini?**\n\nЗа замовчуванням в Unix він повинен бути /usr/local/lib, який відповідає <установочный-шлях>/lib. Багато хто захоче змінити цей шлях у момент компіляції, використовуючи опцію [\\--with-config-file-path](configure.about.md#configure.with-config-file-path) Наприклад, можна написати так:\n\n\\--with-config-file-path=/etc\n\nІ потім скопіювати php.ini-development з дистрибутива /etc/php.ini і внести в нього всі необхідні зміни.\n\n\\--with-config-file-scan-dir=PATH\n\nУ ОС \"Windows\", за замовчуванням, шлях до файлу php.ini - це шлях до директорії \"Windows\". Якщо ви користуєтесь веб-сервером \"Apache\", php.ini знаходиться на шляху: ?\\\\program files\\\\apache group\\\\apache\\\\. . Таким чином, на одному комп'ютері можна скористатися кількома файлами php.ini, відповідно до версій \"Apache\".\n\nСмотрите также:[файл налаштувань](configuration.file.md)\n\n**Unix: Я встановив PHP, але при кожному відкритті будь-якого документа бачу 'Document Contains No Data', що це означає?**\n\nЦе означає, що можливо PHP зіткнувся з якоюсь проблемою і падає в core-dump. Перегляньте логи помилок сервера, щоб перевірити це, а потім спробуйте відтворити ланцюжок кроків, що призвели до помилки; наприклад, створивши окрему тестову програму. І якщо ви вмієте користуватися 'gdb', це допоможе вам отримати стек викликів функцій (backtrace) для включення його у звіт про помилку, щоб полегшити виявлення причин проблеми розробникам. Якщо ви користуєтеся PHP як модулем для Apache, вам може бути корисним наступне:\n\n-   Зупиніть httpd-процеси\n    \n-   gdb httpd\n    \n-   Знову зупиніть httpd-процеси\n    \n-   \\>run -X -f шлях\\_до\\_httpd.conf\n    \n-   Потім скопіюйте URL-адресу, що викликала проблему в браузері\n    \n-   \\>run -X -f шлях\\_до\\_httpd.conf\n    \n-   Якщо відбуватиметься core dump, gdb повідомить вас про це\n    \n-   Введіть bt\n    \n-   Увімкніть backtrace у звіт про помилку. І надішліть за адресою:[» https://github.com/php/php-src/issues](https://github.com/php/php-src/issues)\n    \n\nЯкщо ваш скрипт використовує регулярні вирази ([preg\\_match()](function.preg-match.md) та подібні), перевірте, чи з однаковими пакетами обробки RegEx скомпіловані PHP та Apache? У разі PHP та Apache 1.3.x це відбувається автоматично.\n\n**Unix: Я встановив PHP, використовуючи RPMS, але Apache не обробляє PHP-сторінки, в чому справа?**\n\nЯкщо ви встановили і Apache, і PHP з RPM-пакетів, вам знадобиться розкоментувати або додати деякі (або, можливо, всі) рядки з наступних, у вашому файлі httpd.conf:\n\n#Extra Modules AddModule mod\\_php.c AddModule mod\\_perl.c\n\n# Extra Modules\n\nLoadModule php\\_module modules/mod\\_php.so LoadModule php5\\_module modules/libphp5.so LoadModule perl\\_module modules/libperl.so\n\nІ додайте:\n\nAddType application/x-httpd-php .php\n\n... у область глобальних властивостей, або у властивості того VirtualDomain, для якого ви хочете включити підтримку PHP.\n\n**Unix: Я пропатчив Apache модулем FrontPage, і тепер PHP не працює. Тобто. PHP несумісний із модулями Apache FrontPage?**\n\nНі, сумісний, але патч FrontPage впливає на структури Apache, потрібні для PHP. Перекомпіляція PHP (команда 'make clean; make') після встановлення патча може вирішити проблему.\n\n**Unix/Windows: Я встановив PHP, але при спробі відкрити PHP-файл браузером бачу просто порожній екран.**\n\nВиберіть у браузері опцію \"дивитися код\" і ви, можливо, побачите, ваш PHP-код. Це означає, що Apache не передав ваш скрипт інтерпретатору PHP. Значить щось неправильно з конфігурацією сервера. У цьому випадку перевірте конфігурацію веб-сервера відповідно до інструкцій з інсталяції PHP.\n\n**Unix/Windows: Я встановив PHP, але коли намагаюся переглянути створену PHP-сторінку через браузер, то отримую помилку 500.**\n\nЩось пішло не так, коли сервер спробував запустити PHP. Щоб побачити вихідну помилку, у командному рядку перейдіть в директорію, що містить виконуваний файл PHP (php.exe в Windows) і запустіть **php -i**. Якщо існують проблеми з запуском PHP, вам виведеться відповідна помилка, яка підкаже вам, що треба виправити. Якщо ви побачите безліч коду HTML (виведення функції [phpinfo()](function.phpinfo.md)), отже, PHP працює нормально, і ваша проблема пов'язана з налаштуваннями веб-сервера.\n\n\\*\\*Деякі операційні системи: Я встановив PHP без будь-яких помилок, але коли намагаюся запустити Apache, мені виводиться помилка:\n\n\\[mybox:user /src/php5\\]root# apachectl configtest apachectl: /usr/local/apache/bin/httpd Undefined symbols:\\_compress\\_uncompress\n\n\\*\\*\n\nЦе означає, що проблема не в PHP, а у клієнтських бібліотеках MySQL. Деякі з них вимагають збирання PHP з опцією **\\--with-zlib**. Цей нюанс описано у MySQL FAQ.\n\n\\*\\*Windows: Я встановив PHP, але коли намагаюся відкрити сторінку скрипту через браузер, отримую помилку:\n\n```\ncgi error:\n The specified CGI application misbehaved by not\n returning a complete set of HTTP headers.\n The headers it did return are:\n```\n\n\\*\\*\n\nЦе означає, що PHP не зміг нічого вивести у стандартний потік введення-виведення. Щоб побачити вихідну помилку, у командному рядку перейдіть в директорію, що містить виконуваний файл PHP (php.exe в Windows) і запустіть **php -i**. Якщо існують проблеми з запуском PHP, вам виведеться відповідна помилка, яка підкаже вам, що треба виправити. Якщо ви побачите безліч коду HTML (виведення функції [phpinfo()](function.phpinfo.md)), отже PHP працює нормально.\n\nКоли ви переконалися, що PHP працює в командному рядку, спробуйте звернутися до скрипту через браузер знову. Якщо знову виникне помилка - це може означати одну з таких проблем:\n\n-   Права на файл вашого скрипта, php.exe, php5ts.dll, php.ini або будь-якого модуля PHP не дозволяють анонімному користувачеві інтернету`ISUR_<machinename>`до них звернутись.\n-   Файл скрипта відсутній (або, можливо, він не там, де ви думаєте, щодо кореневого каталогу веб-сервера). Зверніть увагу, що в IIS ви можете відловити цю помилку, позначивши опцію 'check file exists' в налаштуваннях \"script mappings\" в Internet Services Manager. Якщо файл відсутній, сервер натомість поверне помилку 404. При цьому також є додаткова перевага. IIS буде проводити перевірки аутентифікації для файлу скрипта, необхідні вам, ґрунтуючись на дозволах NTLanMan.\n\n**Windows: Я все зробив за інструкцією, але PHP та IIS не хочуть працювати разом!**\n\nПереконайтеся, що всі користувачі, яким може знадобитися запустити ваш PHP скрипт, мають право запускати php.exe! IIS використовує анонімного користувача, що створюється під час інсталяції. Цей користувач повинен мати право на запуск php.exe. Також кожен авторизований користувач повинен мати права на запуск php.exe. Для IIS4 ви скажете йому, що PHP - це інтерпретатор скриптів. Також прочитайте [цей FAQ](faq.installation.md#faq.installation.forceredirect)\n\n**Коли я запускаю PHP як CGI на IIS, PWS, OmniHTTPD або Xitami, я отримую таку помилку: `Security Alert! PHP CGI cannot be accessed directly.`**\n\nВи повинні встановити опцію [cgi.force\\_redirect](ini.core.md#ini.cgi.force-redirect) рівну По умолчанию она равна . Переконайтеся, що вона не закоментована (за допомогою ). Як і всі опції PHP, вона налаштовується у php.ini\n\nТак как она по умолчанию равна , важливо переконатися, що використовується саме той php.ini, який потрібен. Читайте [цей FAQ](faq.installation.md#faq.installation.findphpini) для подробиць.\n\n**Як я можу зрозуміти, що мій php.ini знайдено та використовується? Таке враження, що зміни, що вносяться мною, ігноруються.**\n\nЩоб перевірити, який саме php.ini використовується, запустіть функцію [phpinfo()](function.phpinfo.md). Десь угорі буде список із назвою `Configuration File (php.ini)`. З нього ви зможете зрозуміти який саме php.ini використовується. Якщо вказана директорія в PATH, а файл конфігурації не прочитаний, то просто скопіюйте його в цю директорію. Якщо php.ini включено PATH - це означає, що він прочитаний.\n\nЯкщо php.ini читається і ви запускаєте PHP як модуль, то після внесення змін до php.ini необхідно перезавантажити веб-сервер.\n\nТакже смотрите описание[php\\_ini\\_loaded\\_file()](function.php-ini-loaded-file.md)\n\n**Як я можу додати директорію з PHP до PATH у Windows?**\n\nУ Windows:\n\n-   Старт → Панель Управління → Система\n    \n-   Перейдіть на вкладку 'Додатково'\n    \n-   Натисніть кнопку 'Змінні Оточення'\n    \n-   Перегляньте розділ 'Системні Змінні'.\n    \n-   Знайдіть рядок, що містить змінну PATH\n    \n-   Здійсніть на ній подвійне клацання мишею\n    \n-   Допишіть у кінець рядка шлях до PHP, не забувши додати перед ним ';' (наприклад `;C:\\php`) .\n    \n-   Натисніть OK\n    \n\n> **Зауваження**: Не забудьте перезавантажитися після описаних вище дій і після перезавантаження перевірити, чи змінна PATH містить потрібний шлях.\n\n**Як я можу зробити файл php.ini доступним для PHP у windows?**\n\nЄ кілька способів зробити це. Якщо ви використовуєте Apache, зверніться до документації Apache, в іншому випадку ви повинні встановити змінне середовище PHPRC.\n\n**Чи можна використовувати узгодження контенту Apache (опція MultiViews) із PHP?**\n\nЯкщо посилання на файли PHP містять розширення, все буде працювати відмінно. Це FAQ застосовується тільки для випадків, коли посилання не містять розширення і ви хочете використовувати узгодження контенту для PHP-файлів з URL. У цьому випадку замініть рядок `AddType application/x-httpd-php .php`на:\n\nAddHandler php5-script php AddType text/html php\n\nЦе рішення не спрацює з Apache 1, оскільки модуль PHP не відловлює `php-script`\n\n**PHP обмежений роботою лише з методами GET та POST?**\n\nНі, можна працювати з будь-якими запитами, наприклад CONNECT. Правильний статус відповіді має надсилатися функцією [header()](function.header.md). Якщо вам потрібно, щоб PHP працювати тільки з методами GET та POST, необхідно налаштувати Apache наступним чином:\n\nDeny from all\n","title":"Установка","contentType":2,"navigation":[{"faq.databases.md":"« Питання щодо баз даних"},{"faq.build.md":"Проблеми збирання »"},{"index.md":"PHP Manual"},{"faq.md":"ЧАВО"}]}},"__N_SSG":true}