{"pageProps":{"page":{"slug":"faq.com.md","content":"# PHP та COM\n\nPHP може бути використаний для доступу до об'єктів COM та DCOM на платформах Win32.\n\n1.  [Я зібрав DLL для деяких обчислень. Чи можна запустити цю DLL із PHP?](#faq.com.q1)\n2.  [Що означає 'Unsupported variant type: xxxx (0xxxxx)'?](#faq.com.q2)\n3.  [Чи можливе маніпулювання візуальними об'єктами в PHP?](#faq.com.q3)\n4.  [Чи можу я зберігати об'єкт COM у сесії?](#faq.com.q4)\n5.  [Як я можу зловити помилки COM?](#faq.com.q5)\n6.  [Чи можна генерувати DLL-файли з PHP-скриптів так, як це можна робити у Perl?](#faq.com.q6)\n7.  [Що означає 'Unable to obtain IDispatch interface for CLSID {xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx}'?](#faq.com.q7)\n8.  [Як можна запускати COM-об'єкти з віддаленого сервера?](#faq.com.q8)\n9.  [Я отримую 'DCOM is disabled in C:\\\\path...\\\\scriptname.php on line 6', що робити?](#faq.com.q9)\n10.  [Чи можливо за допомогою PHP завантажити/маніпулювати об'єктом ActiveX на сторінці?](#faq.com.q10)\n11.  [Чи можливо отримати екземпляр компонента, що виконується?](#faq.com.q11)\n12.  [Чи є спосіб обробити подію, надіслану об'єктом COM?](#faq.com.q12)\n13.  [У мене виникають проблеми при спробі викликати метод об'єкта COM, який надає більш ніж один інтерфейс. Що я можу зробити?](#faq.com.q13)\n14.  [Отже, PHP працює з COM, як щодо COM+?](#faq.com.q14)\n15.  [Якщо PHP може маніпулювати COM-об'єктами, чи можна уявити використання MTS для управління ресурсами компонентів у з'єднанні з PHP?](#faq.com.q15)\n\n**Я зібрав DLL для деяких обчислень. Чи можна запустити цю DLL із PHP?**\n\nЯкщо це проста DLL, то поки що немає можливості викликати її з PHP. Якщо DLL містить COM-сервер, ви можете отримати доступ до неї, якщо вона реалізує інтерфейс IDispatch.\n\n**Що означає 'Unsupported variant type: xxxx (0xxxxx)'?**\n\nІснують дюжини типів VARIANT та їх комбінацій. Більшість із них уже підтримуються, але дещо все ще не реалізовані. Масиви підтримуються в повному обсязі. Тільки одновимірні індексовані масиви можуть передаватися між PHP та COM. Якщо ви виявите типи, що не підтримуються, будь ласка, повідомте про них як про помилку (якщо це ще не зроблено) і надайте всю доступну інформацію.\n\n**Чи можливе маніпулювання візуальними об'єктами в PHP?**\n\nЗагалом так, але оскільки PHP в основному використовується як скриптова мова для веб-сервера і виконується в контексті веб-сервера, то візуальні об'єкти ніколи не з'являться на робочому столі сервера. Якщо ви використовуєте PHP як скрипт для програм, наприклад у зв'язці з PHP-GTK, тоді немає обмежень на доступ та маніпулювання візуальними об'єктами через COM.\n\n**Чи можу я зберігати об'єкт COM у сесії?**\n\nНі не можете. Оскільки екземпляри COM розглядаються як ресурси, то вони доступні лише у контексті одного скрипта.\n\n**Як я можу зловити помилки COM?**\n\nМодуль COM викидає виняток `com_exception`, яке ви можете перехопити і потім перевірити у нього поле `code`, щоб зрозуміти, що робити далі.\n\n**Чи можна генерувати DLL-файли з PHP-скриптів так, як це можна робити у Perl?**\n\nНі, на жаль, такий засіб недоступний для PHP.\n\n**Що означає 'Unable to obtain IDispatch interface for CLSID {xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx}'?**\n\nЦя помилка може виникнути з різних причин:\n\n-   неправильний CLSID\n-   відсутня запитана DLL\n-   запитаний компонент не реалізує інтерфейс IDispatch\n\n**Як можна запускати COM-об'єкти з віддаленого сервера?**\n\nТочно так само, як ви запускаєте локальні об'єкти. Вам тільки треба передати IP дистанційної машини як другий параметр конструктора COM.\n\nПереконайтеся, що у вашому php.ini ви встановили [com.allow\\_dcom](com.configuration.md#ini.com.allow-dcom)`=`**`true`**\n\n**Я отримую 'DCOM is disabled in C:\\\\path...\\\\scriptname.php on line 6', що робити?**\n\nВідредагуйте ваш php.ini та встановіть [com.allow\\_dcom](com.configuration.md#ini.com.allow-dcom)`=`**`true`**\n\n**Чи можливо за допомогою PHP завантажити/маніпулювати об'єктом ActiveX на сторінці?**\n\nPHP тут не до того. Об'єкти ActiveX завантажуються на стороні клієнта, якщо їх запросили з HTML документа. Зв'язку з PHP-скриптом тут немає і, отже, пряма взаємодія із серверною стороною неможлива.\n\n**Чи можливо отримати екземпляр компонента, що виконується?**\n\nЦе можливо за допомогою монікерів (monikers). Якщо ви хочете отримати кілька посилань на той самий екземпляр Word, ви можете створити цей екземпляр як показано:\n\n```php\n<?php\n$word = new COM(\"C:\\docs\\word.doc\");\n?>\n```\n\nЦе створить новий екземпляр, якщо немає доступного екземпляра або буде повернуто посилання на екземпляр, якщо такий доступний.\n\n**Чи є спосіб обробити подію, надіслану об'єктом COM?**\n\nИспользуя[com\\_event\\_sink()](function.com-event-sink.md) ви можете визначити приймач події та прив'язати його. Ви можете змусити PHP згенерувати скелет класу приймача подій, використовуючи [com\\_print\\_typeinfo()](function.com-print-typeinfo.md)\n\n**У мене виникають проблеми при спробі викликати метод об'єкта COM, який надає більш ніж один інтерфейс. Що я можу зробити?**\n\nВідповідь така ж проста, як і незадовільна. Не знаю точно, але гадаю, що ви не можете нічого зробити. Якщо хтось має точну інформацію з цього питання, будь ласка, дайте [»Мені](mailto:harald.radi@nme.at) знати :)\n\n**Отже, PHP працює з COM, як щодо COM+?**\n\nCOM+ розширює COM, надаючи систему для керування компонентами через MTS та MSMQ, але тут немає нічого особливого, що PHP має підтримувати для використання таких компонентів.\n\n**Якщо PHP може маніпулювати COM-об'єктами, чи можна уявити використання MTS для управління ресурсами компонентів у з'єднанні з PHP?**\n\nСам PHP ще не обробляє транзакції. Отже, якщо виникає помилка, відкат не ініціюється. Якщо ви використовуєте компоненти, що підтримують транзакції, вам необхідно буде реалізувати управління транзакціями самим.\n","title":"PHP та COM","contentType":2,"navigation":[{"faq.md.md":"« PHP та HTML"},{"faq.misc.md":"Різні питання »"},{"index.md":"PHP Manual"},{"faq.md":"ЧАВО"}]}},"__N_SSG":true}