{"pageProps":{"page":{"slug":"faq.general.md","content":"# Загальна інформація\n\nЦей розділ містить найбільш загальні питання щодо PHP: що це таке і що він робить.\n\n1.  [Що таке PHP?](#faq.general.what)\n2.  [Що означає PHP?](#faq.general.acronym)\n3.  [Який зв'язок між версіями PHP?](#faq.general.relation-versions)\n4.  [Чи можу я одночасно запускати кілька версій PHP?](#faq.general.running-concurent)\n5.  [Я думаю, я знайшов помилку! Кому я маю сказати?](#faq.general.bug)\n\n**Що таке PHP?**\n\nИз[передмови до керівництва](preface.md) :\n\nPHP - це скриптова мова, яка може бути вбудована в HTML. Синтаксис мови здебільшого запозичений з C, Java і Perl c додаванням декількох специфічних для PHP особливостей. Мета мови - дозволити веб-розробникам легко створювати сторінки, що динамічно генеруються.\n\n**Що означає PHP?**\n\nPHP означає *PHP: Hypertext Preprocessor*. Ця назва бентежить багатьох людей, оскільки перше слово акронімі також є акронімом. Такий тип акронімів називається рекурсивним. Цікаві можуть відвідати [» безкоштовний обчислювальний онлайн-словник](http://foldoc.org/) або [» статтю Вікіпедії з рекурсивних акронімів](http://en.wikipedia.org/wiki/Recursive_acronym)\n\n**Який зв'язок між версіями PHP?**\n\nPHP/FI 2.0 - рання і більш непідтримувана версія PHP. PHP 3 – покращена заміна PHP/FI 2.0. PHP 8 - поточна версія, яка використовує Zend engine 4, яка, крім іншого, пропонує безліч додаткових можливостей для [об'єктно-орієнтованого програмування](language.oop5.md)\n\n**Чи можу я одночасно запускати кілька версій PHP?**\n\nТак. Дивіться файл INSTALL із дистрибутива вихідних кодів PHP.\n\n**Я думаю, я знайшов помилку! Кому я маю сказати?**\n\nВам потрібно звернутися до бази даних помилок у PHP та переконатися, що помилка ще не відома. Якщо ви не бачите її у базі даних, заповніть форму повідомлення про помилки. При занесенні до бази даних, помилка отримує номер, за яким ви можете відстежувати її статус, тому важливо використовувати базу даних, а не просто надіслати повідомлення до одного зі списків розсилки, оскільки це дозволить вам пізніше повернутися та перевірити стан помилки. Базу даних помилок можна знайти за адресою [» https://github.com/php/php-src/issues](https://github.com/php/php-src/issues)\n","title":"Загальна інформація","contentType":2,"navigation":[{"faq.md":"« ПОЧАТОК"},{"faq.mailinglist.md":"Списки розсилки »"},{"index.md":"PHP Manual"},{"faq.md":"ЧАВО"}]}},"__N_SSG":true}