{"pageProps":{"page":{"slug":"faq.databases.md","content":"# Питання щодо Баз даних\n\nЦей розділ містить спільні питання зв'язку між PHP і базами даних. Так, сьогодні практично будь-яка база даних може бути доступна з PHP.\n\n1.  [Я чув, що можна отримати доступ до Microsoft SQL сервера з PHP. Як?](#faq.databases.mssql)\n2.  [Чи можу я отримати доступ до баз даних Microsoft Access?](#faq.databases.access)\n\n**Я чув, що можна отримати доступ до Microsoft SQL сервера з PHP. Як?**\n\nНа Unix ви можете використовувати [PDO\\_ODBC](ref.pdo-odbc.md) або [Уніфікований ODBC API](book.uodbc.md)\n\nНа Windows можна використовувати [PDO\\_SQLSRV](ref.pdo-sqlsrv.md) або [SQLSRV](book.sqlsrv.md)\n\nТакож дивіться відповідь на запитання.\n\n**Чи можу я отримати доступ до баз даних Microsoft Access?**\n\nЯкщо ви хочете зв'язати PHP, що виконується на Unix, і MS Access на Windows, вам будуть потрібні драйвери ODBC для Unix. Такі ODBC драйвери для Unix є у [» OpenLink Software](http://www.openlinksw.com/)\n\nІнша можливість - зберігати дані на SQL сервері, який має ODBC драйвери для Windows, а потім звертатися до цієї бази даних з Microsoft Access (використовуючи ODBC) і з PHP (використовуючи вбудовані драйвери) або використовувати проміжний формат, зрозумілий і для Access, і для PHP, наприклад, прості файли чи бази даних dBase. З цього приводу Тім Хейз (Tim Hayes) із OpenLink software пише:\n\n> Використання проміжної бази даних - не дуже хороша ідея, коли можна працювати з базою даних безпосередньо з PHP через ODBC, наприклад з драйверами від OpenLink. Якщо вам таки треба використовувати проміжний формат, OpenLink випустив Virtuoso (механізм віртуальної бази даних) для NT, Linux та інших платформ Unix. Будь ласка, відвідайте наш [\" веб сайт](http://www.openlinksw.com/) для безкоштовного завантаження.\n\nІнший перевірений варіант - використовувати MySQL з її MyODBC драйверами на Windows і синхронізувати бази даних. Стів Лоренс (Steve Lawrence) пише:\n\n-   Встановіть MySQL відповідно до інструкцій, що поставляються з нею. Остання версія доступна з[» http://www.mysql.com/](http://www.mysql.com/). Особливої ​​конфігурації не потрібно, за винятком того, що при налаштуванні баз даних та створенні користувача, в полі хоста ви повинні помістити % або ім'я Windows машини, на яку ви хочете отримати доступ з MySQL. Запишіть ім'я сервера, ім'я користувача та пароль.\n-   Завантажте драйвер MyODBC для Windows із сайту MySQL. Встановіть його на Windows. Ви можете перевірити його працездатність за допомогою утиліт, що поставляються з ним.\n-   Створіть користувача або системний dsn у адміністраторі ODBC, розташованому в контрольній панелі. Створіть ім'я dsn, введіть ім'я хоста, ім'я користувача, пароль тощо. для вашої бази даних MySQL, налаштованої на першому етапі.\n-   Встановіть повну версію Access, це дасть вам упевненість, що ви отримаєте всі необхідні розширення (add-ins). Принаймні вам будуть потрібні підтримка ODBC і адміністратор пов'язаних таблиць.\n-   І тепер найцікавіше! Створіть нову базу даних Access. У вікні таблиці клацніть правою кнопкою мишки та виберіть Link Tables (Зв'язати Таблиці), або з файлового меню виберіть Get External Data (Отримати Зовнішні Дані), а потім Link Tables. У вікні перегляду файлів виберіть файли типу ODBC. Виберіть системний dsn та ім'я вашого dsn, створеного на 3-му кроці. Виберіть таблицю для зв'язку, натисніть OK та вуаля! Тепер ви можете відкрити таблицю та додати/видалити/відредагувати дані на вашому MySQL сервері! Ви також можете будувати запити, імпортувати/експортувати таблиці в MySQL, створювати форми та звіти тощо.\n\nКорисні поради та трюки:\n\n-   Ви можете створювати таблиці в Access, експортувати їх в MySQL і потім прив'язати їх назад. Це підвищує швидкість створення таблиць.\n-   При створенні таблиць в Access, ви повинні визначити первинний ключ, щоб мати доступ до таблиці запису. Переконайтеся, що ви створили первинний ключ MySQL перед тим як прив'язати таблицю до Access.\n-   Якщо ви змінюєте таблицю в MySQL, ви повинні зв'язати її з Access по нової. Ідіть у tools>add-ins>linked table manager, дотримуйтесь вашого ODBC DSN, і виберіть звідти таблицю для перев'язки. Там же ви можете змінити джерело вашого dsn, для цього, перш ніж натиснути OK, просто позначте \"always prompt for new location\" (завжди вимагати нове місцезнаходження).\n","title":"Питання щодо Баз даних","contentType":2,"navigation":[{"faq.obtaining.md":"« Отримання PHP"},{"faq.installation.md":"Встановлення »"},{"index.md":"PHP Manual"},{"faq.md":"ЧАВО"}]}},"__N_SSG":true}