{"pageProps":{"page":{"slug":"faq.mailinglist.md","content":"# Списки розсилки\n\nЦей розділ містить питання про те, як зв'язатися з PHP спільнотою. Найкращий спосіб – списки розсилки.\n\n1.  [Чи є якісь списки розсилки по PHP?](#faq.mailinglist.isthere)\n2.  [Чи існують інші спільноти?](#faq.mailinglist.others)\n3.  [Чи можу я розпочати свій власний список розсилки PHP?](#faq.mailinglist.myown)\n4.  [Допоможіть! Схоже, я не можу передплатити/відписатися?](#faq.mailinglist.subscribing)\n5.  [Чи існує десь архів списків розсилки?](#faq.mailinglist.archive)\n6.  [Про що я можу запитувати у списку розсилки?](#faq.mailinglist.question)\n7.  [Яку інформацію я маю включити під час надсилання до списку?](#faq.mailinglist.guideline)\n\n**Чи є якісь списки розсилки по PHP?**\n\nЗвичайно! Існує безліч списків розсилки на різні теми. Повний перелік списків можна знайти на нашій сторінці [» списків розсилки](https://www.php.net/mailing-lists.php)\n\nНайбільш загальний список розсилки - `php-general`. Щоб підписатися на нього, надішліть порожній лист на адресу [» php-general-subscribe@lists.php.net](mailto:php-general-subscribe@lists.php.net). Щоб відписатися, надішліть порожній лист на адресу [» php-general-unsubscribe@lists.php.net](mailto:php-general-unsubscribe@lists.php.net)\n\nТакож ви можете передплатити/відписатися, використовуючи веб-інтерфейс на нашій сторінці [» списків розсилки](https://www.php.net/mailing-lists.php), а інструкції з відписки включені внизу кожного повідомлення з розсилки.\n\n**Чи існують інші спільноти?**\n\nБезліч по всьому світу. На нашій сторінці [» підтримки](https://www.php.net/support.php) Наприклад, є посилання на деякі ресурси (і інформація про те, як дізнатися більше).\n\n**Чи можу я розпочати свій власний список розсилки PHP?**\n\nЗвичайно! Насправді ми не тільки (безкоштовно) дозволяємо це, ми це заохочуємо! Допомагаючи та ділячись своїм знанням та досвідом з PHP з іншими, ви заохочуєте зростання та розробку як глобальної спільноти PHP, так і самої мови.\n\n**Допоможіть! Схоже, я не можу передплатити/відписатися?**\n\nЯкщо у вас виникла проблема з підпискою або відпискою від списку розсилки, можливо це тому, що програмне забезпечення списку розсилки не може визначити вашу правильну поштову адресу. Якщо ваша адреса була `joeblow@example.com`, і ви намагаєтеся підписатися на php-general, то ви можете надіслати запит на передплату за адресою `php-general-subscribe-joeblow=example.com@lists.php.net`, або запит на відписку на адресу `php-general-unsubscribe-joeblow=example.com@lists.php.net`. Використовуйте аналогічні адреси для інших списків розсилки.\n\nНайчастіша причина, через яку люди не можуть відписатися від наших списків розсилки, це використання пересилання пошти. Наприклад, якщо ваша електронна адреса [danbrown@example.com](mailto:danbrown@example.com)але ви підписалися на список розсилки з адреси [php-lists@example.com](mailto:php-lists@example.com), який пересилає її вам на [danbrown@example.com](mailto:danbrown@example.com), то спроба відписати адресу [danbrown@example.com](mailto:danbrown@example.com) не спрацює, тому що ця адреса невідома нашій системі. Натомість вам потрібно відписати ту адресу, на яку надходить пошта, у цьому прикладі це [php-lists@example.com](mailto:php-lists@example.com)\n\n**Чи існує десь архів списків розсилки?**\n\nТак, список архівів можна знайти на сторінці [» списків розсилки](https://www.php.net/mailing-lists.php). . Ви також можете знайти дюжини сайтів, які архівують та/або віддають зміст наших списків розсилок за допомогою вашої улюбленої пошукової системи, запитавши \"архіви списків розсилок по php\" (php mailing list archives).\n\nПовідомлення зі списків розсилки також зберігаються як статті новин. Сервер новин доступний за адресою [» news://news.php.net/](news://news.php.net/), новини з якого можна читати якимось новинним клієнтом. Також є експериментальний веб-інтерфейс для сервера новин, доступний за адресою [» http://news.php.net/](http://news.php.net/)\n\n**Про що я можу запитувати у списку розсилки?**\n\nЗ популярністю PHP, що зростає з кожним днем, навантаження на список розсилки php-general збільшилося і на сьогодні становить приблизно від 75 до 200 і більше повідомлень на день. Тому, на користь усіх, використовуйте список розсилки тільки в крайньому випадку, коли пошуки у всіх інших можливих місцях завершилися невдало.\n\nПерш ніж відправити повідомлення до списку, будь ласка, перегляньте цей FAQ і цей посібник, може в них вам вдасться знайти вирішення вашої проблеми. Якщо там нічого не вдалося знайти, перегляньте архіви списку (дивіться вище). Якщо у вас проблема з встановленням або налаштуванням PHP, будь ласка, прочитайте всю супроводжуючу документацію та файли README. Якщо після цього вам не вдалося знайти відповідь, то ваше запитання у списку розсилки більш ніж бажане.\n\nДля отримання найкращих відповідей, (і щоб не засмучувати ваших побратимів-програмістів), будь ласка, перевірте, що ви надсилаєте своє запитання у відповідний список розсилки. Наприклад, якщо у вас проблема з встановленням PHP, ви повинні надіслати своє запитання до списку розсилки `php-install`. Застереження: деякі списки мають схожі імена та зовсім різні призначення; питання щодо використання PHP-скриптів у Windows повинен бути відправлений в список розсилки - Windows PHP users, а *не*список PHP разработчиков в Windows - Windows Internals list.\n\nХороша ідея, перш ніж ставити запитання, прочитати статтю [» Як розумно ставити запитання](http://www.catb.org/~esr/faqs/smart-questions.md)\n\n**Яку інформацію я маю включити під час надсилання до списку?**\n\nПовідомлення типу \"Не можу запустити PHP! Допоможіть мені! У чому річ?\" абсолютно марні. Якщо у вас є проблема із запуском PHP, ви повинні вказати операційну систему, версію PHP, як ви його отримали (прекомпільований, Git, RPM тощо), що вже зробили, на чому зупинилися, і, якщо є, точне повідомлення про помилки.\n\nЦе також стосується будь-якої іншої проблеми. Вам необхідно вказати, що ви вже зробили, на чому зупинилися, що намагаєтеся робити і, якщо є, будь-які повідомлення про помилки. Якщо проблема з вашим вихідним кодом, то треба включити частину коду, яка не працює, вказавши проблемний рядок відповідно до розміщеного коментаря. Але не намагайтеся надіслати більше, ніж потрібно! Інакше ваше повідомлення важко читати і більшість людей його просто пропустить. Якщо ви не можете вирішити, який обсяг інформації достатній, надішліть стільки, скільки необхідно з вашої поточної проблеми, і приготуйтеся надіслати більше інформації на запит.\n\nІнша важлива річ, яку варто пам'ятати, це короткий виклад вашої проблеми у рядку теми повідомлення. Заголовки типу \"ДОПОМОЖІТЬ МЕНІШЕ!!!\" або \"У чому тут проблема?\" будуть проігноровані більшістю читачів.\n\nІ наостанок, для загальної користі і особливо для вас, рекомендується прочитати статтю [» Як розумно ставити запитання](http://www.catb.org/~esr/faqs/smart-questions.md)\n","title":"Списки розсилки","contentType":2,"navigation":[{"faq.general.md":"\" Загальна інформація"},{"faq.obtaining.md":"Отримання PHP »"},{"index.md":"PHP Manual"},{"faq.md":"ЧАВО"}]}},"__N_SSG":true}