{"pageProps":{"page":{"slug":"faq.build.md","content":"# Проблеми збирання\n\nУ цьому розділі зібрані найбільш загальні помилки, що виникають на етапі збирання.\n\n1.  [Я отримав останню версію PHP, використовуючи анонімний доступ до Git, але немає конфігураційного скрипта!](#faq.build.configure)\n2.  [У мене виникають проблеми з конфігурацією PHP для роботи з Apache. Він каже, що не може знайти httpd.h, хоча файл знаходиться саме там, де я сказав!](#faq.build.configuring)\n3.  [Під час конфігурації PHP (./configure) ви натрапляєте на помилку, схожу з наступною: checking lex output file root... . giving up](#faq.build.lex)\n4.  [Коли я намагаюся запустити Apache, я отримую наступне повідомлення: fatal: relocation error: file /path/to/libphp4.so: symbol ap\\_block\\_alarms: referenced symbol not found](#faq.build.apache-sharedcore)\n5.  [Коли я запускаю configure, він каже, що не може знайти файли include або бібліотеки для GD, gdbm або будь-якого іншого пакета!](#faq.build.not-found)\n6.  [При компіляції файлу language-parser.tab.c мені видаються помилки, які говорять yytname undeclared.](#faq.build.yytname)\n7.  [Коли я запускаю make, схоже, він виконується нормально, але на кінцевому лінку скаржиться, що не може знайти деякі файли.](#faq.build.link)\n8.  [При компонуванні PHP він скаржиться на деякі невизначені посилання.](#faq.build.undefined)\n9.  [Я дотримувався всіх кроків для встановлення модульної версії для Apache на Unix, але мої PHP-скрипти виводяться в браузері або я отримую запит зберегти файл.](#faq.build.not-running)\n10.  [У документації рекомендується використовувати: --activate-module=src/modules/php4/libphp4.a, але такий файл не існує, тому я замінив це на --activate-module=src/modules/php4/libmodphp4.a і воно не працює!? Що відбувається?](#faq.build.activate-module)\n11.  [Коли я намагаюся зібрати Apache з PHP у вигляді статичного модуля, використовуючи --activate-module=src/modules/php4/libphp4.a він каже, що мій компілятор не ANSI-сумісний.](#faq.build.ansi)\n12.  [Коли я намагаюся зібрати PHP за допомогою --with-apxs, я отримую дивне повідомлення про помилку.](#faq.build.apxs)\n13.  [Під час виконання make я дуже швидко отримую помилки та безліч всяких RUSAGE\\_](#faq.build.microtime)\n14.  [При PHP компіляції з MySQL, configure виконується нормально, але під час make я отримую помилку типу наступної: ext/mysql/libmysqlclient/my\\_tempnam.o(.text+0x46): In function my\\_tempnam': /php4/ext/mysql/libmysqlclient/my\\_tempnam.c:103: the use of tempnam' is dangerous, better use mkstemp', у чому справа?](#faq.build.mysql.tempnam)\n15.  [Я хочу оновити мій PHP. Де я можу знайти рядок ./configure, який був використаний для моєї поточної PHP установки?](#faq.build.upgrade)\n16.  [При складанні PHP з бібліотекою GD або видаються дивні помилки компіляції або помилки сегментації (segfaults) при виконанні.](#faq.build.gdlibs)\n17.  [При компіляції PHP я, здається, отримую випадкові помилки, наприклад, вона зависає. Я використовую Solaris якщо це має значення.](#faq.installation.needgnu)\n\n**Я отримав останню версію PHP, використовуючи анонімний доступ до Git, але немає конфігураційного скрипта!**\n\nВам потрібний встановлений пакет GNU autoconf для того, щоб згенерувати конфігураційний скрипт із configure.in. Після отримання вихідних з Git сервера просто запустіть **./buildconf** у директорії верхнього рівня. (Також, якщо ви запускаєте **configure** без опції `--enable-maintainer-mode`, то конфігураційний скрипт не буде перебудовано автоматично при зміні файлу configure.in, тому вам необхідно робити це вручну, коли ви помітите, що configure.in змінився. Один із симптомів - поява таких речей як @VARIABLE@ у вашому Makefile після виконання configure або config.status.)\n\n**У мене виникають проблеми з конфігурацією PHP для роботи з Apache. Він каже, що не може знайти httpd.h, хоча файл знаходиться саме там, де я сказав!**\n\nДля configure/setup скрипта необхідно вказати директорію верхнього рівня, в якій знаходяться вихідні коди Apache. Це означає, що вам потрібно поставити **\\--with-apache=/path/to/apache**, а*не* **\\--with-apache=/path/to/apache/src**\n\n\\*\\*Під час конфігурації PHP (`./configure`) Ви натрапляєте на помилку, схожу з наступною:\n\nchecking lex output file root... ./configure: lex: command not found  \nconfigure: error: cannot find output from lex; giving up\n\n\\*\\*\n\nНе забудьте уважно прочитати інструкції з [установці](install.unix.md) та зауважте, що для компіляції PHP вам потрібно встановити як flex, так і bison. Залежно від ваших налаштувань, встановіть bison і flex або з вихідних кодів, або з пакетів, наприклад, RPM.\n\n\\*\\*Коли я намагаюся запустити Apache, я отримую наступне повідомлення:\n\nfatal: relocation error: file /path/to/libphp4.so:  \nsymbol ap\\_block\\_alarms: referenced symbol not found\n\n\\*\\*\n\nЦя помилка зазвичай з'являється, якщо ядро ​​Apache було скомпільовано як бібліотека DSO (Dynamic Shared Object), що розділяється. Спробуйте переконфігурувати Apache, використовуючи принаймні такі прапори:\n\n\\--enable-shared=max --enable-rule=SHARED\\_CORE\n\nДля більш детальної інформації читайте файл INSTALL у директорії верхнього рівня або [»  сторінку керівництва Apache за DSO](http://httpd.apache.org/docs/current/dso.md)\n\n**Коли я запускаю configure, він каже, що не може знайти файли include або бібліотеки для GD, gdbm або будь-якого іншого пакета!**\n\nВи можете зробити так, що скрипт configure буде шукати файли заголовків або бібліотеки в нестандартних місцях, задавши додаткові прапори для препроцесора і компонувальника, такі як:\n\n```\nCPPFLAGS=-I/path/to/include LDFLAGS=-L/path/to/library ./configure\n```\n\nЯкщо ви використовуєте csh-подібну оболонку (навіщо?), Це буде:\n\n```\nenv CPPFLAGS=-I/path/to/include LDFLAGS=-L/path/to/library ./configure\n```\n\n**При компіляції файлу language-parser.tab.c мені видаються помилки, які говорять `yytname undeclared`**\n\nВам необходимо обновить вашу версию Bison. Последнюю версию можно найти на[» http://www.gnu.org/software/bison/bison.md](http://www.gnu.org/software/bison/bison.md)\n\n**Когда я запускаю**make\\*\\*, схоже, він виконується нормально, але на кінцевому лінківці скаржиться, що не може знайти деякі файли.\\*\\*\n\nДеякі старі версії make помилково не поміщають скомпіловані файли в піддиректорію функцій у тій же директорії. Спробуйте виконати **cp\\*.o functions** а потім перезапустити **make**. Якщо це допомогло, вам дійсно потрібно встановити свіжу версію GNU make.\n\n**При компонуванні PHP він скаржиться на деякі невизначені посилання.**\n\nПодивіться на рядок для компонування та переконайтеся, що всі необхідні бібліотеки додані наприкінці. Часто забувають '-ldl' і бібліотеки, необхідні підтримки включних вручну баз даних.\n\nДеякі люди також повідомляють, що при компонуванні з Apache їм довелося додати '-ldl' одразу після libphp4.a.\n\n**Я дотримувався всіх кроків для встановлення модульної версії для Apache на Unix, але мої PHP-скрипти виводяться в браузері або я отримую запит зберегти файл.**\n\nЦе означає, що модуль PHP з якоїсь причини не викликається. Перед тим, як звертатися за допомогою, перевірте три речі:\n\n-   Переконайтеся, що бінарник httpd, що запускається вами, дійсно новий, щойно побудований httpd. Для цього спробуйте запустити:`/path/to/binary/httpd -l`Якщо ви не бачите mod\\_php4.c у списку, то ви запускаєте не той бінарник. Знайдіть та встановіть правильний бінарник.\n-   Переконайтеся, що ви додали правильний Mime Type до одного з ваших`Apache .conf`файлів. Це повинно бути:`AddType application/x-httpd-php .php`Також переконайтеся, що цей рядок AddType не потрапив усерединуилиблоку, так як це не дасть їй працювати з місцезнаходженням тестового скрипта.\n-   Нарешті, між Apache 1.2 та Apache 1.3 розташування конфігураційних файлів Apache за умовчанням змінилося. Вам потрібно перевірити, чи дійсно читається той конфігураційний файл, до якого ви додали рядок AddType. Ви можете внести очевидну синтаксичну помилку до вашого httpd.conf файлу або будь-якої іншої помітної зміни, яка покаже вам, що читається правильний файл.\n\n**У документації рекомендується використовувати: `--activate-module=src/modules/php4/libphp4.a`, але такий файл не існує, тому я замінив це на `--activate-module=src/modules/php4/libmodphp4.a` і воно не працює!? Що відбувається?**\n\nЗауважте, що файл libphp4.a не повинен існувати. Він буде створений у процесі!\n\n**Коли я намагаюся зібрати Apache з PHP у вигляді статичного модуля, використовуючи `--activate-module=src/modules/php4/libphp4.a` він каже, що мій компілятор не ANSI-сумісний.**\n\nПовідомлення про помилку вводить в оману; це виправлено у свіжих версіях Apache.\n\n**Коли я намагаюся зібрати PHP за допомогою **\\--with-apxs**я отримую дивне повідомлення про помилку.**\n\nПеревірте три речі. По-перше, з якоїсь причини, коли Apache створює Perl скрипт apxs, він виходить без правильного компілятора та змінних, які задають прапори. Знайдіть ваш apxs скрипт (спробуйте команду **which apxs**), іноді він встановлений як /usr/local/apache/bin/apxs або /usr/sbin/apxs. Відкрийте його і знайдіть рядки, схожі на такі:\n\n```\nmy $CFG_CFLAGS_SHLIB  = ' ';          # substituted via Makefile.tmpl\nmy $CFG_LD_SHLIB      = ' ';          # substituted via Makefile.tmpl\nmy $CFG_LDFLAGS_SHLIB = ' ';          # substituted via Makefile.tmpl\n```\n\nЯкщо вони так і виглядають, ви знайшли вашу проблему. Вони можуть містити лише прогалини або інші неправильні значення, такі як q(). Змініть ці рядки на:\n\n```\nmy $CFG_CFLAGS_SHLIB  = '-fpic -DSHARED_MODULE'; # substituted via Makefile.tmpl\nmy $CFG_LD_SHLIB      = 'gcc';                   # substituted via Makefile.tmpl\nmy $CFG_LDFLAGS_SHLIB = q(-shared);              # substituted via Makefile.tmpl\n```\n\nДруга можлива проблема виникає лише на Red Hat 6.1 та 6.2. Скрипт apxs, що поставляється з Red Hat, зламаний. Шукайте цей рядок:\n\n```\nmy $CFG_LIBEXECDIR    = 'modules';         # substituted via APACI install\n```\n\nЯкщо ви знайшли вищенаведений рядок, змініть його на наступне:\n\n```\nmy $CFG_LIBEXECDIR    = '/usr/lib/apache'; # substituted via APACI install\n```\n\nІ останнє, якщо ви переконфігуруєте/встановлюєте Apache, запустіть **make clean**после\\*\\*./configure**и перед**make\\*\\*\n\n**Під час виконання **make** я дуже швидко отримую помилки і безліч всяких `RUSAGE_`**\n\nПри виконанні **make** під час встановлення, якщо ви стикаєтеся з проблемами, схожими на наступне:\n\n```\nmicrotime.c: In function `php_if_getrusage':\nmicrotime.c:94: storage size of `usg' isn't known\nmicrotime.c:97: `RUSAGE_SELF' undeclared (first use in this function)\nmicrotime.c:97: (Each undeclared identifier is reported only once\nmicrotime.c:97: for each function it appears in.)\nmicrotime.c:103: `RUSAGE_CHILDREN' undeclared (first use in this function)\nmake[3]: *** [microtime.lo] Error 1\nmake[3]: Leaving directory `/home/master/php-4.0.1/ext/standard'\nmake[2]: *** [all-recursive] Error 1\nmake[2]: Leaving directory `/home/master/php-4.0.1/ext/standard'\nmake[1]: *** [all-recursive] Error 1\nmake[1]: Leaving directory `/home/master/php-4.0.1/ext'\nmake: *** [all-recursive] Error 1\n```\n\nВаша система зламана. Ви повинні виправити файли /usr/include, встановивши пакет glibc-devel, який відповідає вашому glibc. Це абсолютно не залежить від PHP. Для доказу спробуйте наступний простий тест:\n\n```\n$ cat >test.c <<X\n#include <sys/resource.h>\nX\n$ gcc -E test.c >/dev/null\n```\n\nЯкщо видаються помилки, ваші include файли зіпсовані.\n\n\\**При компіляції PHP з MySQL, configure виконується нормально, але під час `make`я получаю ошибку типа следующей:*ext/mysql/libmysqlclient/my\\_tempnam.o(.text+0x46): In function my\\_tempnam': /php4/ext/mysql/libmysqlclient/my\\_tempnam.c:103: the use of tempnam' is dangerous, better use mkstemp'*, в чому справа?*\\*\n\nПо-перше, важливо розуміти, що це `Warning` (попередження), а чи не фатальна помилка. Так як це останнє, що виводиться під час `make`, вона може виглядати як фатальна помилка, але це не так. Звичайно, якщо ваш компілятор вмирає на попередженнях (Warnings), тоді так. Також майте на увазі, що підтримка MySQL включена за умовчанням.\n\n> **Зауваження** :\n> \n> Починаючи з PHP 4.3.2, ви також будете бачити наступний текст після того, як збірка (make) завершиться:\n> \n> Build complete.  \n> (It is safe to ignore warnings about tempnam and tmpnam).  \n> (Складання завершено, можна безпечно ігнорувати  \n> попередження про tempnam та tmpnam.)\n\n**Я хочу оновити мій PHP. Де я можу знайти рядок **./configure**яка була використана для моєї поточної PHP установки?**\n\nАбо дивіться файл config.nice у дереві вихідних записів вашої поточної PHP установки, або, якщо це недоступно, просто виконайте скрипт:\n\n```php\n<?php phpinfo(); ?>\n```\n\nНа початку виводу буде рядок **./configure**, яка була використана для збирання поточного PHP.\n\n**При складанні PHP з бібліотекою GD або видаються дивні помилки компіляції або помилки сегментації (segfaults) при виконанні.**\n\nПереконайтеся, що ваша бібліотека GD і PHP компонуються з тими самими залежними бібліотеками (наприклад, libpng).\n\n**При компіляції PHP я, здається, отримую випадкові помилки, наприклад, вона зависає. Я використовую Solaris якщо це має значення.**\n\nВикористання не утиліт GNU під час компіляції PHP може викликати проблеми. Щоб бути впевненим, що компіляція PHP буде працювати, використовуйте утиліти GNU. Наприклад, у Solaris, використання SunOS BSD-сумісної або Solaris версії `sed` не працюватиме, а GNU або Sun POSIX (xpg4) версії `sed` буде. Посилання: [» GNU sed](http://www.gnu.org/software/sed/sed.md) [» GNU flex](http://www.gnu.org/software/flex/flex.md), and[» GNU bison](http://www.gnu.org/software/bison/bison.md)\n","title":"Проблеми збирання","contentType":2,"navigation":[{"faq.installation.md":"« Встановлення"},{"faq.using.md":"Використання PHP »"},{"index.md":"PHP Manual"},{"faq.md":"ЧАВО"}]}},"__N_SSG":true}