{"pageProps":{"page":{"slug":"features.xforms.md","content":"# Робота з XForms\n\n[» XForms](http://www.w3.org/MarkUp/Forms/) є альтернативою традиційним веб-формам і дозволяють використовувати їх на безлічі платформ і браузерів, а також реалізовувати нестандартні уявлення форм, наприклад, у вигляді PDF-документа.\n\nПерша істотна відмінність XForms полягає в тому, як форма надсилається клієнту. Керівництво [» XForms for HTML Authors](http://www.w3.org/MarkUp/Forms/2003/xforms-for-html-authors.md) містить детальний опис створення XForms. Щоб окреслити основну ідею керівництва, наведемо кілька простих прикладів.\n\n**Приклад #1 Проста пошукова форма XForms**\n\n<h:html xmlns:h=\"[http://www.w3.org/1999/xhtml\"](http://www.w3.org/1999/xhtml%22) xmlns=\"[http://www.w3.org/2002/xforms\">](http://www.w3.org/2002/xforms%22%3E) Пошук <h:body> <h:p> Що шукати? Знайти\n\nНаведена вище форма відображає текстове поле для введення (назване `q`) та кнопку для відправки форми, при натисканні на яку всі введені дані будуть відправлені скрипту, вказаному в полі `action`\n\nТут ми підійшли до ще однієї істотної різниці з погляду вашого веб-додатку. Стандартна HTML-форма надсилає дані як `application/x-www-form-urlencoded`, а XForms для передачі даних використовує XML розмітку.\n\nЯкщо ви вирішили працювати з XForms, швидше за все ви захочете отримати надіслані користувачем дані у форматі XML. У такому випадку зверніть увагу на змінну $HTTP\\_RAW\\_POST\\_DATA, в ній міститься XML-документ, згенерований браузером, який надалі можна обробити движком XSLT або парсером документа.\n\nЯкщо розмітка вас не цікавить, і ви хочете, щоб дані, що передаються, були поміщені в стандартний масив [$\\_POST](reserved.variables.post.md), Ви можете вказати клієнтському браузеру на необхідність надсилати дані у форматі `application/x-www-form-urlencoded`. Для цього встановіть атрибут `method`значением*urlencoded-post*\n\n**Приклад #2 Використання XForm разом із масивом [$\\_POST](reserved.variables.post.md)**\n\n<h:html xmlns:h=\"[http://www.w3.org/1999/xhtml\"](http://www.w3.org/1999/xhtml%22) xmlns=\"[http://www.w3.org/2002/xforms\">](http://www.w3.org/2002/xforms%22%3E) Пошук <h:body> <h:p> Що шукати? Знайти\n\n> **Зауваження**: На додаток до вищесказаного слід зауважити, що велика кількість браузерів не підтримують XForms. Якщо наведені приклади зазнали невдачі, перевірте версію браузера, який ви використовуєте.\n","title":"Робота з XForms","contentType":2,"navigation":[{"features.sessions.md":"« Сесії"},{"features.file-upload.md":"Завантаження файлів на сервер"},{"index.md":"PHP Manual"},{"features.md":"Особливості"}]}},"__N_SSG":true}