{"pageProps":{"page":{"slug":"features.commandline.introduction.md","content":"## Вступ\n\nОсновна мета цього CLI SAPI – розробка консольних програм на PHP. Існує досить багато відмінностей між CLI SAPI та іншими видами SAPI, які будуть розглянуті в цьому розділі. Варто зазначити, що CLI SAPI та CGI – різні SAPI-інтерфейси, хоча у поведінці багато спільного.\n\nCLI SAPI включається за замовчуванням за допомогою опції **\\--enable-cli**, але може бути вимкнений опцією **\\--disable-cli**при запуске\\*\\*./configure\\*\\*\n\nІм'я, розташування та існування бінарних модулів CLI/CGI залежить від того, як саме встановлений PHP у вашій системі. За умовчанням під час виконання **make** створюється як CGI-, так і CLI-модуль, розміщені в директоріях sapi/cgi/php-cgi та sapi/cli/php відповідно, всередині директорії з вихідними кодами PHP. Слід зазначити, що обидва файли мають однакову назву: php. Що станеться під час виконання **make install**залежить від того, які опції ви вказали на стадії конфігурування. Якщо вибрано модуль SAPI під час виконання, наприклад, apxs, або використовується опція опція **\\--disable-cgi**, модуль CLI буде скопійовано в {PREFIX}/bin/php під час виконання **make install**, інакше буде скопійовано CGI-модуль. НаПриклад, если задана опция**\\--with-apxs**, то при виконанні **make install**CLI-версія буде скопійована в {PREFIX}/bin/php. Якщо ви бажаєте перевизначити установку CGI-модуль, используйте**make install-cli** після виконання **make install**. Як альтернативу ви могли б вказати опцію **\\--disable-cgi** у рядку конфігурації.\n\n> **Зауваження** :\n> \n> Оскільки обидві опції, **\\--enable-cli** і **\\--enable-cgi**, включені за замовчуванням, просто наявність **\\--enable-cli** у команді конфігурації необов'язково означає, що CLI буде скопійовано в {PREFIX}/bin/php під час виконання **make install**\n\nБінарний файл CLI входить у дистрибутив для Windows в основній папці як файл php.exe. CGI-версія міститься у файлі php-cgi.exe. Крім того, до дистрибутиву входить файл php-win.exe, якщо PHP був налаштований за допомогою **\\--enable-cli-win32**. Він повністю еквівалентний CLI-версії, за винятком того, що абсолютно нічого не виводить, і таким чином не надає консоль (вікно терміналу не з'являється на екрані).\n\n> **Зауваження** **Який із варіантів SAPI встановлено?**\n> \n> Виконайте з командного рядка **php -v** для отримання інформації про те, чи є PHP CGI або CLI. Також можна використовувати функцію [php\\_sapi\\_name()](function.php-sapi-name.md)или константу\\*\\*`PHP_SAPI`\\*\\*\n\n> **Зауваження** :\n> \n> Відповідну сторінку керівництва (`man`) Unix можна переглянути за допомогою команди **man php**в консоли.\n","title":"Вступ","contentType":2,"navigation":[{"features.commandline.md":"« Робота з PHP з командного рядка"},{"features.commandline.differences.md":"Основні відмінності від інших реалізацій SAPI"},{"index.md":"PHP Manual"},{"features.commandline.md":"Робота з PHP з командного рядка"}]}},"__N_SSG":true}