{"pageProps":{"page":{"slug":"features.connection-handling.md","content":"# Робота зі з'єднаннями\n\nСтатус з'єднання зберігається внутрішніми механізмами PHP. Нижче перераховані чотири можливі стани:\n\n-   0 - NORMAL\n-   1 - ABORTED\n-   2 - TIMEOUT\n-   3 - ABORTED та TIMEOUT\n\nПід час штатного виконання PHP-скрипту встановлено статус NORMAL. Якщо віддалений клієнт розірвав з'єднання, статус змінюється на ABORTED. Найчастіше від'єднання віддаленого клієнта відбувається при натисканні кнопки \"Stop\" у браузері. Якщо досягається встановлений часовий ліміт (ознайомтеся з функцією [set\\_time\\_limit()](function.set-time-limit.md)), буде встановлено статус TIMEOUT.\n\nВи можете вирішувати, чи призводить відключення клієнта до завершення вашого скрипту. Іноді буває необхідно, щоб скрипт виконався до кінця, навіть якщо відсутня віддалений браузер, якому адресовано весь висновок. За замовчуванням скрипт завершує роботу при відключенні клієнта. Ця поведінка може бути змінена за допомогою опції ignore\\_user\\_abort в конфигурационном файле php.ini. Такого же результата можно добиться, указав`php_value ignore_user_abort` у конфігураційному файлі Apache httpd.conf або скориставшись функцією [ignore\\_user\\_abort()](function.ignore-user-abort.md). Якщо ви не вказали на необхідність ігнорувати розрив з'єднання з клієнтом, виконання скрипту буде перервано. Винятком є ​​той випадок, якщо використовуючи [register\\_shutdown\\_function()](function.register-shutdown-function.md), ви вказали спеціальну функцію, що викликається після завершення скрипта. У такому випадку після того, як користувач натиснув кнопку \"Stop\" у своєму браузері, при першій спробі що-небудь вивести PHP виявляє, що з'єднання з клієнтом було втрачено, і викликає завершальну функцію. Ця функція також викликається при нормальному завершенні роботи вашого скрипта, тому для того, щоб виконати деякі специфічні дії при від'єднанні клієнта, вам знадобиться функція [connection\\_aborted()](function.connection-aborted.md), яка повертає \\*\\*`true`\\*\\*якщо з'єднання було розірвано.\n\nВиконання вашого скрипта також може бути перервано вбудованим таймером. Стандартне обмеження часу становить 30 секунд, змінити його можна за допомогою директиви **max\\_execution\\_time** у конфігураційному файлі php.ini. Такого ж результату можна досягти, додавши `php_value max_execution_time` у конфігураційний файл Apache httpd.conf або скориставшись функцією [set\\_time\\_limit()](function.set-time-limit.md). При досягненні скриптом тимчасового ліміту виконання скрипту переривається і викликається завершальна функція, якщо вона була вказана. Уточнити причину завершення скрипту можна за допомогою функції [connection\\_status()](function.connection-status.md), яка повертає 2, якщо скрипт був перерваний для досягнення тимчасового обмеження.\n\nЄдине, що слід помітити - що обидва статуси: ABORTED і TIMEOUT - можуть бути встановлені одночасно. Це може статися в тому випадку, якщо ви явно вказали на необхідність ігнорувати від'єднання віддаленого клієнта. У такому випадку після розриву з'єднання, відзначивши цей факт, PHP продовжить виконання скрипту, і при досягненні тимчасового ліміту буде викликана завершальна функція, якщо така була вказана. У цій точці ви можете виявити, що [connection\\_status()](function.connection-status.md) поверне значення 3.\n","title":"Робота зі з'єднаннями","contentType":2,"navigation":[{"features.remote-files.md":"« Робота з віддаленими файлами"},{"features.persistent-connections.md":"Постійні з'єднання з базами даних »"},{"index.md":"PHP Manual"},{"features.md":"Особливості"}]}},"__N_SSG":true}