{"pageProps":{"page":{"slug":"features.file-upload.common-pitfalls.md","content":"## Найбільш поширені помилки\n\nОпция`MAX_FILE_SIZE` не повинна дозволяти передачу файлів, розмір яких перевищує ліміт, встановлений конфігураційною директивою [upload\\_max\\_filesize](ini.core.md#ini.upload-max-filesize)в php.ini. Ограничение по умолчанию составляет 2 мегабайта.\n\nЯкщо встановлено обмеження пам'яті, вам може знадобитися збільшити значення опції [memory\\_limit](ini.core.md#ini.memory-limit). Переконайтеся, що значення [memory\\_limit](ini.core.md#ini.memory-limit)достаточно велико.\n\nУ випадку, якщо опція [max\\_execution\\_time](info.configuration.md#ini.max-execution-time) встановлена ​​надто маленьким значенням, необхідний час роботи скрипта може перевищувати це значення. Переконайтеся, що значення `max_execution_time`достаточно велико.\n\n> **Зауваження**: Директива[max\\_execution\\_time](info.configuration.md#ini.max-execution-time) стосується виключно часу, що використовується безпосередньо самим скриптом. Час, витрачений на зовнішні дії, такі як системні виклики за допомогою функції [system()](function.system.md) або [sleep()](function.sleep.md), звернення до бази даних, а також час, затрачений на завантаження файлу та інші дії, що відбуваються поза скриптом, не враховуються при визначенні максимально допустимого проміжку часу, відведеного для виконання скрипту.\n\n**Увага**\n\nДиректива[max\\_input\\_time](info.configuration.md#ini.max-input-time) вказує максимально допустимий час у секундах для отримання вхідних даних, у тому числі і файлів, що завантажуються. У випадку, якщо ви маєте справу з кількома або великими файлами, або віддалені користувачі використовують повільний канал, обмеження за замовчуванням `60` секунд може бути перевищено.\n\nЯкщо директива [post\\_max\\_size](ini.core.md#ini.post-max-size) занадто мала, великі файли не можуть бути завантажені на сервер. Переконайтеся, що значення директиви `post_max_size`достаточно велико.\n\nОпция[max\\_file\\_uploads](ini.core.md#ini.max-file-uploads) контролює максимальну кількість файлів, що завантажуються, протягом одного запиту. Якщо завантажується більше файлів, ніж зазначено в цьому обмеженні, то масив [$\\_FILES](reserved.variables.files.md) припинить подальшу обробку файлів після досягнення цього обмеження. Наприклад, якщо [max\\_file\\_uploads](ini.core.md#ini.max-file-uploads)установлено в`10`, то[$\\_FILES](reserved.variables.files.md) ніколи не міститиме більше 10 елементів.\n\nЯкщо не перевіряти, з якими файлами ви працюєте, користувачі можуть отримати доступ до конфіденційної інформації, розміщеної в інших директоріях.\n\nОскільки різні системи по-різному працюють із файловою структурою, немає жодних гарантій того, що файли з екзотичними іменами (наприклад, які містять пробілові символи) будуть оброблені коректно.\n\nРозробники не повинні використовувати однакові імена для звичайних полів уведення (тег `input`) та полів вибору файлу в межах однієї і тієї ж форми (наприклад, використовуючи ім'я для тега `input`наподобие`foo[]`\n","title":"Найбільш поширені помилки","contentType":2,"navigation":[{"features.file-upload.errors.md":"« Пояснення повідомлень про помилки"},{"features.file-upload.multiple.md":"Завантаження кількох файлів »"},{"index.md":"PHP Manual"},{"features.file-upload.md":"Завантаження файлів на сервер"}]}},"__N_SSG":true}