{"pageProps":{"page":{"slug":"fpm.status.md","content":"## Сторінка стану\n\nНа цій сторінці представлена ​​інформація про налаштування та зміст сторінки стану FPM. Дивіться також опис функції [fpm\\_get\\_status()](function.fpm-get-status.md)\n\n### Налаштування\n\nСторінку стану FPM можна увімкнути шляхом встановлення параметра конфігурації [pm.status\\_path](install.fpm.configuration.md#pm.status-path) у пулі FPM конфігурації.\n\n**Застереження**\n\nЗ метою безпеки сторінка стану FPM повинна бути обмежена внутрішніми запитами або відомими IP-адресами клієнтів, оскільки сторінка показує URL-адресу запиту та інформацію про доступні ресурси.\n\nВід конфігурації веб-сервера залежить, чи потрібно в його налаштуваннях дозволяти запити безпосередньо до цього шляху, оминаючи будь-які PHP-скрипти. Приклад конфігурації для сервера Apache з менеджером процесів FPM, який слухає UDS, і директивою `pm.status_path` із встановленим значенням `/fpm-status` буде виглядати так:\n\n<LocationMatch \"/fpm-status\"> Order Allow,Deny Allow from 127.0.0.1 ProxyPass \"unix:/var/run/php-fpm.sock|fcgi://localhost/fpm-status\"\n\nПісля перезавантаження або перезапуску менеджера FPM і веб-сервера сторінка стану буде доступна з браузера (за умови, що запит надходить з дозволеної IP-адреси, якщо було налаштовано обмеження IP-адрес).\n\n### Параметри запиту\n\nФормат виведення сторінки стану може бути змінено шляхом вказівки одного з наступних параметрів запиту:\n\n-   `html`\n-   `json`\n-   `openmetrics`\n-   `xml`\n\nДодаткову інформацію також можна повернути за допомогою параметра запиту `full`\n\nПриклади URL-адрес сторінок стану:\n\n-   `https://localhost/fpm-status`\\- Короткий висновок у текстовому форматі за замовчуванням\n-   `https://localhost/fpm-status?full`\\- Повний висновок у текстовому форматі за замовчуванням\n-   `https://localhost/fpm-status?json`\\- Короткий висновок у форматі JSON\n-   `https://localhost/fpm-status?html&full`\\- Повний висновок у форматі HTML\n\n### Відображувана інформація\n\nЗначення дати/часу використовують формат мітки часу UNIX у вихідних даних JSON та XML, інакше вони використовують формат, що призводить до наступного прикладу дати: `\"03/Jun/2021:07:21:46 +0100\"`\n\n**Основна інформація – завжди відображається на сторінці стану**\n\n| Параметр | Опис |\n| --- | --- |\n| pool | Ім'я пулу процесів FPM. |\n| proccess manager | Тип менеджера процесу - static (статичний), dynamic (динамічний) або ondemand (на вимогу). |\n| start time | Дата/час останнього запуску пулу процесів. |\n| start since | Час за секунди з моменту останнього запуску пулу процесів. |\n| accepted conn | Загальна кількість прийнятих сполук. |\n| listen queue | Кількість запитів (backlog), які очікують вільного процесу. |\n| max listen queue | Максимальна кількість запитів у черзі на прослуховування будь-якої миті часу. |\n| listen queue len | Максимально допустимий розмір черги прослуховування. |\n| idle processes | Кількість процесів, які зараз простоюють (очікують запитів). |\n| active processes | Кількість процесів, які нині опрацьовують запити. |\n| total processes | Поточна загальна кількість процесів. |\n| max active processes | Максимальна кількість одночасно активних процесів. |\n| max children reached | Чи було досягнуто максимальної кількості процесів? Якщо так, то відображуване значення буде , інакше значення буде |\n| slow requests | Загальна кількість запитів, які досягли налаштованого `request_slowlog_timeout` |\n\n**Інформація про кожний процес — відображається лише у режимі виводу `full`**\n\n| Параметр | Опис |\n| --- | --- |\n| pid | Системний процес PID. |\n| state | Стан процесу - Idle, Running, ... |\n| start time | Дата/час початку процесу. |\n| start since | Кількість секунд від початку процесу. |\n| requests | Загальна кількість обслуговуваних запитів. |\n| request duration | Загальний час у мікросекундах, витрачений обслуговування останнього запиту. |\n| request method | Метод HTTP останнього обслуговуваного запиту. |\n| request uri | URI останнього обслуженого запиту (після обробки веб-сервером він завжди може дорівнювати `/index.php`, якщо ви використовуєте шаблонний редирект фронт-контролера). |\n| content length | Довжина тіла запиту в байтах, останній запит. |\n| user | HTTP-користувач (`PHP_AUTH_USER`) останнього запиту. |\n| script | Повний шлях до скрипта, виконаного останнім запитом. Це буде `'-'`, якщо не застосовується (наприклад, запити сторінки стану). |\n| last request cpu | Відсоток зайнятого часу при виконанні останнього запиту. Це значення буде 0, якщо процес не в стані Idle, тому що обчислення проводиться після закінчення обробки запиту. Значення може перевищити 100 %, тому що метрика покаже, який відсоток від загального часу роботи процесора зайняв останній запит — у розрахунку будуть враховані процеси на всіх ядрах, тоді як 100 % — це значення тільки для одного ядра. |\n| last request memory | Максимальний обсяг пам'яті, спожитий останнім запитом. Це значення дорівнюватиме 0, якщо процес не простоює, так як обчислення проводиться після закінчення обробки запиту. |\n\n> **Зауваження** :\n> \n> Всі значення специфічні для пулу і скидаються під час перезапуску FPM.\n\n> **Зауваження** :\n> \n> У форматі OpenMetrics використовуються різні типи параметрів, щоб краще відповідати формату OpenMetrics. Параметри та опис їх значень включені у вихідні дані формату OpenMetrics.\n\n### список змін\n\n| Версия | Опис |\n| --- | --- |\n| 8.1.0 | Доданий формат OpenMetrics. |\n","title":"Сторінка стану","contentType":2,"navigation":[{"fpm.observability.md":"« Спостережуваність"},{"ref.fpm.md":"Функції FPM »"},{"index.md":"PHP Manual"},{"fpm.observability.md":"Спостережуваність"}]}},"__N_SSG":true}