{"pageProps":{"page":{"slug":"function.sqlsrv-errors.md","content":"# sqlsrv\\_errors\n\n(No version information available, might only be in Git)\n\nsqlsrv\\_errors — Повертає інформацію про помилку та попередження останньої виконаної операції SQLSRV\n\n### Опис\n\n```methodsynopsis\nsqlsrv_errors(int $errorsOrWarnings = ?): mixed\n```\n\nПовертає інформацію про помилку та попередження останньої виконаної операції SQLSRV.\n\n### Список параметрів\n\n`errorsOrWarnings`\n\nВизначає, чи повертаються відомості про помилки, попередження чи те й інше. Якщо параметр не вказано, повертаються як інформація про помилку, так і інформація про попередження. Підтримуються такі параметри: SQLSRV\\_ERR\\_ALL, SQLSRV\\_ERR\\_ERRORS, SQLSRV\\_ERR\\_WARNINGS.\n\n### Значення, що повертаються\n\nЯкщо при останній операції sqlsrv виникли помилки та/або попередження, повертається масив масивів, що містять інформацію про помилки. Якщо при останній операції sqlsrv не було помилок та/або попереджень, повертається **`null`**. У наступній таблиці описана структура масивів, що повертаються:\n\n**Масив, що повертається sqlsrv\\_errors**\n\n| Ключ | Опис |\n| --- | --- |\n| SQLSTATE | Для помилок, які виникають через драйвер ODBC, повертається SQLSTATE, що повертається ODBC. Для помилок, які виникають через драйвери Microsoft для PHP для SQL Server, SQLSTATE повертається IMSSP. Для попереджень, які виникають через драйвери Microsoft для PHP для SQL Server, SQLSTATE повертає значення 01SSP. |\n| code | Для помилок, які виникають через SQL Server повертає власний код помилки SQL Server. Для помилок, що виникають через драйвер ODBC, повертається код помилки, який повертається ODBC. Для помилок, які виникають через драйвери Microsoft для PHP для SQL Server, повертається код помилки Microsoft Drivers для PHP для SQL Server. |\n| message | Опис помилки. |\n\n### Приклади\n\n**Приклад #1 Приклад використання** functionname()\\*\\*\\*\\*\n\n```php\n<?php\n$serverName = \"serverName/sqlexpress\";\n$connectionInfo = array( \"Database\"=>\"dbName\", \"UID\"=>\"username\", \"PWD\"=>\"password\");\n$conn = sqlsrv_connect( $serverName, $connectionInfo);\nif( $conn === false ) {\n     die( print_r( sqlsrv_errors(), true));\n}\n\n/* Настройка запроса для выборки недопустимого имени столбца. */\n$sql = \"SELECT BadColumnName FROM Table_1\";\n\n/* Выполнение запроса завершится ошибкой из-за неправильного имени столбца. */\n$stmt = sqlsrv_query( $conn, $sql );\nif( $stmt === false ) {\n    if( ($errors = sqlsrv_errors() ) != null) {\n        foreach( $errors as $error ) {\n            echo \"SQLSTATE: \".$error[ 'SQLSTATE'].\"<br />\";\n            echo \"Код: \".$error[ 'code'].\"<br />\";\n            echo \"Сообщение: \".$error[ 'message'].\"<br />\";\n        }\n    }\n}\n?>\n```\n\n### Примітки\n\nЗа промовчанням попередження, що генеруються під час виклику будь-якої функції SQLSRV, обробляються як помилки. Це означає, що якщо під час виклику функції SQLSRV виникає попередження, функція повертає **`false`**. Проте попередження, що відповідають значенням SQLSTATE 01000, 01001, 01003 та 01S02, ніколи не розглядаються як помилки. Для отримання інформації про зміну цієї поведінки дивіться опис функції [sqlsrv\\_configure()](function.sqlsrv-configure.md)и параметр WarningsReturnAsErrors.\n\n### Дивіться також\n\n-   [sqlsrv\\_configure()](function.sqlsrv-configure.md) \\- Змінює конфігурацію обробки помилок драйвера та ведення журналу\n","title":"sqlsrv\\_errors","contentType":2,"navigation":[{"function.sqlsrv-connect.md":"« sqlsrv\\_connect"},{"function.sqlsrv-execute.md":"sqlsrv\\_execute »"},{"index.md":"PHP Manual"},{"ref.sqlsrv.md":"Функції SQLSRV"}]}},"__N_SSG":true}