{"pageProps":{"page":{"slug":"functions.internal.md","content":"## Вбудовані функції\n\nУ самому PHP міститься досить багато вбудованих функцій і мовних конструкцій. Також є функції, які вимагають, щоб PHP був зібраний з певними модулями, інакше генеруватимуться фатальні помилки, викликані використанням невідомої функції. Наприклад, для того, щоб використовувати [функції для роботи із зображеннями](ref.image.md), наПриклад,[imagecreatetruecolor()](function.imagecreatetruecolor.md)необхідно зібрати PHP з підтримкою GD. Або ж для того, щоб скористатися функцією [mysqli\\_connect()](function.mysqli-connect.md), необходима поддержка модуля[MySQLi](book.mysqli.md). Тим не менш, є багато вбудованих функцій, які доступні завжди: наприклад, [функції обробки рядків](ref.strings.md) і [функції для роботи зі змінними](ref.var.md). Викликавши [phpinfo()](function.phpinfo.md) або [get\\_loaded\\_extensions()](function.get-loaded-extensions.md), можна дізнатися, підтримка яких модулів є у використовуваному PHP. Також слід врахувати, що підтримка деяких додаткових модулів включена за замовчуванням, і що сама документація PHP розбита за модулями. Ознайомтеся з розділами [Конфігурація](configuration.md) [Установка](install.md) , а також з документацією безпосередньо до додаткових модулів для отримання більш детальної інформації про налаштування PHP.\n\nБільш детальну інформацію про те, як слід читати та інтерпретувати прототипи функцій, ви можете знайти у розділі [Як читати визначення функції](about.prototypes.md). Дуже важливо розуміти, що повертає функція, або як саме вона модифікує аргументи, що передаються. Наприклад, функція [str\\_replace()](function.str-replace.md) повертає модифікований рядок, у той час як функція [usort()](function.usort.md) працює з фактично переданою змінною. Кожна сторінка документації також містить інформацію, яка специфічна для цієї функції, наприклад, інформацію про параметри, що передаються, зміни в поведінці, повертаються значення у випадку як вдалого, так і невдалого виконання, доступності функції в різних версіях. Знання та застосування цих (іноді навіть непомітних) нюансів дуже важливе для написання коректного PHP-коду.\n\n> **Зауваження**: Якщо в функцію передаються не ті аргументи, які вона очікує, наприклад, масив (array) замість рядка (string), значення функції, що повертається, не визначено. Швидше за все в цьому випадку буде повернено \\*\\*`null`\\*\\*Але це просто угода, на неї не можна покладатися. Починаючи з PHP 8.0.0, у цьому випадку має бути викинутий виняток [TypeError](class.typeerror.md)\n\n> **Зауваження** :\n> \n> Скалярні типи для вбудованих функцій за замовчуванням мають значення **`null`** у примусовому режимі. Починаючи з PHP 8.1.0, передача **`null`** параметр вбудованої функції, який не оголошений як допустимий значення **`null`**, не рекомендується і в примусовому режимі видається повідомлення про старіння, щоб відповідати поведінці функцій користувача, де скалярні типи повинні бути явно позначені як допускають значення **`null`**\n> \n> НаПриклад, функция[strlen()](function.strlen.md) очікує, що параметр `$string` буде рядком (string), що не допускає значення **`null`**. З історичних причин PHP дозволяє передавати **`null`** для цього параметра в примусовому режимі та параметр неявно наводиться до рядка (string), внаслідок чого виходить значення `\"\"`. У строгому режимі викидається виняток [TypeError](class.typeerror.md)\n> \n> ```php\n> <?php\n> var_dump(strlen(null));\n> // \"Deprecated: Passing null to parameter #1 ($string) of type string is deprecated\" починаючи з PHP 8.1.0\n> // int(0)\n> \n> var_dump(str_contains(\"foobar\", null));\n> // \"Deprecated: Passing null to parameter #2 ($needle) of type string is deprecated\" починаючи з PHP 8.1.0\n> // bool (true)\n> ?>\n> ```\n\n### Дивіться також\n\n-   [function\\_exists()](function.function-exists.md)\n-   [довідник функцій](funcref.md)\n-   [get\\_extension\\_funcs()](function.get-extension-funcs.md)\n-   [dl()](function.dl.md)\n","title":"Вбудовані функції","contentType":2,"navigation":[{"functions.variable-functions.md":"«Звернення до функцій через змінні"},{"functions.anonymous.md":"Анонімні функції »"},{"index.md":"PHP Manual"},{"language.functions.md":"Функції"}]}},"__N_SSG":true}