{"pageProps":{"page":{"slug":"function.lcg-value.md","content":"# lcg\\_value\n\n(PHP 4, PHP 5, PHP 7, PHP 8)\n\nlcg\\_value - Генерує псевдовипадкове число, застосовуючи комбінований лінійний конгруентний метод\n\n### Опис\n\n```methodsynopsis\nlcg_value(): float\n```\n\nФункция**lcg\\_value()** повертає псевдовипадкове значення в діапазоні (0, 1). Функція комбінує два конгруентні генератори з періодами 2^31 - 85 і 2^31 - 249. Період цієї функції дорівнює добутку обох простих чисел.\n\n**Застереження**\n\nФункція не створює криптографічно захищені значення та *не повинна* використовуватися для криптографічних цілей або цілей, що вимагають, щоб значення, що повертаються, були недоступні для розгадування.\n\nЯкщо потрібна криптографічно безпечна випадкова послідовність, можна використати клас [Random\\\\Randomizer](class.random-randomizer.md) з двигуном [Random\\\\Engine\\\\Secure](class.random-engine-secure.md). Для простих сценаріїв є функції [random\\_int()](function.random-int.md) і [random\\_bytes()](function.random-bytes.md) із зручним API криптографічно безпечного генератора псевдовипадкових чисел (CSPRNG), що підтримується операційною системою.\n\n**Застереження**\n\nМасштабування значення, що повертається для різних інтервалів шляхом множення або додавання (афінного перетворення) може змістити результуюче значення, так як числа з плаваючою точкою не однаково щільні по всьому ряду чисел. Оскільки не всі значення можна точно представити числом з точкою, що плаває, результат афінного перетворення також може повернути значення, що виходять за межі запитаного інтервалу.\n\nЩоб згенерувати випадкове число з плаваючою точкою в межах довільного інтервалу, викликають метод [Random\\\\Randomizer::getFloat()](random-randomizer.getfloat.md). Для генерації випадкового цілого числа в межах довільного інтервалу викликають метод [Random\\\\Randomizer::getInt()](random-randomizer.getint.md)\n\n### Список параметрів\n\nЦя функція не має параметрів.\n\n### Значення, що повертаються\n\nПовертає псевдовипадкове число з точкою, що плаває, в діапазоні від 0.0 до 1.0 включно.\n\n### Дивіться також\n\n-   [Random\\\\Randomizer::getFloat()](random-randomizer.getfloat.md) \\- Отримує рівномірно обране число з плаваючою точкою\n-   [Random\\\\Randomizer::getInt()](random-randomizer.getint.md) \\- Отримує рівномірно обране ціле число\n-   [random\\_int()](function.random-int.md) \\- Отримує криптографічно безпечне, рівномірно вибране ціле число\n","title":"lcg\\_value","contentType":2,"navigation":[{"function.getrandmax.md":"« getrandmax"},{"function.mt-getrandmax.md":"mt\\_getrandmax »"},{"index.md":"PHP Manual"},{"ref.random.md":"Функції Random"}]}},"__N_SSG":true}