{"pageProps":{"page":{"slug":"function.easter-days.md","content":"# easter\\_days\n\n(PHP 4, PHP 5, PHP 7, PHP 8)\n\neaster\\_days — Отримати кількість днів між 21 березня та Великоднем у заданому році.\n\n### Опис\n\n```methodsynopsis\neaster_days(?int $year = null, int $mode = CAL_EASTER_DEFAULT): int\n```\n\nПовертає кількість днів між 21 березня та Великоднем у заданому році. Якщо рік не вказано, розрахунок буде здійснено для поточного року.\n\nЦю функцію можна використовувати замість [easter\\_date()](function.easter-date.md) для розрахунку дати Великодня для дат, що виходять за рамки діапазону тимчасових міток Unix (з 1970 до 2037 року).\n\nДата Великоднього дня була запроваджена Консулом Нікеї у 325 році до н.е. Це перша неділя, наступна за першою повною місяцем після весняного рівнодення. Вдень весняного рівнодення прийнято вважати 21 березня, тож розрахунок дня Великодня зводиться до визначення дати повного місяця і наступної неділі. Використовуваний алгоритм введений Діонісієм Малим в 532 році. У юліанському літочисленні (до 1753) для відстеження фаз місяця використовувався простий 19-річний цикл. У григоріанському календарі (роки після 1753 - розроблений Христофором Клавіусом і Алоїзієм Ліліусом і введений Папою Григорієм XIII у жовтні 1582 р., а у Великобританії та її колоніях у вересні 1752 р.) було додано 2 поправочних коефіцієнта збільшують точно.\n\n### Список параметрів\n\n`year`\n\nрік, позитивне число. Якщо не заданий або \\*\\*`null`\\*\\*використовується поточний рік відповідно до локального часу сервера.\n\n`mode`\n\nДозволяє розрахувати Пасхальні дати, ґрунтуючись на григоріанському календарі для 1582 – 1752 років, якщо встановити \\*\\*`CAL_EASTER_ROMAN`\\*\\*Смотрите[список констант календаря](calendar.constants.md), щоб дізнатися про всі допустимі константи.\n\n### Значення, що повертаються\n\nКількість днів між 21 березня та Великодньою неділею у заданому році `year`\n\n### список змін\n\n| Версия | Опис |\n| --- | --- |\n| 8.0.0 | `year` тепер допускає значення null. |\n\n### Приклади\n\n**Приклад #1 Приклад використання** easter\\_days()\\*\\*\\*\\*\n\n```php\n<?php\n\necho easter_days(1999);        // 14, т.e. April 4\necho easter_days(1492);        // 32, т.e. April 22\necho easter_days(1913);        //  2, т.e. March 23\n\n?>\n```\n\n### Дивіться також\n\n-   [easter\\_date()](function.easter-date.md) \\- Отримати мітку часу Unix, що відповідає півночі на Великдень у заданому році\n","title":"easter\\_days","contentType":2,"navigation":[{"function.easter-date.md":"« easter\\_date"},{"function.frenchtojd.md":"frenchtojd »"},{"index.md":"PHP Manual"},{"ref.calendar.md":"Календар"}]}},"__N_SSG":true}