{"pageProps":{"page":{"slug":"function.db2-num-rows.md","content":"# db2\\_num\\_rows\n\n(PECL ibm\\_db2 >= 1.0.0)\n\ndb2\\_num\\_rows — Повертає кількість рядків, порушених SQL-запитом\n\n### Опис\n\n```methodsynopsis\ndb2_num_rows(resource $stmt): int|false\n```\n\nПовертає кількість рядків, видалених, доданих або оновлених SQL-запитом.\n\nЩоб визначити кількість рядків, які буде повернуто оператором SELECT, введіть SELECT COUNT(\\*) з тими ж параметрами, що і передбачуваний оператор SELECT та отримайте значення.\n\nЯкщо логіка вашої програми перевіряє кількість рядків, що повертаються оператором SELECT та гілок, якщо кількість рядків дорівнює 0, розгляньте можливість зміни вашої програми, щоб спробувати повернути перший рядок однієї з функцій [db2\\_fetch\\_assoc()](function.db2-fetch-assoc.md) [db2\\_fetch\\_both()](function.db2-fetch-both.md) [db2\\_fetch\\_array()](function.db2-fetch-array.md) або [db2\\_fetch\\_row()](function.db2-fetch-row.md) і переходьте, якщо функція вибірки повертає **`false`**\n\n> **Зауваження** :\n> \n> Якщо ви виконуєте оператор SELECT за допомогою курсора, що прокручується, **db2\\_num\\_rows()** повертає кількість рядків, що повертаються оператором SELECT. Однак накладні витрати, пов'язані з курсорами, що прокручуються, значно погіршують продуктивність вашої програми, тому, якщо це єдина причина, з якої ви розглядаєте можливість використання курсорів, що прокручуються, вам слід використовувати курсор \"forward-only\" і або викликати SELECT COUNT(\\*), або покладатися на логічне значення (bool), яке повертає значення функцій вибірки задля досягнення еквівалентної функціональності з набагато більшою продуктивністю.\n\n### Список параметрів\n\n`stmt`\n\nДопустимий ресурс `stmt`містить набір результатів.\n\n### Значення, що повертаються\n\nПовертає кількість рядків, які торкнулися останнім SQL-оператором, виданим зазначеним дескриптором оператора або \\*\\*`false`\\*\\*в случае возникновения ошибки.\n","title":"db2\\_num\\_rows","contentType":2,"navigation":[{"function.db2-num-fields.md":"« db2\\_num\\_fields"},{"function.db2-pclose.md":"db2\\_pclose »"},{"index.md":"PHP Manual"},{"ref.ibm-db2.md":"Функції IBM DB2"}]}},"__N_SSG":true}