{"pageProps":{"page":{"slug":"function.db2-tables.md","content":"# db2\\_tables\n\n(PECL ibm\\_db2 >= 1.0.0)\n\ndb2\\_tables — Повертає набір результатів, у якому перелічені таблиці та пов'язані метадані в базі даних\n\n### Опис\n\n```methodsynopsis\ndb2_tables(    resource $connection,    ?string $qualifier = null,    ?string $schema = null,    ?string $table_name = null,    ?string $table_type = null): resource\n```\n\nПовертає набір результатів, у якому перелічені таблиці та пов'язані метадані у базі даних.\n\n### Список параметрів\n\n`connection`\n\nДопустиме з'єднання з базою даних IBM DB2, Cloudscape або Apache Derby.\n\n`qualifier`\n\nКваліфікатор баз даних DB2, що працюють на серверах OS/390 або z/OS. Для інших баз даних передайте **`null`** або порожній рядок.\n\n`schema`\n\nСхема містить таблиці. Параметр приймає шаблон пошуку, що містить `_`и`%` як підстановочні знаки.\n\n`table_name`\n\nНазва таблиці. Параметр приймає шаблон пошуку, що містить `_`и`%` як підстановочні знаки.\n\n`table_type`\n\nСписок ідентифікаторів типів таблиць, розділених комами. Щоб відповідати всім типам таблиць, передайте **`null`** або порожній рядок. До допустимих ідентифікаторів типу таблиці відносяться: ALIAS, HIERARCHY TABLE, INOPERATIVE VIEW, NICKNAME, MATERIALIZED QUERY TABLE, SYSTEM TABLE, TABLE, TYPED TABLE, TYPED VIEW, та VIEW.\n\n### Значення, що повертаються\n\nПовертає ресурс виразу з набором результатів, що містить рядки, що описують таблиці, які відповідають зазначеним параметрам. Рядки складаються з наступних стовпців:\n\n| Название столбца | Опис |\n| --- | --- |\n| TABLE\\_CAT | Каталог, що містить таблицю або \\*\\*`null`\\*\\*якщо в цій таблиці немає каталогів. |\n| TABLE\\_SCHEM | Ім'я схеми, що містить таблицю. |\n| TABLE\\_NAME | Назва таблиці. |\n| TABLE\\_TYPE | Ідентифікатор типу таблиці. |\n| REMARKS | Опис таблиці. |\n\n### Дивіться також\n\n-   [db2\\_column\\_privileges()](function.db2-column-privileges.md) \\- Повертає результуючий набір, що перераховує стовпці та пов'язані з ним привілеї для таблиці\n-   [db2\\_columns()](function.db2-columns.md) \\- Повертає результуючий набір, що перераховує стовпці та пов'язані з ними метадані для таблиці\n-   [db2\\_foreign\\_keys()](function.db2-foreign-keys.md) \\- Повертає набір результатів, у якому перелічені зовнішні ключі таблиці\n-   [db2\\_primary\\_keys()](function.db2-primary-keys.md) \\- Повертає набір результатів, що містить первинні ключі таблиці\n-   [db2\\_procedure\\_columns()](function.db2-procedure-columns.md) \\- Повертає набір результатів зі списком параметрів процедури, що зберігається.\n-   [db2\\_procedures()](function.db2-procedures.md) \\- Повертає набір результатів, в якому перераховані процедури, що зберігаються, зареєстровані в базі даних\n-   [db2\\_special\\_columns()](function.db2-special-columns.md) \\- Повертає набір результатів, у якому перераховані стовпці з унікальним ідентифікатором рядка таблиці\n-   [db2\\_statistics()](function.db2-statistics.md) \\- Повертає набір результатів, що містить індекс та статистику таблиці\n-   [db2\\_table\\_privileges()](function.db2-table-privileges.md) \\- Повертає набір результатів, у якому перелічені таблиці та пов'язані з ними права доступу до бази даних\n","title":"db2\\_tables","contentType":2,"navigation":[{"function.db2-table-privileges.md":"« db2\\_table\\_privileges"},{"set.mongodb.md":"MongoDB »"},{"index.md":"PHP Manual"},{"ref.ibm-db2.md":"Функції IBM DB2"}]}},"__N_SSG":true}