{"pageProps":{"page":{"slug":"function.ps-show-boxed.md","content":"# ps\\_show\\_boxed\n\n(PECL ps >= 1.1.0)\n\nps\\_show\\_boxed — Виводить текст у поле\n\n### Опис\n\n```methodsynopsis\nps_show_boxed(    resource $psdoc,    string $text,    float $left,    float $bottom,    float $width,    float $height,    string $hmode,    string $feature = ?): int\n```\n\nВиводить текст у заданому полі. Нижній лівий кут поля знаходиться в (`left` `bottom`). За потреби будуть вставлені розриви рядків. Декілька прогалин розглядаються як один. Табулятори розглядаються як прогалини.\n\nТекст будет переноситься через дефис, если для параметра`hyphenation`установлено значение\\*\\*`true`\\*\\*, а параметр`hyphendict` містить допустиме ім'я файлу для розміщення переносів. Міжрядковий інтервал береться зі значення `leading`. Абзаци можна розділяти порожнім рядком, як у TeX. Якщо для параметра `parindent` встановлено значення > 0.0, то перші n рядків будуть із відступом. Кількість рядків n задається параметром `numindentlines`. Щоб запобігти відступу перших m абзаців, встановіть позитивне число значенням параметра `parindentkip`\n\n### Список параметрів\n\n`psdoc`\n\nІдентифікатор ресурсу файлу postscript, повернутий функцією [ps\\_new()](function.ps-new.md)\n\n`text`\n\nТекст, який потрібно вивести у поле.\n\n`left`\n\nКоордината X лівого нижнього кута поля.\n\n`bottom`\n\nКоордината Y лівого нижнього кута поля.\n\n`width`\n\nШирина поля.\n\n`height`\n\nВисота поля.\n\n`hmode`\n\nПараметр`hmode` може бути `fulljustify` `right` `left`или`center`Разница между`justify`и`fulljustify`влияет только на последнюю строку поля. В режиме`fulljustify` останній рядок буде вирівняний по лівому та правому краю, якщо це не останній рядок абзацу. В режимі `justify` вона завжди буде вирівняна по лівому краю.\n\n`feature`\n\n#### Використовувані параметри\n\nВисновок **ps\\_show\\_boxed()** може бути налаштований з кількома параметрами та значеннями, які повинні бути встановлені за допомогою [ps\\_set\\_parameter()](function.ps-set-parameter.md) або [ps\\_set\\_value()](function.ps-set-value.md). Крім параметрів та значень, що впливають на виведення тексту, оцінюються такі параметри та значення:\n\nleading (значення)\n\nВідстань між базовими лініями двох послідовних ліній.\n\nlinebreak (параметр)\n\nУстановите значение\\*\\*`true`\\*\\*якщо хочете, щоб повернення каретки починало новий рядок, а не розглядало його як пробіл. За замовчуванням **`false`**\n\nparbreak (параметр)\n\nУстановите значение\\*\\*`true`\\*\\*якщо хочете, щоб повернення каретки в окремому рядку починав новий абзац, а не розглядав його як пробіл. За замовчуванням **`true`**\n\nhyphenation (параметр)\n\nУстановите значение\\*\\*`true`**, щоб увімкнути розміщення переносів. Для цього потрібно, щоб словник було встановлено з параметром `hyphendict`По умолчанию**`false`\\*\\*\n\nhyphendict (параметр)\n\nІм'я файлу словника, який використовується для розміщення переносів (див. нижче).\n\nhyphenminchar (значення)\n\nКількість символів, що має бути принаймні залишено до або після дефісу. Це означає, що через дефіс буде перенесено лише слова, які щонайменше вдвічі перевищують це значення. Значення за замовчуванням – три. Налаштування нульового значення встановить значення за промовчанням.\n\nparindent (значення)\n\nВстановіть кількість місця у пікселях для відступу перших m рядків абзацу. m можна встановити за допомогою значення `numindentlines`\n\nparskip (значення)\n\nУстановите количество дополнительного пространства в пикселях между абзацами. По умолчанию що призведе до нормальної відстані між лініями.\n\nnumindentlines (значення)\n\nКількість рядків від початку абзацу, які будуть із відступом. За замовчуванням\n\nparindentskip (значення)\n\nКількість абзаців у полі, перші рядки яких будуть без відступу. За замовчуванням . Це корисно для абзаців відразу після заголовка розділу або тексту, що триває у другому полі. В обох випадках можна встановити значення\n\nlinenumbermode (параметр)\n\nВкажіть спосіб нумерації рядків. Можливі значення: `box` для нумерації рядків у всьому блоці або `paragraph` для нумерації рядків у кожному абзаці.\n\nlinenumberspace (значення)\n\nПростір для стовпця ліворуч від нумерованого рядка, що містить номер рядка. Номер рядка в цьому стовпці буде вирівняний праворуч. За замовчуванням `20`\n\nlinenumbersep (значення)\n\nПростір між стовпцем з номерами рядків і рядком. За замовчуванням `5`\n\n#### Перенесення\n\nТекст переноситься, якщо у параметрі `hyphenation` встановлено значення true та заданий допустимий словник для розміщення переносів. pslib не надає власний словник для розміщення переносів, але використовує словник з openoffice, scribus або koffice. Ви можете знайти їхні словники для різних мов в одній з наступних каталогів, якщо встановлено відповідне програмне забезпечення:\n\n-   /usr/share/apps/koffice/hyphdicts/\n-   /usr/lib/scribus/dicts/\n-   /usr/lib/openoffice/share/dict/ooo/\n\nВ даний час у scribus найбільш повні словники розміщення переносів.\n\n### Значення, що повертаються\n\nКількість символів, які не вдалося записати.\n\n### Дивіться також\n\n-   [ps\\_continue\\_text()](function.ps-continue-text.md) \\- Продовжує текст у наступному рядку\n","title":"ps\\_show\\_boxed","contentType":2,"navigation":[{"function.ps-shfill.md":"« ps\\_shfill"},{"function.ps-show-xy2.md":"ps\\_show\\_xy2 »"},{"index.md":"PHP Manual"},{"ref.ps.md":"Функції PS"}]}},"__N_SSG":true}