{"pageProps":{"page":{"slug":"function.virtual.md","content":"# virtual\n\n(PHP 4, PHP 5, PHP 7, PHP 8)\n\nvirtual — Виконує запит Apache\n\n### Опис\n\n```methodsynopsis\nvirtual(string $uri): bool\n```\n\nФункция**virtual()** специфічна для сервера Apache та є еквівалентом конструкції `<!--#include virtual...-->`, що використовується в `mod_include`. Ця функція виконує запит Apache. Це буває корисним у тих випадках, коли необхідно включити до свого скрипту результат виконання інших CGI-скриптів або файлів .shtml, а також додавання всього, що має бути оброблено Apache. Зверніть увагу, що CGI-скрипти повинні давати коректні CGI-заголовки. Як мінімум, CGI-скрипт повинен створювати заголовок `Content-Type`\n\nПеред тим, як здійсниться виконання підзапиту, всі буфери скидаються і видаються в браузер, при цьому надсилаються заголовки, поміщені в буфер.\n\nЦя функція підтримується лише якщо PHP встановлений як модуль Apache у веб-серверах.\n\n### Список параметрів\n\n`uri`\n\nІм'я файлу, для якого буде виконано підзапит.\n\n### Значення, що повертаються\n\nРезультат виконання підзапиту у разі успішного виконання або \\*\\*`false`\\*\\*в случае возникновения ошибки.\n\n### Приклади\n\nПриклад использования смотрите в функции[apache\\_note()](function.apache-note.md)\n\n### Примітки\n\n**Увага**\n\nРядок запиту може бути переданий файлу, що викликається, однак значення змінної [$\\_GET](reserved.variables.get.md) буде скопійовано з батьківського скрипту, лише [$\\_SERVER\\['QUERY\\_STRING'\\]](reserved.variables.server.md) міститиме переданий рядок запиту. Рядок запиту може бути переданий лише при використанні Apache 2. Запрошений файл не відображатиметься в журналі доступу (access log) Apache.\n\n> **Зауваження** :\n> \n> Змінні оточення, встановлені в запрошеному файлі, не видно з скрипта, що викликав його.\n\n> **Зауваження** :\n> \n> Ця функція може бути використана в PHP-скрипті, але зазвичай більш правильним буде вибрати [include](function.include.md) або [require](function.require.md)\n\n### Дивіться також\n\n-   [apache\\_note()](function.apache-note.md) \\- Повертає та встановлює повідомлення до запиту Apache\n","title":"virtual","contentType":2,"navigation":[{"function.getallheaders.md":"« getallheaders"},{"book.fpm.md":"Менеджер процесів FastCGI »"},{"index.md":"PHP Manual"},{"ref.apache.md":"Функції Apache"}]}},"__N_SSG":true}