{"pageProps":{"page":{"slug":"function.return.md","content":"## return\n\n(PHP 4, PHP 5, PHP 7, PHP 8)\n\n`return` повертає керування програмою модулю, з якого була викликана функція. Виконання програми продовжується з інструкції, яка настає за місцем дзвінка.\n\nЯкщо викликається з функції, вираз `return` негайно припиняє виконання поточної функції та повертає свій аргумент як значення цієї функції . `return` також завершить виконання виразу [eval()](function.eval.md) або всього скриптового файлу.\n\nЯкщо це викликається з глобальної області видимості, виконання поточного файлу скрипта припиняється. Якщо поточний файл скрипта було підключено за допомогою функцій [include](function.include.md) або [require](function.require.md)тоді управління повертається до файлу, який викликав поточний. Більше того, якщо поточний файл скрипта був підключений за допомогою [include](function.include.md), тогда значение переданное`return` буде повернено як значення виклику [include](function.include.md). Якщо `return` викликається з головного файлу скрипта, тоді виконання скрипту припиняється. Якщо поточний файл скрипта був викликаний опціями конфігурації [auto\\_prepend\\_file](ini.core.md#ini.auto-prepend-file) або [auto\\_append\\_file](ini.core.md#ini.auto-append-file) з файлу налаштувань php.ini, тоді виконання цього скрипта припиняється.\n\nДля більш детальної інформації дивіться розділ [Значення, що повертаються](functions.returning-values.md)\n\n> **Зауваження**: Зауважте, що `return` є мовною конструкцією, а не функцією і круглі дужки, що оточують аргументи, не є необхідністю. Більше того, вони тут не вітаються.\n\n> **Зауваження**: Якщо параметри не вказані, круглі дужки повинні бути опущені і буде повернено **`null`**. Виклик `return` із дужками, але без аргументів викличе синтаксичну помилку.\n\nПочинаючи з PHP 7.1.0, оператори повернення без аргументу у функціях, що оголошують тип повернення, викликають \\*\\*`E_COMPILE_ERROR`\\*\\*якщо тільки тип повернення не void, в цьому випадку таку ж помилку викликають оператори повернення з аргументом.\n","title":"return","contentType":2,"navigation":[{"control-structures.declare.md":"« declare"},{"function.require.md":"require »"},{"index.md":"PHP Manual"},{"language.control-structures.md":"Керуючі конструкції"}]}},"__N_SSG":true}