{"pageProps":{"page":{"slug":"function.db2-procedures.md","content":"# db2\\_procedures\n\n(PECL ibm\\_db2 >= 1.0.0)\n\ndb2\\_procedures — Повертає набір результатів, в якому перераховані процедури, що зберігаються, зареєстровані в базі даних\n\n### Опис\n\n```methodsynopsis\ndb2_procedures(    resource $connection,    ?string $qualifier,    string $schema,    string $procedure): resource\n```\n\nПовертає набір результатів, в якому перераховані процедури, що зберігаються, зареєстровані в базі даних.\n\n### Список параметрів\n\n`connection`\n\nДопустиме з'єднання з базою даних IBM DB2, Cloudscape або Apache Derby.\n\n`qualifier`\n\nКваліфікатор баз даних DB2, що працюють на серверах OS/390 або z/OS. Для інших баз даних передайте **`null`** або порожній рядок.\n\n`schema`\n\nСхема містить процедури. Параметр приймає шаблон пошуку, що містить `_`и`%` як підстановочні знаки.\n\n`procedure`\n\nНазва процедури. Параметр приймає шаблон пошуку, що містить `_`и`%` як підстановочні знаки.\n\n### Значення, що повертаються\n\nПовертає ресурс оператора з набором результатів, що містить рядки, що описують процедури, що зберігаються, відповідні зазначеним параметрам. Рядки складаються з наступних стовпців:\n\n| Название столбца | Опис |\n| --- | --- |\n| PROCEDURE\\_CAT | Каталог містить таблицю. Значення \\*\\*`null`\\*\\*якщо в цій таблиці немає каталогів. |\n| PROCEDURE\\_SCHEM | Ім'я схеми, що містить процедуру, що зберігається. |\n| PROCEDURE\\_NAME | Назва процедури. |\n| NUM\\_INPUT\\_PARAMS | Кількість вхідних (IN) параметрів для процедури, що зберігається. |\n| NUM\\_OUTPUT\\_PARAMS | Кількість параметрів виведення (OUT) для процедури, що зберігається. |\n| NUM\\_RESULT\\_SETS | Кількість наборів результатів, що повертаються процедурою, що зберігається. |\n| REMARKS | Будь-які коментарі про процедуру, що зберігається. |\n| PROCEDURE\\_TYPE | Завжди повертає , вказуючи, що процедура, що зберігається, не повертає значення, що повертається. |\n\n### Дивіться також\n\n-   [db2\\_column\\_privileges()](function.db2-column-privileges.md) \\- Повертає результуючий набір, що перераховує стовпці та пов'язані з ним привілеї для таблиці\n-   [db2\\_columns()](function.db2-columns.md) \\- Повертає результуючий набір, що перераховує стовпці та пов'язані з ними метадані для таблиці\n-   [db2\\_foreign\\_keys()](function.db2-foreign-keys.md) \\- Повертає набір результатів, у якому перелічені зовнішні ключі таблиці\n-   [db2\\_primary\\_keys()](function.db2-primary-keys.md) \\- Повертає набір результатів, що містить первинні ключі таблиці\n-   [db2\\_procedure\\_columns()](function.db2-procedure-columns.md) \\- Повертає набір результатів зі списком параметрів процедури, що зберігається.\n-   [db2\\_special\\_columns()](function.db2-special-columns.md) \\- Повертає набір результатів, у якому перераховані стовпці з унікальним ідентифікатором рядка таблиці\n-   [db2\\_statistics()](function.db2-statistics.md) \\- Повертає набір результатів, що містить індекс та статистику таблиці\n-   [db2\\_table\\_privileges()](function.db2-table-privileges.md) \\- Повертає набір результатів, у якому перелічені таблиці та пов'язані з ними права доступу до бази даних\n-   [db2\\_tables()](function.db2-tables.md) \\- Повертає набір результатів, у якому перелічені таблиці та пов'язані метадані в базі даних\n","title":"db2\\_procedures","contentType":2,"navigation":[{"function.db2-procedure-columns.md":"« db2\\_procedure\\_columns"},{"function.db2-result.md":"db2\\_result »"},{"index.md":"PHP Manual"},{"ref.ibm-db2.md":"Функції IBM DB2"}]}},"__N_SSG":true}