{"pageProps":{"page":{"slug":"function.db2-fetch-object.md","content":"# db2\\_fetch\\_object\n\n(PECL ibm\\_db2 >= 1.0.0)\n\ndb2\\_fetch\\_object — Повертає об'єкт із властивостями, що становлять стовпці у вибраному рядку.\n\n### Опис\n\n```methodsynopsis\ndb2_fetch_object(resource $stmt, int $row_number = -1): stdClass|false\n```\n\nПовертає об'єкт, у якому кожну властивість представляє стовпець, повернутий у рядку, отриманому з набору результатів.\n\n### Список параметрів\n\n`stmt`\n\nДопустимий ресурс `stmt`містить набір результатів.\n\n`row_number`\n\nЗапитує конкретний рядок за індексом (починається з 1) із набору результатів. Передача параметра призводить до запобігання PHP, якщо в наборі результатів використовується курсор \"forward-only\".\n\n### Значення, що повертаються\n\nПовертає об'єкт, який представляє один рядок у наборі результатів. Властивості об'єкта порівнюються з іменами стовпців у наборі результатів.\n\nСервери баз даних IBM DB2, Cloudscape та Apache Derby зазвичай переводять імена стовпців у верхній регістр, тому властивості об'єкта відображатимуть цей регістр.\n\nЯкщо запит SELECT викликає скалярну функцію зміни значення стовпця, сервери баз даних повертають номер стовпця як ім'я стовпця в наборі результатів. Якщо потрібно більш осмислене ім'я стовпця та властивість об'єкта, ви можете використовувати конструкцію AS, щоб присвоїти ім'я стовпцю в наборі результатів.\n\nПовертає **`false`**, якщо жодного рядка не було отримано.\n\n### Приклади\n\n**Приклад #1 Приклад використання** db2\\_fetch\\_object()\\*\\*\\*\\*\n\nУ наступному прикладі виконується запит SELECT із скалярною функцією RTRIM, яка видаляє прогалини в кінці стовпця. Замість створення об'єкта з властивостями \"BREED\" і \"2\", ми використовуємо конструкцію AS у запиті SELECT для присвоєння імені \"name\" зміненому стовпцю. Сервер бази даних переводить імена стовпців у верхній регістр, у результаті виходить об'єкт із властивостями \" BREED \" і \" NAME \" .\n\n```php\n<?php\n$conn = db2_connect($database, $user, $password);\n\n$sql = \"SELECT breed, RTRIM(name) AS name\n    FROM animals\n    WHERE id = ?\";\n\nif ($conn) {\n    $stmt = db2_prepare($conn, $sql);\n    db2_execute($stmt, array(0));\n\n    while ($pet = db2_fetch_object($stmt)) {\n        echo \"Иди сюда, {$pet->NAME}, мой маленький {$pet->BREED}!\";\n    }\n    db2_close($conn);\n}\n?>\n```\n\nРезультат виконання наведеного прикладу:\n\n```\nИди сюда, Пушок, мой маленький котёнок!\n```\n\n### Дивіться також\n\n-   [db2\\_fetch\\_array()](function.db2-fetch-array.md) \\- Повертає масив, індексований за положенням стовпця, що представляє рядок у наборі результатів\n-   [db2\\_fetch\\_assoc()](function.db2-fetch-assoc.md) \\- Повертає масив, індексований на ім'я стовпця, що представляє рядок у наборі результатів\n-   [db2\\_fetch\\_both()](function.db2-fetch-both.md) \\- Повертає масив, індексований як на ім'я стовпця, так і за позицією, що представляє рядок у наборі результатів\n-   [db2\\_fetch\\_row()](function.db2-fetch-row.md) \\- Встановлює вказівник набору результатів на наступний рядок або запрошений рядок\n-   [db2\\_result()](function.db2-result.md) \\- Повертає один стовпець з рядка у наборі результатів\n","title":"db2\\_fetch\\_object","contentType":2,"navigation":[{"function.db2-fetch-both.md":"« db2\\_fetch\\_both"},{"function.db2-fetch-row.md":"db2\\_fetch\\_row »"},{"index.md":"PHP Manual"},{"ref.ibm-db2.md":"Функції IBM DB2"}]}},"__N_SSG":true}