{"pageProps":{"page":{"slug":"gmagick.quantizeimages.md","content":"# Gmagick::quantizeimages\n\n(PECL gmagick >= Unknown)\n\nGmagick::quantizeimages — Аналізує кольори у послідовності зображень\n\n### Опис\n\n```methodsynopsis\npublic Gmagick::quantizeimages(    int $numColors,    int $colorspace,    int $treeDepth,    bool $dither,    bool $measureError): Gmagick\n```\n\nАналізує кольори у послідовності зображень та вибирає фіксовану кількість кольорів для представлення зображення. Метою алгоритму є мінімізація різниці у кольорі між вхідним та вихідним зображенням при мінімізації часу обробки.\n\n### Список параметрів\n\n`numColors`\n\nКількість кольорів.\n\n`colorspace`\n\nКолірний простір, в якому зменшиться колір, зазвичай RGB.\n\n`treeDepth`\n\nЗазвичай це значення дорівнює нулю чи одиниці. Нуль або одиниця вказує Quantize вибрати оптимальну глибину дерева Log4(number\\_colors). Дерево цієї глибини зазвичай забезпечує найкраще уявлення еталонного зображення з найменшим обсягом пам'яті та максимальною швидкістю обчислень. У деяких випадках, наприклад для зображення з низькою колірною дисперсією (кілька кольорів), потрібне значення, відмінне від Log4(number\\_colors). Щоб повністю розгорнути дерево кольорів, використовуйте 8.\n\n`dither`\n\nЗначення, відмінне від нуля, розподіляє різницю між вихідним зображенням та відповідним алгоритмом зменшення кольору на сусідні пікселі вздовж кривої Гільберта.\n\n`measureError`\n\nЗначення, відмінне від нуля, вимірює різницю між вихідним та квантованим зображеннями. Ця різниця становить повну помилку квантування. Помилка обчислюється шляхом підсумовування всіх пікселів зображення квадрата відстані в просторі RGB між значенням кожного еталонного пікселя і його квантованим значенням.\n\n### Значення, що повертаються\n\nОб'єкт [Gmagick](class.gmagick.md) у разі успішного виконання.\n\n### Помилки\n\nВикликає **GmagickException**в случае возникновения ошибки.\n","title":"Gmagick::quantizeimages","contentType":2,"navigation":[{"gmagick.quantizeimage.md":"« Gmagick::quantizeimage"},{"gmagick.queryfontmetrics.md":"Gmagick::queryfontmetrics »"},{"index.md":"PHP Manual"},{"class.gmagick.md":"Gmagick"}]}},"__N_SSG":true}