{"pageProps":{"page":{"slug":"history.php.related.md","content":"## Історія суміжних з PHP проектів\n\n### PEAR\n\n[» PEAR](https://pear.php.net/) `PHP Extension and Application Repository` - Репозиторій Додатків та Модулів PHP. Спочатку, PHP Extension and Add-on Repository - Репозиторій Доповнень і Модуль PHP) - це PHP-версія базових класів. У майбутньому можливе його зростання та становлення ключовим способом публікації модулів PHP серед розробників.\n\nPEAR зародився в ході дискусій на зустрічі розробників PHP (PHP Developers' Meeting - PDM), що проходила в січні 2000 року в Тель-Авіві. Автором PEAR є Стіг С. Баккен (Stig S. Bakken), який присвятив розробку своєї першої дочки Мелін Баккен (Malin Bakken).\n\nЗ початку 2000 року PEAR виріс до величезного проекту з великою кількістю розробників, які працюють над реалізацією загального та повторно використовуваного функціоналу на благо для всієї спільноти PHP. В даний час PEAR включає широкий спектр класів для роботи з базами даних, кешування контенту, математичних обчислень, електронної комерції та багато іншого.\n\nДодаткову інформацію про PEAR можна знайти в [» документації](https://pear.php.net/manual/)\n\n### Ініціатива Гарантії Якості PHP\n\nГруппа[» Ініціативи Гарантії Якості PHP](https://qa.php.net/) була заснована навесні 2000 року у відповідь на критику недостатнього бета-тестування PHP для виробничих оточень. Зараз ця група складається з людей, які чудово розуміють основу коду PHP. Ці розробники витрачають багато часу на виявлення та усунення помилок у PHP. Крім того, багато інших членів команди тестують ці виправлення та повідомляють про результати їхньої роботи на різних платформах.\n\n### PHP-GTK\n\n[» PHP-GTK](http://gtk.php.net/) є модулем PHP для написання GUI-додатків, що працюють на стороні клієнта. Андрій Зміївський (Andrei Zmievski) згадує процес планування та розробки PHP-GTK:\n\n> Я завжди цікавився GUI-програмуванням, і я знаходжу Gtk+ дуже приємним засобом розробки, за винятком того, що працювати з ним на C трохи втомлює. Після перегляду PyGtk та GTK-Perl, я вирішив спробувати написати інтерфейс PHP для роботи з Gtk+, хай із мінімальними можливостями. Починаючи з серпня 2000 року, у мене з'явилося трохи більше вільного часу, і я почав експерименти. У розробці я базувався на PyGtk, який має велику кількість можливостей і приємний об'єктно-орієнтований інтерфейс. Джеймс Хенстридж (James Henstridge), автор PyGtk, давав дуже корисні поради протягом перших етапів розробки.\n> \n> Написання вручну інтерфейсів до всіх функцій Gtk+ навіть не розглядалося. Я зупинився на ідеї генератора коду, схожого на аналогічний PyGtk генератор. Генератор читає .defs файли, що містять інформацію про класи, константи та методи Gtk+ і генерує C-код, що є інтерфейсом у PHP. Те, що не могло бути згенеровано автоматично, створюється вручну в файлах .overrides.\n> \n> Робота над генератором коду та самою інфраструктурою йшла досить довго, зважаючи на те, що я не мав достатньо вільного часу для роботи. Після того, як я показав PHP-GTK Френку Кромману (Frank Kromman), він зацікавився і почав допомагати мені з генератором коду та версією для Win32. Коли ми написали та запустили першу програму Hello World, це було дуже захоплююче. Потрібно було кілька місяців для надання PHP-GTK презентабельного вигляду і перша версія вийшла 1 березня 2001 року. Історія швидко потрапила до SlashDot.\n> \n> Відчуваючи, що PHP-GTK може рости, я створив окремі поштові конференції, CVS-репозиторій та сайт gtk.php.net за допомогою Коліна Вієброка (Colin Viebrock). Була потрібна документація і тут на допомогу прийшов Джеймс Мур (James Moore).\n> \n> З часів створення PHP-GTK отримав широку популярність. Ми маємо свою групу документування, люди починають писати модулі для PHP-GTK і все більше і більше прекрасних додатків з його допомогою.\n","title":"Історія суміжних з PHP проектів","contentType":2,"navigation":[{"history.php.md":"« Історія PHP"},{"history.php.books.md":"Книги про PHP »"},{"index.md":"PHP Manual"},{"history.md":"Історія PHP та суміжних проектів"}]}},"__N_SSG":true}