{"pageProps":{"page":{"slug":"history.php.md","content":"## Історія PHP\n\n### PHP Tools, FI, Construction Kit та PHP/FI\n\nPHP насправді наступник продукту під назвою PHP/FI. Створене в 1994 році Расмусом Лердорфом, перше втілення PHP було простим набором CGI-скриптів, написаних мовою програмування Сі. Спочатку використовуючи їх для відстеження відвідувань свого веб-резюме, він назвав цей набір скриптів \"Personal Homepages Tools\" (\"Інструменти для персональних домашніх сторінок\"), але частіше згадувалося назва \"PHP Tools\". Згодом потрібно все більше поліпшень функціональності, і Расмус переписав PHP Tools, створивши більшу і багатшу реалізацію. Ця нова реалізація була здатна взаємодіяти з базами даних та багато іншого, що створювало фреймворк, за допомогою якого користувачі могли створювати прості динамічні веб-програми, такі як гостьові книги. У червні 1995 року Расмус [» відкрив](http://groups.google.com/group/comp.infosystems.www.authoring.cgi/msg/cc7d43454d64d133) вихідний код PHP Tools громадськості, що дозволило розробникам використовувати його на власний розсуд. Це також дало можливість користувачам виправляти помилки в коді та покращувати його.\n\nУ вересні того ж року Расмус розширив PHP і на короткий час прибрав з назви PHP. Тепер у вигляді інструменту FI (скорочення від \"Інтерпретатор Форм\"), нова реалізація включала деякі основні функціональні можливості того PHP, який ми знаємо сьогодні. Вона мала Perl-подібні змінні, автоматичну інтерпретацію форм і синтаксис, що вбудовується в HTML. Синтаксис мови був схожий на Perl, хоч і був набагато більш обмеженим, простим, і певною мірою суперечливим. Щоб вставляти код у HTML-файл, розробникам довелося використовувати HTML коментарі. Хоча цей метод був не зовсім добре прийнятий, FI, як і раніше, набирав популярність як CGI-інструмент, але все-таки не як мова. Проте зміни почалися наступного місяця, коли в жовтні 1995 року Расмус випустив повністю переписаний код. З ім'ям PHP, що вже повернулося, але вже скороченим від \"Personal Home Page Construction Kit\", це був перший реліз, який міг похвалитися розширеним інтерфейсом сценаріїв. Мова навмисно нагадувала Сі за структурою, що робила його легкою для сприйняття розробниками, знайомими з Сі, Perl та подібними мовами. Будучи все ще обмеженими UNIX і POSIX-сумісними системами, було вивчено питання реалізації мови в Windows NT.\n\nКод отримав ще одне суттєве перетворення у квітні 1996 року. Поєднавши назви попередніх версій, Расмус представив PHP/FI. Реалізації другого покоління почали по-справжньому розвивати PHP з набору інструментів самостійну мову програмування. PHP включав вбудовану підтримку для DBM, mSQL і Postgres95 баз даних, cookies, підтримку функцій, що визначаються користувачем, і багато іншого. У червні PHP/FI було присвоєно версію 2.0. Цікаво, однак, що існувала лише одна версія PHP 2.0. Коли вона, нарешті, у листопаді 1997 року подолала статус бета-версії, парсера мови було вже повністю переписано.\n\nНезважаючи на коротку історію розробки, PHP/FI продовжував набирати популярності в молодому світі веб-розробки. У 1997 та 1998, PHP/FI став культом для декількох тисяч користувачів по всьому світу. Дослідження Netcraft у травні 1998 року показали, що майже 60 тисяч доменів передавали заголовки, що містять PHP. Це число дорівнювало приблизно 1% від усіх доменів в Інтернеті в той час. Незважаючи на ці вражаючі цифри, розвиток PHP/FI був обмежений: незважаючи на кількох другорядних учасників, загалом він, як і раніше, розроблявся однією людиною.\n\n**Приклад #1 Приклад коду PHP/FI**\n\nАгов, у вас Нетскейп!\n\nИзвините, такой записи нет\n\nЛаскаво просимо, !\n\nНа вашем счету осталось \"кредитів\".\n\n### PHP 3\n\nPHP 3.0 був першою версією, що нагадує PHP, яким ми знаємо його сьогодні. Порахувавши PHP/FI 2.0 все ще неефективним і недостатньо функціональним для використання в комерційних додатках, що розробляються для їхнього університетського проекту, Енді Гутманс і Зів Сураскі з Тель-Авіва почали знову переписувати парсер в 1997 році. Зв'язавшись з Расмусом, вони обговорили різні аспекти поточної реалізації та нової розробки PHP. Для покращення движка та використання вже існуючої бази користувачів PHP/FI, Енді, Расмус та Зів вирішили співпрацювати у розвитку нової, незалежної мови програмування. Ця зовсім нова мова була випущена під новим ім'ям, без згадки про персональне використання, як у PHP/FI 2.0. Він був названий просто \"PHP\" - абревіатура, що означає рекурсивний акронім - PHP: Hypertext Preprocessor.\n\nОднією з найсильніших сторін PHP 3.0 була можливість розширення ядра. Окрім забезпечення користувачів надійною інфраструктурою з безлічі різних баз даних, протоколів та API, розширюваність PHP 3.0 привернула до нього безліч сторонніх розробників, які бажають додати до мови свої модулі. Можливо, це і був головний ключ до успіху, але варто додати, що важливим кроком виявилася підтримка ОВП синтаксису і набагато сильнішого та послідовнішого синтаксису самої мови.\n\nУ червні 1998 року, з безліччю нових розробників з усього світу, що приєдналися до проекту, PHP 3.0 був представлений новою командою розробників як офіційний наступник PHP/FI. Активний розвиток PHP/FI 2.0, який фактично припинився в листопаді минулого року, тепер офіційно закінчився. Приблизно через дев'ять місяців відкритого публічного тестування, при оголошенні офіційного випуску PHP 3.0, він уже був встановлений на більш ніж 70 000 доменах по всьому світу, і вже не обмежується POSIX-сумісними операційними системами. Відносно невелика частка доменів із встановленим PHP була розміщена на серверах під керуванням Windows 95, 98 та NT, а також Macintosh. На піку свого розвитку PHP 3.0 був встановлений приблизно на 10% веб-серверів в Інтернеті.\n\n### PHP 4\n\nДо зими 1998 року, практично відразу після офіційного виходу PHP 3.0, Енді Гутманс та Зів Сураскі почали переробку ядра PHP. У завдання входило збільшення продуктивності складних додатків та покращення модульності кодової бази PHP. PHP 3.0 дав можливість подібним додаткам успішно працювати з набором баз даних та підтримувати велику кількість різних API та протоколів, але PHP 3.0 не мав якісної підтримки модулів та програми працювали неефективно.\n\nНовий двигун, названий \"Zend Engine\" (від імен авторів: Zeev і Andi), успішно справлявся з поставленими завданнями і вперше був представлений в середині 1999 року. PHP 4.0, заснований на цьому движку і що приніс із собою набір додаткових функцій, офіційно вийшов у травні 2000 року, майже через два роки після виходу свого попередника. Крім значного поліпшення продуктивності, PHP 4.0 мав ще кілька ключових нововведень, таких як підтримка набагато більшої кількості веб-серверів, підтримка HTTP сесій, буферизація виведення, більш безпечні способи обробки інформації, що вводиться користувачем, і кілька нових мовних конструкцій.\n\n### PHP 5\n\nПісля довгої розробки та кількох пре-релізів у липні 2004 був випущений PHP 5. В основному він керується ядром `Zend Engine 2.0` з новою об'єктною моделлю та безліччю різних інших нововведень.\n\nКоманда розробників PHP включає десятки розробників, а також десятки інших організацій, що працюють над пов'язаними з PHP та його підтримкою проектами, такими як PEAR, PECL та документацією, а також базову інфраструктуру мережі більш ніж зі ста серверів на шести з семи континентах світу. На основі статистики минулих років, можна з упевненістю припустити, що PHP тепер встановлений на десятки або навіть, можливо, сотні мільйонів доменів по всьому світу.\n","title":"Історія PHP","contentType":2,"navigation":[{"history.md":"« Історія PHP та суміжних проектів"},{"history.php.related.md":"Історія суміжних з PHP проектів"},{"index.md":"PHP Manual"},{"history.md":"Історія PHP та суміжних проектів"}]}},"__N_SSG":true}