{"pageProps":{"page":{"slug":"ibm-db2.constants.md","content":"# Обумовлені константи\n\nНаведені нижче константи визначені цим модулем і доступні або в збірках PHP з підтримкою цього модуля, або коли модуль динамічно завантажений під час виконання коду.\n\n**`DB2_BINARY`**(int)\n\nВказує, що бінарні дані мають бути повернуті як є. Цей режим використовується за замовчуванням.\n\n**`DB2_CONVERT`**(int)\n\nВказує, що бінарні дані мають конвертуватися у шістнадцятковий формат і повертатися як рядок ASCII.\n\n**`DB2_PASSTHRU`**(int)\n\nВказує, що бінарні дані мають бути конвертовані в **`null`**\n\n**`DB2_SCROLLABLE`**(int)\n\nКурсор \"scrollable\" - перемотується. Цей режим дозволяє випадковий доступ до рядків у результуючому наборі, але зараз підтримується лише для IBM DB2 Universal Database.\n\n**`DB2_FORWARD_ONLY`**(int)\n\nКурсор \"forward-only\" – лише вперед. Використовується за промовчанням та підтримується всіма серверами баз даних.\n\n**`DB2_PARAM_IN`**(int)\n\nЗазначена змінна PHP повинна бути прив'язана як параметр IN для процедури, що зберігається.\n\n**`DB2_PARAM_OUT`**(int)\n\nЗазначена змінна PHP повинна бути прив'язана як параметр OUT для процедури, що зберігається.\n\n**`DB2_PARAM_INOUT`**(int)\n\nВказана змінна PHP повинна бути прив'язана як параметр INOUT для процедури, що зберігається.\n\n**`DB2_PARAM_FILE`**(int)\n\nВказує, що стовпець має бути прив'язаний безпосередньо до файлу для введення.\n\n**`DB2_AUTOCOMMIT_ON`**(int)\n\nВказує, що необхідно увімкнути режим автопідтвердження транзакції.\n\n**`DB2_AUTOCOMMIT_OFF`**(int)\n\nВказує, що необхідно вимкнути режим автопідтвердження транзакції.\n\n**`DB2_DOUBLE`**(int)\n\nВказує, що змінна має бути пов'язана як тип даних DOUBLE, FLOAT або REAL.\n\n**`DB2_LONG`**(int)\n\nВказує, що змінна має бути пов'язана як тип даних SMALLINT, INTEGER чи BIGINT.\n\n**`DB2_CHAR`**(int)\n\nВказує, що змінна повинна бути як тип даних CHAR або VARCHAR.\n\n**`DB2_CASE_NATURAL`**(int)\n\nВказує, що імена шпальт повинні повертатися як є, без зміни регістру символів.\n\n**`DB2_CASE_LOWER`**(int)\n\nВказує, що імена стовпців мають повертатися у нижньому регістрі.\n\n**`DB2_CASE_UPPER`**(int)\n\nВказує, що імена шпальт повинні повертатися у верхньому регістрі.\n\n**`DB2_DEFERRED_PREPARE_ON`**(int)\n\nВказує, що для цього ресурсу оператора має бути включений режим відкладеної підготовки.\n\n**`DB2_DEFERRED_PREPARE_OFF`**(int)\n\nВказує, що для цього ресурсу оператора має бути вимкнено режим відкладеної підготовки запиту.\n","title":"Обумовлені константи","contentType":2,"navigation":[{"ibm-db2.resources.md":"« Типи ресурсів"},{"ref.ibm-db2.md":"Функції IBM DB2 »"},{"index.md":"PHP Manual"},{"book.ibm-db2.md":"IBM DB2"}]}},"__N_SSG":true}