{"pageProps":{"page":{"slug":"ibm-db2.installation.md","content":"## Установка\n\nЩоб зібрати модуль ibm\\_db2, необхідно встановити файли заголовків і бібліотеки для розробки програм СУБД DB2. Система DB2 не встановлює їх за промовчанням, тому, можливо, доведеться повернутися до інсталятора DB2 і додати ці налаштування. Клієнт розробки програм (Application Development Client) DB2 включає файли заголовків і доступний для безкоштовного скачування з [» сайту підтримки](https://www.ibm.com/developerworks/downloads/im/db2express/index.md) реляційної системи керування базами даних IBM DB2 Universal Database (DB2 UDB)\n\nЯкщо файли заголовків та бібліотеки для розробки додатків DB2 додані до операційної системи Linux або Unix, в якій база DB2 вже була встановлена, потрібно запустити команду **db2iupdt -e**, щоб оновити символічні посилання на них у цьому примірнику DB2.\n\nМодуль ibm\\_db2 - це модуль [» PECL](https://pecl.php.net/), так що виконайте інструкції «[Встановлення модулів PECL](install.pecl.md)» для встановлення в PHP. Щоб вказати розташування файлів заголовків та бібліотек DB2, команду **configure** запускають як показано нижче:\n\n```\nbash$ ./configure --with-IBM_DB2=/path/to/DB2\n```\n\nПо умолчанию,**configure** використовує шлях /opt/IBM/db2/V8.1.\n\n> **Зауваження** **Примітка для користувачів IIS**\n> \n> Якщо драйвер ibm\\_db2 працює на сервері Microsoft Internet Information Server (IIS), можливо, потрібно зробити наступне:\n> \n> -   Встановіть DB2 із розширеною безпекою операційної системи.\n> -   Додайте шлях до файлу PHP, що виконується, в системну змінну оточення PATH (за замовчуванням C:\\\\php\\\\\n> -   Створіть ще одну системну змінну оточення, що містить шлях до PHP.INI (наприклад: PHPRC = C:\\\\php\\\\\n> -   Додати обліковий запис користувача IUSR\\_COMPUTERNAME до групи DB2USERS.\n","title":"Установка","contentType":2,"navigation":[{"ibm-db2.requirements.md":"« Вимоги"},{"ibm-db2.configuration.md":"Налаштування під час виконання »"},{"index.md":"PHP Manual"},{"ibm-db2.setup.md":"Встановлення та налаштування"}]}},"__N_SSG":true}