{"pageProps":{"page":{"slug":"ibm-db2.configuration.md","content":"## Налаштування під час виконання\n\nПоведінка цих функцій залежить від установок у php.ini.\n\n**ibm\\_db2 Опції налаштування**\n\n| Имя | По умолчанию | Место изменения | Список изменений |\n| --- | --- | --- | --- |\n| [ibm\\_db2.binmode](ibm-db2.configuration.md#ini.ibm-db2.binmode) | \"1\" | **`INI_ALL`** |  |\n| [ibm\\_db2.i5\\_all\\_pconnect](ibm-db2.configuration.md#ini.ibm-db2.i5-all-pconnect) | \"0\" | **`INI_SYSTEM`** | Доступно з ibm\\_db2 1.6.5. |\n| [ibm\\_db2.i5\\_allow\\_commit](ibm-db2.configuration.md#ini.ibm-db2.i5-allow-commit) | \"0\" | **`INI_SYSTEM`** | Доступно з ibm\\_db2 1.4.9. |\n| [ibm\\_db2.i5\\_blank\\_userid](ibm-db2.configuration.md#ini.ibm-db2.i5-blank-userid) | \"0\" | **`INI_SYSTEM`** | Доступно з ibm\\_db2 1.9.7. |\n| [ibm\\_db2.i5\\_char\\_trim](ibm-db2.configuration.md#ini.ibm-db2.i5-char-trim) | \"0\" | **`INI_SYSTEM`** | Доступно з ibm\\_db2 2.1.0. |\n| [ibm\\_db2.i5\\_dbcs\\_alloc](ibm-db2.configuration.md#ini.ibm-db2.i5-dbcs-alloc) | \"0\" | **`INI_SYSTEM`** | Доступно з ibm\\_db2 1.5.0. |\n| [ibm\\_db2.i5\\_guard\\_profile](ibm-db2.configuration.md#ini.ibm-db2.i5-guard-profile) | \"0\" | **`INI_SYSTEM`** | Доступно з ibm\\_db2 1.9.7. |\n| [ibm\\_db2.i5\\_ignore\\_userid](ibm-db2.configuration.md#ini.ibm-db2.i5-ignore-userid) | \"0\" | **`INI_SYSTEM`** | Доступно з ibm\\_db2 1.8.0. |\n| [ibm\\_db2.i5\\_job\\_sort](ibm-db2.configuration.md#ini.ibm-db2.i5-job-sort) | \"0\" | **`INI_SYSTEM`** | Доступно з ibm\\_db2 1.8.4. |\n| [ibm\\_db2.i5\\_log\\_verbose](ibm-db2.configuration.md#ini.ibm-db2.i5-log-verbose) | \"0\" | **`INI_SYSTEM`** | Доступно з ibm\\_db2 1.9.7. |\n| [ibm\\_db2.i5\\_max\\_pconnect](ibm-db2.configuration.md#ini.ibm-db2.i5-max-pconnect) | \"0\" | **`INI_SYSTEM`** | Доступно з ibm\\_db2 1.9.7. |\n| [ibm\\_db2.i5\\_override\\_ccsid](ibm-db2.configuration.md#ini.ibm-db2.i5-override-ccsid) | \"0\" | **`INI_SYSTEM`** | Доступно з ibm\\_db2 1.9.7. |\n| [ibm\\_db2.i5\\_servermode\\_subsystem](ibm-db2.configuration.md#ini.ibm-db2.i5-servermode-subsystem) | NULL | **`INI_SYSTEM`** | Доступно з ibm\\_db2 1.9.7. |\n| [ibm\\_db2.i5\\_sys\\_naming](ibm-db2.configuration.md#ini.ibm-db2.i5-sys-naming) | \"0\" | **`INI_SYSTEM`** | Доступно з ibm\\_db2 1.9.7. |\n| [ibm\\_db2.instance\\_name](ibm-db2.configuration.md#ini.ibm-db2.instance-name) | NULL | **`INI_SYSTEM`** | Доступно з ibm\\_db2 1.0.2. |\n\nКоротке пояснення конфігураційних директив.\n\n`ibm_db2.binmode`int\n\nЦя опція контролює режим конвертації з/в бінарні дані у програмі PHP.\n\n-   1 (DB2\\_BINARY)\n    \n-   2 (DB2\\_CONVERT)\n    \n-   3 (DB2\\_PASSTHRU)\n    \n\n`ibm_db2.i5_all_pconnect`int\n\nЦя опція змушує всі з'єднання бути постійними в операційній системі IBM i. Фактично, всі виклики функції [db2\\_connect()](function.db2-connect.md) прозоро стають викликами функції [db2\\_pconnect()](function.db2-pconnect.md). За замовчуванням ця опція дорівнює . Ця опція підвищує зручність у випадках коли постійні з'єднання працюють швидше. Її не потрібно викликати у нових додатках.\n\n-   0 - можуть бути встановлені постійні та непостійні з'єднання.\n    \n-   1 — Усі з'єднання незмінні.\n    \n\n`ibm_db2.i5_allow_commit`int\n\nЦя опція керує режимом ізоляції транзакцій. За замовчуванням ця опція дорівнює тому контроль зобов'язань не буде використаний. Цю опцію можна перевизначити при підключенні, якщо ключ масиву `i5_commit`установлен в переданном в функцию[db2\\_connect()](function.db2-connect.md) або [db2\\_pconnect()](function.db2-pconnect.md) масиві налаштувань підключення.\n\n-   0 - контроль зобов'язань не використовується.\n    \n-   1 - read uncommitted, можливе брудне читання.\n    \n-   2 - read committed, брудне читання неможливо.\n    \n-   3 - repeatable read, брудне і неповторне читання не можливі.\n    \n-   4 - serializeable, брудне читання, неповторне читання і фантоми не можливі.\n    \n\n`ibm_db2.i5_blank_userid`int\n\nЦя опція керує тим, чи має бути дозволений порожній ідентифікатор користувача в операційній системі IBM i. За замовчуванням значення цієї опції дорівнює . Відмінність цієї опції від опції `ibm_db2.i5_ignore_userid` полягає в тому, що ця опція не змушує всі ідентифікатори користувачів бути порожніми або змінювати поведінку завдання, але дозволяє передавати порожній ідентифікатор користувача для підключення до СУБД Db2 в якості поточного користувача.\n\n-   0 — Не дозволяйте передачу порожнього ідентифікатора користувача.\n    \n-   1 — Дозволяє надсилати порожній ідентифікатор користувача.\n    \n\n`ibm_db2.i5_char_trim`int\n\nЦей параметр керує тим, чи будуть обрізатися кінці рядків в операційній системі IBM i. Це підвищує зручність, оскільки у багатьох таблицях фіксовані розміри стовпців, доповнені пробілами. Значення цієї опції за промовчанням\n\n-   0 - Стовпці не обрізаються.\n    \n-   1 — Прогалини в кінці стовпців символів, що повертаються, будуть видалені.\n    \n\n`ibm_db2.i5_dbcs_alloc`int\n\nЦя опція впливає на стратегію розподілу внутрішнього буфера операційних систем IBM i. За замовчуванням значення цієї опції дорівнює . Якщо ця опція встановлена, виділяються буфери більшого розміру, якщо база даних недооцінює розмір рядка під час перетворення між кодуванням. Для цієї опції потрібно в шість разів більше пам'яті для буферів (щоб врахувати можливі послідовності UTF-8), але може бути потрібна, якщо повертаються обрізані дані.\n\n-   0 - Виділяється мінімальний розмір буферів.\n    \n-   1 — Виділення максимального розміру буферів.\n    \n\n`ibm_db2.i5_guard_profile`int\n\nЦя опція перевіряє, чи був переключений профіль користувача бази даних при підключенні до постійного з'єднання з базою даних в операційній системі IBM i, і якщо так, відключається від бази даних. За промовчанням для цієї опції встановлено значення\n\n-   0 - Не перевіряти зміну профілів.\n    \n-   1 - Перевірити зміну профілів, і якщо так, відключати.\n    \n\n`ibm_db2.i5_log_verbose`int\n\nЦя опція встановлює, чи діагностичні повідомлення SQL на кшталт попереджень і помилок надсилатимуться до журналу помилок PHP в операційній системі IBM i. Зазвичай до PHP-логу надсилається лише коротке повідомлення про збій (наприклад, «виконання виразу не вдалося»), оскільки за замовчуванням значення цієї опції встановлено як . Зверніть увагу, що все ще можна і навіть потрібно викликати функцію [db2\\_stmt\\_errormsg()](function.db2-stmt-errormsg.md) вручну як частину перевірки того, чи функція не завершиться невдало.\n\n-   0 — Реєструються лише короткі повідомлення.\n    \n-   1 — На додаток до коротких повідомлень реєструються діагностичні повідомлення SQL.\n    \n\n`ibm_db2.i5_ignore_userid`int\n\nЦя опція ігнорує ідентифікатор користувача при підключенні до бази даних під час роботи в операційній системі IBM i і запускає функціонал SQL/CLI всередині завдання PHP, а не окремого завдання. За замовчуванням значення цієї опції дорівнює . Якщо увімкнено, вона більше не використовує окреме завдання сервера бази даних і використовує лише поточний профіль користувача для бази даних, ігноруючи ім'я користувача та пароль, передані у функції [db2\\_connect()](function.db2-connect.md) і [db2\\_pconnect()](function.db2-pconnect.md)\n\n-   0 — Використовує дані облікових даних та завдання SQL/CLI.\n    \n-   1 — Використовує порожні облікові дані та запускає SQL/CLI у завданні PHP.\n    \n\n`ibm_db2.i5_job_sort`int\n\nКерує опцією сортування завдань у операційній системі IBM i. За замовчуванням значення цієї опції дорівнює . Це відповідає значенню атрибута SQL/CLI \\*\\*`SQL_ATTR_CONN_SORT_SEQUENCE`\\*\\*в IBM i.\n\n-   0 — Використовує налаштування сортування констант\\*\\*`*HEX`\\*\\*, сортування за байтами.\n    \n-   1 — Використовує послідовність сортування завдань, встановлену для PHP-завдання.\n    \n-   2 — Використовує послідовність сортування завдань, встановлену для завдання бази даних.\n    \n\n`ibm_db2.i5_max_pconnect`int\n\nЦя опція впливає на те, скільки разів постійне з'єднання можна перевикористовувати під час роботи в операційній системі IBM i. За замовчуванням значення цієї опції дорівнює , що означає, що постійне з'єднання можна використовувати повторно. Цей параметр допомагає уникнути проблем довгострокового завдання бази даних. (Тобто якщо процедура викликає витік пам'яті), але це явно не довгострокове рішення.\n\n`ibm_db2.i5_override_ccsid`int\n\nІдентифікатор PASE CCSID для перетворення символів із коду EBCDIC в операційній системі IBM i. За замовчуванням це , який вибере значення за промовчанням ідентифікатор CCSID для завдання оточення PASE, який буде взято з налаштувань мовного стандарту оточення PASE. Наприклад, установка для цієї опції значення `1208` використовуватиме кодування UTF-8. Цю опцію можна змінювати лише тоді, коли ідентифікатор CCSID завдання оточення PASE не відповідає ідентифікатору CCSID, який очікувався, і не можна змінити мовний стандарт.\n\nДізнатися більше про ідентифікатор CCSIDs операційної системи IBM i можна в [» документації IBM](https://www.ibm.com/docs/en/i/7.5?topic=information-ccsid-reference). Дізнатися, як мовні стандарти в оточенні PASE системи IBM i зіставляються з ідентифікаторами CCSID можна також у [» документації IBM](https://www.ibm.com/docs/en/i/7.5?topic=ssw_ibm_i_75/apis/pase_locales.md)\n\n`ibm_db2.i5_sys_naming`int\n\nЦя опція керує режимом іменування при підключенні до IBM i. За замовчуванням значення цієї опції дорівнює . Режим іменування впливає спосіб дозволу імен і дозволений синтаксис імен. Якщо встановлено значення , для уточнення імен вона використовуватиме точки, а для дозволу імен - бібліотеку за промовчанням або ідентифікатор користувача. Якщо встановлено значення для уточнення імен вона використовуватиме слеші, а для вирішення імен — список бібліотек завдань.\n\n-   0 — Використовувати режим іменування SQL (SCHEMA.TABLE).\n    \n-   1 — Використовувати режим системного іменування (LIBRARY/FILE).\n    \n\nДізнатися більше про режими іменування в IBM i можна в [» документації IBM](https://www.ibm.com/docs/en/i/7.5?topic=application-naming-distributed-relational-database-objects)\n\n`ibm_db2.i5_servermode-subsystem`string\n\nЦей параметр змінює те, під якою підсистемою виконуються завдання сервера бази даних IBM i. За замовчуванням значення цієї опції дорівнює **`null`**, тому завдання для QSQSRVR-завдань будуть виконуватися в підсистемі за промовчанням.\n\n`ibm_db2.instance_name`string\n\nВ операційних системах Linux та UNIX ця опція визначає ім'я екземпляра для каталогізованих підключень до бази даних. За замовчуванням значення цієї опції дорівнює **`null`**. Якщо цю опцію встановлено, її значення перевизначає налаштування змінної оточення DB2INSTANCE.\n\nЦя функція ігнорується в операційних системах Windows.\n","title":"Налаштування під час виконання","contentType":2,"navigation":[{"ibm-db2.installation.md":"« Встановлення"},{"ibm-db2.resources.md":"Типи ресурсів »"},{"index.md":"PHP Manual"},{"ibm-db2.setup.md":"Встановлення та налаштування"}]}},"__N_SSG":true}