{"pageProps":{"page":{"slug":"install.unix.md","content":"# Встановлення на Unix-системи\n\n## Зміст\n\n-   [Apache 2.x на Unix системах](install.unix.apache2.md)\n-   [Встановлення Nginx 1.4.x на систему Unix](install.unix.nginx.md)\n-   [Встановлення PHP на Lighttpd 1.4 на Unix-системах](install.unix.lighttpd-14.md)\n-   [Веб-сервер LiteSpeed/OpenLiteSpeed ​​на системах Unix](install.unix.litespeed.md)\n-   [Установка з інтерфейсами CGI та командного рядка](install.unix.commandline.md)\n-   [OpenBSD, зауваження щодо встановлення](install.unix.openbsd.md)\n-   [Інструкції з інсталяції для ОС Solaris](install.unix.solaris.md)\n-   [Інструкції зі встановлення на Debian GNU/Linux](install.unix.debian.md)\n\nЦей розділ описує встановлення та налаштування PHP на Unix-системах. Будь ласка, прочитайте всі розділи, що стосуються вашої платформи або веб-сервера, перш ніж ви приступите до встановлення.\n\nЯк сказано у розділі [Загальні вказівки щодо встановлення](install.general.md), в цьому розділі ми в основному описуємо установку PHP, орієнтовану на веб, однак ми також зачіпаємо установку PHP для використання в командному рядку.\n\nЄ кілька способів встановлення PHP на платформі Unix. Один з них – процес конфігурування та компіляції вихідників, інший – установка з пакетів. Цей документ фокусується на установці з вихідних кодів. Багато Unix-подібних систем мають різні системи встановлення програм із пакетів. Вони можуть допомогти в установці стандартних конфігурацій, але якщо вам потрібні інші варіанти (такі як безпечний сервер або інший драйвер бази даних), вам може знадобитися скомпілювати PHP та/або ваш веб-сервер. Якщо ви незнайомі з компілюванням власного програмного забезпечення, то, можливо, варто пошукати готовий пакет PHP з потрібними вам можливостями, зібраний будь-ким ще.\n\nДля компіляції PHP з вихідних кодів вам знадобиться таке:\n\n-   Базові знання Unix (здатність поводитися з \"make\" та компілятором C)\n-   Компілятор ANSI C\n-   Веб-сервер\n-   Будь-які компоненти, специфічні для окремих модулів PHP (такі як бібліотеки GD, PDF тощо)\n\nПри складанні безпосередньо з вихідних Git або після ручних змін вам може також знадобитися:\n\n-   autoconf: 2.59+ (для PHP >= 7.0.0), 2.64+ (для PHP >= 7.2.0)\n-   automake: 1.4+\n-   libtool: 1.4.x+ (крім версії 1.4.2)\n-   re2c: 0.13.4+\n-   bison:\n    -   PHP 7.0 - 7.3: 2.4 і вище (включаючи Bison 3.x)\n    -   PHP 7.4: > 3.0\n\nЗагальна (або початкова) конфігурація PHP задається параметрами скрипту **configure**. Ви можете переглянути список допустимих параметрів разом з коротким поясненням за допомогою команди **./configure --help**. Різні опції документовані в цьому посібнику окремо, список основних параметрів можна переглянути у програмі [Основні параметри конфігурації](configure.about.md), тоді як параметри, специфічні для різних модулів, описані сторінках документації, присвячених цим модулям.\n\nКоли PHP налаштовано, все готове до складання модулів та/або виконуваних файлів. Про це має подбати команда **make**. Якщо щось не вийшло і ви не можете зрозуміти чому, дивіться розділ [Проблеми встановлення](install.problems.md)\n\n> **Зауваження** :\n> \n> Деякі Unix системи (такі як OpenBSD і SELinux) можуть забороняти, з міркувань безпеки, виділення пам'яті одночасно записуваної та виконуваної. Це називається PaX MPROTECT або порушення захисту W^X. Проте, такий режим виділення пам'яті необхідний підтримки JIT компіляції PCRE JIT, отже у разі необхідно збирати PHP [без підтримки JIT компіляції PCRE](pcre.installation.md), або бінарні файли повинні бути внесені до білого списку операційної системи,\n\n> **Зауваження**: Крос-компіляція під ARM за допомогою \"Android toolchain\" на даний момент не підтримується.\n","title":"Встановлення на Unix-системи","contentType":2,"navigation":[{"install.general.md":"« Загальні інструкції з встановлення"},{"install.unix.apache2.md":"Apache 2.x на Unix системах"},{"index.md":"PHP Manual"},{"install.md":"Встановлення та налаштування"}]}},"__N_SSG":true}