{"pageProps":{"page":{"slug":"install.windows.recommended.md","content":"## Рекомендована конфігурація для Windows\n\n### OpCache\n\nРекомендовано використовувати OpCache. Цей модуль у складі дистрибутива для Windows. Модуль компілює PHP-скрипт, оптимізує його та кешує в пам'яті, що дозволяє не витрачати час та ресурси сервера на компіляцію скрипта при кожному запиті до нього.\n\nВстановіть у вашому php.ini наступні опції\n\n**Приклад #1 Рекомендована конфігурація OpCache**\n\n```\nopcache.enable=On\nopcache.enable_cli=On\n```\n\nІ перезавантажте ваш веб-сервер. Докладніше читайте: [Конфігурація OpCache](opcache.configuration.md)\n\n### WinCache\n\nЯкщо ви використовуєте IIS, рекомендується разом з ним використовувати WinCache, особливо якщо використовується віртуальний хостинг або мережеве сховище (NAS). Всі програми PHP автоматично отримуватимуть переваги WinCache. Файлові операції кешуватимуться у пам'яті. Також WinCache може кешувати в пам'яті об'єкти користувача і розділяти їх між різними процесами php.exe або php-cgi.exe (розподіл об'єктом між запитами). Багато веб-додатків мають плагін, модуль або опції налаштування, що дозволяють використовувати кешування об'єктів користувача за допомогою WinCache. Якщо вам потрібна висока продуктивність, вам доведеться кешувати об'єкти у своєму додатку. Завантажити WinCache можна за посиланням [» http://pecl.php.net/package/WinCache](http://pecl.php.net/package/WinCache). Після завантаження потрібно зберегти WinCache DLL в директорію модулів PHP (extensions\\_dir у вашому php.ini). Встановіть у вашому php.ini такі опції:\n\n**Приклад #2 Рекомендована конфігурація WinCache**\n\n```\nextension=php_wincache.dll\nwincache.fcenabled=1\nwincache.ocenabled=1 ; удалено в wincache 2.0.0.0\n```\n\nБолее подробно читайте:[Конфігурація WinCache](wincache.configuration.md)\n\n### Конфігурація IIS\n\nУ IIS Manager встановіть модуль FastCGI і додайте обробку \\`.php\\`файлом PHP-CGI.exe (не PHP.exe)\n\nВи можете використовувати APPCMD з командного рядка для автоматизації налаштування ISS.\n\n### База даних\n\nНапевно, вам знадобиться сервер баз даних. Для всіх популярних баз даних є модулі PHP. Якщо ваш сайт не розраховується під високе навантаження, сервер баз даних можна тримати на тому ж хості, що і веб-сервер. Під Windows є безліч різних баз даних.\n\nPHP модулі включають mysqli та pdo\\_mysql.\n\nДополнительно читайте[» https://dev.mysql.com/downloads/windows/](https://dev.mysql.com/downloads/windows/)\n","title":"Рекомендована конфігурація для Windows","contentType":2,"navigation":[{"install.windows.tools.md":"« Інструмент встановлення PHP на Windows"},{"install.windows.manual.md":"Самостійне встановлення PHP у Windows »"},{"index.md":"PHP Manual"},{"install.windows.md":"Встановлення у системах Windows"}]}},"__N_SSG":true}