{"pageProps":{"page":{"slug":"install.fpm.configuration.md","content":"## Налаштування\n\nFPM використовує синтаксис php.ini для файлу конфігурації php-fpm.conf і файлів конфігурації пулів.\n\n### Список глобальних директив php-fpm.conf\n\n`pid`string\n\nШлях до файлу PID. Типово: none.\n\n`error_log`string\n\nШлях до файлу журналу помилок. За замовчуванням: `#INSTALL_PREFIX#/log/php-fpm.log`. . Якщо встановлено як \"syslog\", логування буде здійснюватися в syslogd, а не в локальний файл.\n\n`log_level`string\n\nРівень журналування помилок. Можливі значення: alert, error, warning, notice, debug. Типово: notice.\n\n`log_limit`int\n\nОбмежити журналування для ліній, що журналюються, що дозволяє записувати повідомлення довжиною більше 1024 символів без упаковки (wrapping). Стандартне значення: 1024. Доступно з PHP 7.3.0.\n\n`log_buffering`bool\n\nЕкспериментальне журналування без додаткової буферизації. Значення за промовчанням: yes. Доступно з PHP 7.3.0.\n\n`syslog.facility`string\n\nВикористовується для вказівки, який тип програм логуватиме повідомлення. Типово: daemon.\n\n`syslog.ident`string\n\nПередує будь-якому повідомленню. Якщо у вас запущено кілька екземплярів FPM, ви можете змінити значення за промовчанням на те, яке вам потрібно. Типово: php-fpm.\n\n`emergency_restart_threshold`int\n\nПри цьому кількість робочих процесів, завершених із SIGSEGV або SIGBUS за проміжок часу, встановлений `emergency_restart_interval` FPM буде перезавантажено. Значення 0 означає 'Off' (вимкнено). Типово: 0 (Off).\n\n`emergency_restart_interval` [mixed](language.types.declarations.md#language.types.declarations.mixed)\n\nІнтервал часу, що використовується `emergency_restart_interval`, щоб визначити, коли FPM буде м'яко перезавантажено. Це корисно для запобігання випадковим пошкодженням загальної пам'яті прискорювача (accelerator). Доступні одиниці вимірювання: s(секунди), m(хвилини), h(години), або d(дні). Одиниця виміру за замовчуванням: секунди. Стандартне значення: 0 (Off).\n\n`process_control_timeout` [mixed](language.types.declarations.md#language.types.declarations.mixed)\n\nЧас, протягом якого дочірні процеси чекають на сигнали майстер-процесу. Доступні одиниці вимірювання: s(секунди), m(хвилини), h(години) або d(дні). Одиниця виміру за замовчуванням: секунди. Значення за промовчанням: 0.\n\n`process.max`int\n\nМаксимальна кількість процесів може породити FPM. Це зроблено для того, щоб контролювати глобальну кількість процесів, коли використовується великий пул динамічного PM. Використовуйте з обережністю. Типово: 0.\n\n`process.priority`int\n\nВказує пріоритет (Unix nice(2)) майстер-процесу (тільки якщо встановлено). Приймає значення від -19 (максимальний пріоритет) до 20 (мінімальний). За замовчуванням: не встановлено.\n\n`daemonize`bool\n\nЗапустити FPM у фоновому режимі. Встановіть значення 'no', щоб запустити FPM у диспетчері для налагодження. Типово: yes.\n\n`rlimit_files`int\n\nВстановлює rlimit відкритих файлових дескрипторів для майстер-процесу. Типово: Значення, визначене системою.\n\n`rlimit_core`int\n\nВстановлює rlimit максимального розміру ядра для майстер-процесу. Типово 0.\n\n`events.mechanism`string\n\nВказує, який механізм дії буде використаний FPM. Можливі такі варіанти: select, pool, epoll, kqueue (\\*BSD), порт (Solaris). За промовчанням: не встановлено (автовизначення).\n\n`systemd_interval`int\n\nЯкщо FPM зібраний з інтеграцією з systemd, вказує інтервал, в секундах між сповіщеннями systemd про свій стан. Щоб вимкнути, встановіть 0. За замовчуванням: 10.\n\n### Перелік директив для пулів.\n\nЗа допомогою FPM можна запускати кілька пулів процесів з різними налаштуваннями. Ці параметри можуть бути передані пулу.\n\n`listen`string\n\nАдреса, яка прийматиме FastCGI-запити. Синтаксис: 'ip.add.re.ss:port', 'port', '/path/to/unix/socket'. Ця опція є обов'язковою для кожного пулу.\n\n`listen.backlog`int\n\nУстанавливает listen(2) backlog. Значение`-1`означает максимум на системах BSD. Значение по умолчанию:`-1` (FreeBSD або OpenBSD) або `511`. (Linux та інші платформи).\n\n`listen.allowed_clients`string\n\nСписок адрес IPv4 або IPv6 клієнтів FastCGI, яким дозволено підключення. Еквівалент змінної оточення FCGI\\_WEB\\_SERVER\\_ADDRS в оригінальному PHP FastCGI (5.2.2+). Має сенс лише з TCP-сокетом. Кожна адреса має бути розділена комою. Якщо залишити це значення порожнім, з'єднання прийматимуться з будь-якої IP-адреси. Значення за замовчуванням: не встановлено (приймається будь-яка IP-адреса).\n\n`listen.owner`string\n\nВстановлює права для unix-сокету, якщо вони використовуються. У Linux для дозволу з'єднань до веб-сервера, мають бути встановлені права на читання/запис. Багато заснованих на BSD-системах можливість з'єднання залежить від прав доступу. Значення за промовчанням: використовується користувач і група, від імені якої запущено сервер, встановлено режим 0660.\n\n`listen.group`string\n\nСмотрите`listen.owner`\n\n`listen.mode`string\n\nСмотрите`listen.owner`\n\n`listen.acl_users`string\n\nЯкщо підтримується список керування доступом (ACL) POSIX, можна налаштувати його за допомогою цієї опції. Якщо поставлено, то `listen.owner`и`listen.group` будуть проігноровані. Значення задається списком імен, розділених комою.\n\n`listen.acl_groups`string\n\nСмотрите`listen.acl_users`. Значення визначається списком імен груп, розділених комою.\n\n`user`string\n\nUnix-користувач FPM-процесів. Цей параметр є обов'язковим.\n\n`group`string\n\nUnix-група FPM-процесів. Якщо не встановлено, група за промовчанням дорівнює імені користувача.\n\n`pm`string\n\nВибір того, як менеджер процесів контролюватиме створення дочірніх процесів. Можливі значення: `static` `ondemand` `dynamic`. Цей параметр є обов'язковим.\n\n`static` - фіксована кількість дочірніх процесів (`pm.max_children`\n\n`ondemand` - Число процесів, що породжуються на вимогу (коли з'являються запити, на відміну від опції dynamic, коли стартує певна кількість процесів, що дорівнює `pm.start_servers`, разом із запуском служби.\n\n`dynamic` - число дочірніх процесів, що динамічно змінюється, задається на підставі наступних директив: `pm.max_children` `pm.start_servers` `pm.min_spare_servers` `pm.max_spare_servers`\n\n`pm.max_children`int\n\nЧисло дочірніх процесів, які будуть створені, коли `pm`установлен в`static`, або максимальна кількість процесів, які будуть створені, коли `pm`установлен в`dynamic`. Цей параметр є обов'язковим.\n\nЦей параметр встановлює обмеження кількості одночасних запитів, які будуть обслуговуватися. Еквівалент директиви ApacheMaxClients з mpm\\_prefork та змінної оточення середовища PHP\\_FCGI\\_CHILDREN в оригінальному PHP FastCGI.\n\n`pm.start_servers`int\n\nЧисло дочірніх процесів, створюваних під час запуску. Використовується тільки коли `pm`установлен в`dynamic`Значение по умолчанию: min\\_spare\\_servers + (max\\_spare\\_servers - min\\_spare\\_servers) / 2.\n\n`pm.min_spare_servers`int\n\nБажана мінімальна кількість неактивних процесів сервера. Використовується тільки коли `pm`установлено в`dynamic`. З іншого боку, це обов'язковий параметр у разі.\n\n`pm.max_spare_servers`int\n\nБажана максимальна кількість неактивних процесів сервера. Використовується тільки коли `pm`установлен в`dynamic`. З іншого боку, це обов'язковий параметр у разі.\n\n`pm.max_spawn_rate`int\n\nКількість одночасних породжень дочірніх процесів. Використовується лише тоді, коли параметр `pm`установлено значение`dynamic`Значение по умолчанию: 32\n\n`pm.process_idle_timeout` [mixed](language.types.declarations.md#language.types.declarations.mixed)\n\nЧисло секунд, по закінченню яких процес, що простоює, буде завершено. Використовується лише якщо `pm`установлено как`ondemand`. Допустимі одиниці: s(econds)(за замовчуванням), m(inutes), h(ours) або d(ays). Типово: 10s.\n\n`pm.max_requests`int\n\nЧисло запитів дочірнього процесу, після якого процес буде перезапущено. Це корисно для запобігання витоку пам'яті під час використання сторонніх бібліотек. Для нескінченної обробки запитів вкажіть '0'. Еквівалент PHP\\_FCGI\\_MAX\\_REQUESTS. Значення за промовчанням: 0.\n\n`pm.status_listen`string\n\nАдреса, за якою прийматиметься запит стану FastCGI. Створює новий невидимий пул, який може самостійно обробляти запити. Корисно, якщо основний пул зайнятий запитами, що довго виконуються, так як все ще можна отримати [сторінку стану FPM](fpm.status.md) до завершення тривалих запитів. Синтаксис такий самий, як і для директиви [listen](install.fpm.configuration.md#listen)Значение по умолчанию: none.\n\n`pm.status_path`string\n\nПосилання, по якому можна переглянути [сторінку стану FPM](fpm.status.md)Значение должно начинаться со слеша (/). Если значение не установлено, то страница статуса отображаться не будет. Значение по умолчанию: none.\n\n`ping.path`string\n\nПосилання на ping-сторінку FPM моніторингу. Якщо значення не встановлено, ping-сторінка не відображатиметься. Може бути використане для тестування ззовні, щоб переконатися, що FPM живий та відповідає. Зверніть увагу, що значення має починатися з косої межі (/).\n\n`ping.response`string\n\nЦя директива може бути використана для налаштування відповіді на ping-запит. Відповідь формується як text/plain з кодом відповіді 200. Значення за замовчуванням: pong.\n\n`process.priority`int\n\nВказує пріоритет nice(2) для працюючого процесу (тільки якщо заданий). Значення від -19 (найвищий пріоритет) до 20 (найнижчий). Значення за замовчуванням: не встановлено.\n\n`process.dumpable`bool\n\nВстановити прапор процесу dumpable (PR\\_SET\\_DUMPABLE prctl), навіть якщо користувач процесу або група відрізняється від користувача майстер-процесу. Це дозволяє створювати дамп ядра процесу та виконати ptrace процесу для користувача пула. Значення за промовчанням: no. Доступно з PHP 7.0.29, 7.1.17 та 7.2.5.\n\n`prefix`string\n\nЗадає префікс для обчислення шляху\n\n`request_terminate_timeout` [mixed](language.types.declarations.md#language.types.declarations.mixed)\n\nЧас очікування на обслуговування одного запиту, після чого робочий процес буде завершено. Цей варіант слід використовувати, коли опція 'max\\_execution\\_time' в php.ini не зупиняє виконання скрипту з якихось причин. Значення '0' означає 'вимкнено'. Доступні одиниці виміру: s(econds), m(inutes), h(ours) або d(ays). Значення за промовчанням: 0.\n\n`request_terminate_timeout_track_finished`bool\n\nВремя ожидания, установленное с помощью[request\\_terminate\\_timeout](install.fpm.configuration.md#request-terminate-timeout), не включається після [fastcgi\\_finish\\_request](function.fastcgi-finish-request.md) або коли програма завершена та викликаються внутрішні функції завершення роботи. Ця директива дозволить беззастережно застосовувати обмеження часу очікування навіть у таких випадках. Стандартне значення: ні, починаючи з версії PHP 7.3.0.\n\n`request_slowlog_timeout` [mixed](language.types.declarations.md#language.types.declarations.mixed)\n\nЧас очікування на обслуговування одного запиту, після чого PHP backtrace буде збережений у файл 'slowlog'. Значення '0' означає 'вимкнено'. Доступні одиниці виміру: s(econds), m(inutes), h(ours) або d(ays). Значення за промовчанням: 0.\n\n`request_slowlog_trace_depth`int\n\nГлибина трасування стека журналу slowlog. Стандартне значення: 20, починаючи з PHP 7.2.0.\n\n`slowlog`string\n\nЛог файл для повільних запитів. Значення за замовчуванням: `#INSTALL_PREFIX#/log/php-fpm.log.slow`\n\n`rlimit_files`int\n\nВстановлює ліміт дескрипторів відкритих файлів rlimit для дочірніх процесів у цьому пулі. Значення за промовчанням: визначається значенням системи.\n\n`rlimit_core`int\n\nВстановлює максимальну кількість використовуваних ядер rlimit для дочірніх процесів у цьому пулі. Можливі значення: 'unlimited' або ціле число більше або рівне 0. Значення за замовчуванням: визначається значенням системи.\n\n`chroot`string\n\nДиректорія chroot оточення у старті. Це значення має визначити як абсолютний шлях. Якщо значення не встановлено, chroot не використовується.\n\n`chdir`string\n\nChdir змінює поточну директорію у старті. Це значення має визначити як абсолютний шлях. Значення за замовчуванням: поточна директорія або при використанні chroot.\n\n`catch_workers_output`bool\n\nПеренаправлення STDOUT і STDERR робочого процесу на головний лог помилок. Якщо не встановлено, STDOUT і STDERR будуть перенаправлені в /dev/null відповідно до специфікації FastCGI. Значення за промовчанням: no.\n\n`decorate_workers_output`bool\n\nУвімкніть оформлення виходу (output decoration) для виведення worker-процесу коли опція [catch\\_workers\\_output](install.fpm.configuration.md#catch-workers-output)включена. Значение по умолчанию: yes. Доступно с PHP 7.3.0.\n\n`clear_env`bool\n\nОчищає оточення у worker-процесах FPM. Запобігає потраплянню довільних змінних оточення до worker-процесів FPM, очищуючи оточення у worker-процесах до того, як змінні оточення, зазначені в цій конфігурації пула будуть додані. Типово: Yes.\n\n`security.limit_extensions`string\n\nОбмежує модулі, які FPM аналізуватиме. Це може запобігти помилкам конфігурації на стороні веб-сервера. Ви повинні обмежити FPM тільки розширеннями .php для запобігання виконання PHP-коду зловмисниками іншими розширеннями. За замовчуванням: .php .phar\n\n`apparmor_hat`string\n\nЯкщо AppArmor увімкнено, дозволяє змінити шапку. Значення за замовчуванням: не встановлено\n\n`access.log`string\n\nЛог файл доступу. Значення за замовчуванням: не встановлено\n\n`access.format`string\n\nФормат лог-файла доступа. Значение по умолчанию:`\"%R - %u %t \\\"%m %r\\\" %s\"` :\n\n**Допустимі значення**\n\n| Заполнитель | Опис |\n| --- | --- |\n| **`%C`** | %CPU |\n| **`%d`** | тривалість µs |\n| **`%e`** | fastcgi env |\n| **`%f`** | скрипт |\n| **`%l`** | довжина вмісту |\n| **`%m`** | метод |\n| **`%M`** | пам'ять |\n| **`%n`** | назва пула |\n| **`%o`** | висновок заголовка |\n| **`%p`** | PID |\n| **`%q`** | рядок запиту |\n| **`%Q`** | GLUE між %q та %r |\n| **`%r`** | URI запиту |\n| **`%R`** | віддалена IP-адреса |\n| **`%s`** | статус |\n| **`%T`** | час |\n| **`%t`** | час |\n| **`%u`** | віддалений користувач |\n\nМожна передати додаткові змінні оточення та оновити налаштування PHP для певного пулу. Для цього вам необхідно додати такі параметри до файлу налаштування пулу.\n\n**Приклад #1 Передача змінних оточення та налаштувань PHP пулу**\n\nenv\\[HOSTNAME\\]= $HOSTNAME env\\[PATH\\]= /usr/local/bin:/usr/bin:/bin env\\[TMP\\]= /tmp env\\[TMPDIR\\]= /tmp env\\[TEMP\\]= /tmp\n\nphp\\_admin\\_value\\[sendmail\\_path\\]= /usr/sbin/sendmail -t -i -f[www@my.domain.com](mailto:www@my.domain.com)php\\_flag\\[display\\_errors\\]= off php\\_admin\\_value\\[error\\_log\\]= /var/log/fpm-php.[www.log](http://www.log)php\\_admin\\_flag\\[log\\_errors\\]= on php\\_admin\\_value\\[memory\\_limit\\]= 32M\n\nНалаштування PHP, передані через `php_value`или`php_flag` перезапишуть їхні попередні значення. Будь ласка, зверніть увагу, що визначення [disable\\_functions](ini.core.md#ini.disable-functions) або [disable\\_classes](ini.core.md#ini.disable-classes) не перезаписуватимуть раніше визначені в php.ini значення, а додадуть нові значення.\n\nНалаштування, визначені через `php_admin_value`и`php_admin_flag`, не можуть бути перезаписані через [ini\\_set()](function.ini-set.md)\n\nУстановки PHP можна інсталювати через веб-сервер.\n\n**Приклад #2 Встановлення налаштувань PHP у nginx.conf**\n\nset $php\\_value \"pcre.backtrack\\_limit=424242\"; set $php\\_value \"$php\\_value\\\\n pcre.recursion\\_limit=99999\"; fastcgi\\_param PHP\\_VALUE $php\\_value;\n\nfastcgi\\_param PHP\\_ADMIN\\_VALUE \"open\\_basedir=/var/www/htdocs\";\n\n**Застереження**\n\nОскільки ці налаштування передаються в php-fpm як FastCGI-заголовки, php-fpm не повинен бути прив'язаний до загальнодоступної адреси світу. В іншому випадку будь-хто зможе змінити налаштування PHP. Дивіться також [listen.allowed\\_clients](install.fpm.configuration.md#listen-allowed-clients)\n\n> **Зауваження**: Пули не є механізмом безпеки, тому що вони не забезпечують повного поділу; наприклад, всі пули будуть використовувати один екземпляр OPcache.\n","title":"Налаштування","contentType":2,"navigation":[{"install.fpm.install.md":"« Встановлення"},{"install.pecl.md":"Встановлення модулів PECL »"},{"index.md":"PHP Manual"},{"install.fpm.md":"Менеджер процесів FastCGI (FPM)"}]}},"__N_SSG":true}