{"pageProps":{"page":{"slug":"install.unix.openbsd.md","content":"## OpenBSD, зауваження щодо встановлення\n\nЦя секція містить зауваження та поради щодо встановлення PHP на [» OpenBSD](http://www.openbsd.org/)\n\n### Використання бінарних пакетів\n\nВикористання бінарних пакетів для встановлення PHP на OpenBSD – це найпростіший та рекомендований спосіб. Ядро (основний пакет) відокремлено від різних модулів, але кожен із них може бути встановлений або видалений незалежно від іншого. Файли, які вам знадобляться, ви можете знайти на OpenBSD CD або на FTP.\n\nОсновний пакет, який необхідно встановити - це php, він містить базовий двигун (плюс fpm, gettext та iconv) і може бути доступний у кількох версіях на вибір. Далі зверніть увагу на пакети модулів, такі як php-mysqli або php-imap. Вам слід використати команду **phpxs** для активації або деактивації цих модулів у php.ini.\n\n**Приклад #1 Приклад установки пакетів у OpenBSD**\n\n#pkg\\_add php\n\n# pkg\\_add php-apache\n\n# pkg\\_add php-mysqli\n\n(install the PEAR libraries)\n\n# pkg\\_add pear\n\nДотримуйтесь інструкцій, що виводяться пакетами під час встановлення!\n\n(to remove packages)\n\n# pkg\\_delete php\n\n# pkg\\_delete php-apache\n\n# pkg\\_delete php-mysqli\n\n# pkg\\_delete pear\n\nЧитайте страницу руководства[» packages(7)](http://www.openbsd.org/cgi-bin/man.cgi?query=packages) для більшої інформації про бінарні пакети в OpenBSD.\n\n### Використання портів\n\nВи можете також скомпілювати PHP з вихідних джерел, використовуючи [» дерево портів](http://www.openbsd.org/faq/ports/ports.md). Тим не менш, цей спосіб рекомендований тільки для тих, хто добре знайомий з OpenBSD. Порт PHP розбитий на ядро ​​та модулі. Модулі генерують підпакети для всіх підтримуваних модулів PHP. Якщо якісь із них вам не потрібні, використовуйте FLAVOR **no\\_\\***НаПриклад, для пропуска модуля imap, установите FLAVOR в**no\\_imap**\n\n### Стандартні проблеми\n\n-   Apache і Nginx більше не є веб-серверами для OpenBSD, але їх дуже легко знайти і поставити з портів і пакетів. Новий стандартний сервер називається 'httpd'.\n-   Стандартна установка httpd працює в[» chroot(2) оточенні](http://www.openbsd.org/cgi-bin/man.cgi?query=chroot), що забороняє PHP доступ до файлів поза /var/www. Так що вам знадобиться створити директорію /var/www/tmp для збереження сесійних файлів PHP, або використовувати альтернативний бекенд для керування сесіями. До того ж, сокети баз даних потрібно буде розміщувати в chroot, або слухати на інтерфейсі localhost. Якщо ви використовуєте функції роботи з мережею, деякі файли з /etc, такі як /etc/resolv.conf та /etc/services, необхідно буде помістити в /var/www/etc. У OpenBSD пакет PEAR автоматично встановлюється в правильні директорії chroot.\n-   Пакет модуля[» gd](http://www.libgd.org/)для OpenBSD вимагає встановлення Xorg. Якщо він ще не встановлений при базовій установці шляхом додавання набору файлів xbase.tgz, його можна додати після встановлення (див.[» OpenBSD FAQ#4](https://www.openbsd.org/faq/faq4.md#FilesNeeded)\n","title":"OpenBSD, зауваження щодо встановлення","contentType":2,"navigation":[{"install.unix.commandline.md":"« Установка з інтерфейсами CGI та командного рядка"},{"install.unix.solaris.md":"Інструкції з інсталяції для ОС Solaris »"},{"index.md":"PHP Manual"},{"install.unix.md":"Встановлення на Unix-системи"}]}},"__N_SSG":true}