{"pageProps":{"page":{"slug":"install.unix.debian.md","content":"## Інструкції зі встановлення на Debian GNU/Linux\n\nРозділ містить інформацію та підказки, які стосуються встановлення PHP на [» Debian GNU/Linux](http://www.debian.org/)\n\n**Увага**\n\nНеофіційні зборки від третіх осіб не підтримуються. Про будь-які помилки слід повідомляти розробникам Debian, але перед цим варто перевірити, чи можливо вони вже виправлені в нових релізах, які можна завантажити на [» сторінці завантаження](https://www.php.net/downloads.php)\n\nХоча існує універсальна інструкція з встановлення PHP на Unix/Linux, у цьому розділі ми розглянемо особливості специфічні для Debian, такі як використання команд `apt`или`aptitude`. У рамках цього посібника обидві ці команди розглядаються як взаємозамінні.\n\n### Використання APT\n\nПо-перше, зверніть увагу на те, що деякі пакети пов'язані: `libapache-mod-php` потрібен для інтеграції з Apache 2, та `php-pear`с PEAR.\n\nПо-друге, перед встановленням переконайтеся, що список пакетів перебуває у актуальному стані. Як правило, це робиться за допомогою команди **apt update**\n\n**Приклад #1 Приклад установки Apache 2 на Debian**\n\n#apt install php-common libapache2-mod-php php-cli\n\nAPT автоматично встановить модуль PHP для Apache 2 і всі їх залежності і активує їх. Apache має бути перезапущений для того, щоб зміни набули чинності. Наприклад:\n\n**Приклад #2 Зупинка та запуск Apache після встановлення PHP**\n\n#/etc/init.d/apache2 stop\n\n# /etc/init.d/apache2 start\n\n### Контроль конфігурації\n\nСпочатку PHP встановлюється тільки з основними модулями ядра. Якщо ви бажаєте встановити додаткові модулі, такі як [MySQL](book.mysql.md) [cURL](book.curl.md) [GD](book.image.md) і т.д., це також можна зробити за допомогою команди `apt`\n\n**Приклад #3 Способи отримати список додаткових пакетів PHP**\n\n#apt-cache search php\n\n# apt search php | grep -i mysql\n\n# aptitude search php\n\nБуде виведено список великої кількості пакетів, включаючи кілька специфічних, таких як php-cgi, php-cli та php-dev. Визначте, які вам потрібні та встановіть за допомогою `apt-get`или`aptitude`. І оскільки Debian здійснює перевірку залежностей, вам буде виведено запит на їх встановлення.\n\n**Приклад #4 Установка PHP з MySQL та cURL**\n\n#apt install php-mysql php-curl\n\nAPT автоматично додасть необхідні рядки у відповідні php.ini, /etc/php/7.4/php.ini, /etc/php/7.4/conf.d/\\*.ini, і т.д. Залежно від модуля будуть внесені записи типу `extension=foo.so`. У будь-якому випадку, щоб ці зміни набули чинності, необхідно буде перезапустити сервер веб-сервер.\n\n### Стандартні проблеми\n\n-   Якщо скрипти PHP не розбираються веб-сервером, то швидше за все це означає, що PHP не було додано до конфігурації веб-сервера. На Debian це зазвичай /etc/apache2/apache2.conf чи схожий. Зверніться до документації Debian, щоб дізнатися більше.\n-   Модуль, мабуть, встановлений, яке функції все одно не розпізнаються. У такому разі переконайтеся, що відповідний файл ini був завантажений і/або веб-сервер був перезавантажений після встановлення модуля.\n-   Для встановлення пакетів у Debian існують дві основні команди (не рахуючи стандартних варіантів Linux):`apt`и`aptitude`. Пояснення їхнього синтаксису, особливостей та відмінностей один від одного виходить за рамки даного керівництва.\n","title":"Інструкції зі встановлення на Debian GNU/Linux","contentType":2,"navigation":[{"install.unix.solaris.md":"« Інструкції з інсталяції для ОС Solaris"},{"install.macosx.md":"Встановлення на macOS »"},{"index.md":"PHP Manual"},{"install.unix.md":"Встановлення на Unix-системи"}]}},"__N_SSG":true}