{"pageProps":{"page":{"slug":"install.cloud.azure.md","content":"## Azure App Services\n\nPHP часто встановлюється на хмарний сервіс Azure App Services (також відомий як Microsoft Azure, Windows Azure та Azure Web Apps).\n\nAzure App Services керує пулом Windows Web Servers для хостингу ваших веб-застосунків і представляє альтернативу створенню власного веб-сервера на власному Azure Compute VMs та інших платформах.\n\nPHP за промовчанням доступний для вашого веб-сайту в Azure App Services. Просто оберіть на Azure Portal ваш сайт і виберіть потрібну версію PHP. Ви можете вибрати свіжішу версію, ніж за замовчуванням.\n\nТаким чином, PHP та його модулі будуть працювати в Azure App Services так само, як і на будь-якому іншому сервері Windows. Більшість бази знань також портована, дивіться [Windows Troubleshooting Page](install.windows.troubleshooting.md) Тим не менш, інтерфейс керування для Azure App Services має відмінності:\n\n-   Azure portal: создание, настройка и удаление сайтов . [» Azure Portal](https://portal.azure.com/)\n    \n-   Панель Kudu:\\[ім'я вашого сайту\\].azurewebsites.net. Тоді панель Kudu[» https://\\[ім'я вашого сайту\\].scm.azurewebsites.net/](https://your_web_site_name.scm.azurewebsites.net/). Панель Kudu дає вам доступ до деяких можливостей налагодження, керування файлами та модулями сайту. Модулі сайту - це механізм Azure для додавання програм, наприклад прев'ю збірок PHP, на ваш сайт.\n    \n-   Ви не зможете використовувати IIS Manager, Server Manager або RDP.\n    \n\nPHP SDK дозволяє програмно використовувати безліч Azure Services. Дивись [» Azure SDK для PHP](https://github.com/Azure/azure-sdk-for-php)\n\nДля більш детальної інформації, дивись [» Azure PHP Developer Center](https://azure.microsoft.com/en-us/develop/php/)\n\n### WinCache\n\nWinCache за замовчуванням дозволено в Azure App Services і рекомендується його не відключати. Якщо ви встановили свою збірку PHP, ви повинні дозволити WinCache.\n\n### Власні зборки PHP\n\nВи можете завантажити власну збірку PHP у D:\\\\Home (C:\\\\НЕ ДОСТУПЕН для записи). После чего, на Azure Portal, задайте SCRIPT\\_PROCESSOR для .php дорівнює абсолютному шляху до php-cgi.exe з вашої збірки.\n","title":"Azure App Services","contentType":2,"navigation":[{"install.cloud.md":"« Встановлення на платформах Cloud Computing"},{"install.cloud.ec2.md":"Amazon EC2 »"},{"index.md":"PHP Manual"},{"install.cloud.md":"Встановлення на платформах Cloud Computing"}]}},"__N_SSG":true}