{"pageProps":{"page":{"slug":"install.general.md","content":"# Загальні інструкції щодо встановлення\n\nПеред початком установки потрібно знати, для чого ви хочете використовувати PHP. Ви можете використовувати PHP для цілей, описаних у розділі [Що може бути PHP?](intro-whatcando.md)\n\n-   Створювати веб-сайти та веб-застосунки (Скрипти на стороні сервера)\n-   Скрипти командного рядка\n-   GUI-додатки (Додатки з графічним інтерфейсом користувача)\n\nДля першої та найпоширенішої мети вам потрібні три речі: Сам PHP, веб-сервер та веб-браузер. Ймовірно, у вас вже є веб-браузер і, залежно від налаштувань вашої операційної системи, ви також можете мати і веб-сервер (наприклад, Apache у Linux та macOS; IIS у Windows). Також можна орендувати веб-сервер або певний дисковий простір на веб-сервері. В цьому випадку вам не потрібно встановлювати додаткове програмне забезпечення, лише писати PHP-скрипти, завантажувати їх на сервер і переглядати результат роботи в браузері.\n\nУ разі встановлення сервера та PHP самостійно у вас є два варіанти встановлення PHP. Для багатьох PHP серверів може бути встановлений як модуль сервера. Це можливо для таких серверів, як Apache, Microsoft Internet Information Server, Netscape та iPlanet. Якщо PHP не підтримує інтерфейс для сервера, ви завжди можете використовувати його як обробник CGI або FastCGI. Це означає, що ви повинні налаштувати ваш сервер так, щоб він виконував всі файли PHP, як CGI-скрипти.\n\nЯкщо ви також збираєтеся використовувати PHP у командному рядку (для генерації зображень, обробки текстів тощо), вам знадобиться PHP CLI. Докладніше про це можна прочитати у розділі [Використання PHP у командному рядку](features.commandline.md). В цьому випадку вам не знадобляться ні сервер, ні браузер.\n\nВи також можете створювати програми з графічним інтерфейсом, використовуючи модуль PHP-GTK. Це вимагає зовсім іншого підходу, ніж програмування під Інтернет, т.к. ви не виводите HTML або текст, а керуєте вікнами за допомогою PHP. Для отримання більш повної інформації про PHP-GTK [» відвідайте сайт, присвячений цьому модулю](http://gtk.php.net/) . PHP-GTK не включений у стандартне постачання PHP.\n\nПочинаючи з цього моменту ми будемо описувати інсталяцію PHP для веб-серверів на Unix і Windows як модуля сервера і як CGI. Ви також можете знайти інформацію про використання PHP у командному рядку у наступних розділах.\n\nВихідні коди та бінарні збірки для Windows можна отримати тут: [» https://www.php.net/downloads.php](https://www.php.net/downloads.php)\n","title":"Загальні інструкції щодо встановлення","contentType":2,"navigation":[{"install.md":"\" Встановлення та налаштування"},{"install.unix.md":"Установка на Unix-системи »"},{"index.md":"PHP Manual"},{"install.md":"Встановлення та налаштування"}]}},"__N_SSG":true}