{"pageProps":{"page":{"slug":"install.macosx.bundled.md","content":"## Використання вбудованого PHP до macOS Monterey\n\nPHP поставлявся разом з macOS, починаючи з macOS X (10.0.0) до macOS Monterey (12.0.0). Включення PHP до стандартного веб-сервера робиться простим розкоментуванням кількох рядків у конфігураційному файлі Apache httpd.conf у той час як CGI та/або CLI включені за умовчанням (доступні для використання термінальними програмами).\n\nУвімкнення PHP згідно з наведеною нижче інструкцією призначене для швидкого налаштування локального середовища розробки . *Вкрай рекомендується* завжди оновлювати PHP до найновішої стабільної версії. Для будь-якого ПЗ, нові версії випускаються для виправлення помилок і додавання нової функціональності і PHP не є винятком. Читайте відповідну документацію щодо встановлення на macOS, в якій описуються всі подробиці. Наступні інструкції призначені для розробників-початківців і описують стандартну установку, що дозволяє швидко приступити до роботи. Всім користувачам рекомендується скомпілювати або встановити з репозиторію нову версію PHP.\n\nСтандартне встановлення з використанням mod\\_php, який включається для стандартного веб-сервера macOS (за замовчуванням сервер доступний через системні налаштування) включає наступні кроки:\n\n1.  Знайдіть та відкрийте конфігураційний файл Apache. За умовчанням він розташований /private/etc/apache2/httpd.conf Використання`Finder`или`Spotlight`для знаходження файлу може бути не простим, тому що він знаходиться в приватному просторі і належить користувачеві`root`\n    \n    > **Зауваження**: Один з варіантів, як відкрити цей файл - використовувати консольний редактор, наприклад,`nano`запустити його через термінал. Оскільки файл належить користувачеві`root`, для його відкриття буде потрібно використовувати команду`sudo`(яка підвищує привілеї до користувача`root`). Просто запустіть програму`Terminal`, введіть команду`sudo nano /private/etc/apache2/httpd.conf`і, коли буде запрошено пароль, введіть його. Корисні команди nano:`^w`(Шукати),`^o`(зберегти) та`^x`(закрити), де`^`– це клавіша Ctrl.\n    \n    > **Зауваження**: Версії macOS до 10.5 містять застарілі версії PHP та Apache У цьому випадку конфігураційний файл може розташовуватися /etc/httpd/httpd.conf.\n    \n2.  У текстовому редакторі знайдіть наступні рядки і розкоментуйте їх вилучивши символ # з початку рядка (ці рядки зазвичай знаходяться в різних місцях файлу):\n    \n    ```\n    # LoadModule php5_module libexec/httpd/libphp5.so\n    \n    # AddModule mod_php5.c\n    ```\n    \n    Запам'ятайте шлях до файлу, тому що при збиранні PHP в майбутньому може знадобитися змінити ці рядки.\n    \n3.  Переконайтеся, що вибрані модулі будуть оброблятися як PHP-файли (.php .md і .inc).\n    \n    Оскільки наступні вирази вже містяться в httpd.conf (станом на Mac Panther), одного разу увімкнувши PHP, файли .php будуть автоматично оброблятися ним.\n    \n    ```\n    <IfModule mod_php5.c>\n        # Якщо PHP дозволено, він буде обробляти файли .php та .phps.\n        AddType application/x-httpd-php .php\n        AddType application/x-httpd-php-source .phps\n    \n        # Часто потрібно, щоб index.php розглядався як\n        сторінка за замовчуванням, якщо вона прямо не вказана.\n        # Зробити це можна так\n        <IfModule mod_dir.c>\n            DirectoryIndex index.md index.php\n        </IfModule>\n    </IfModule>\n    ```\n    \n    > **Зауваження** :\n    > \n    > До macOS 10.5 (Leopard), до складу ОС був включений PHP 4, а не PHP 5. У такому випадку в інструкціях вище просто поміняйте 5 на 4.\n    \n4.  Переконайтеся, що DirectoryIndex завантажує індексний файл за замовчуванням. Ця поведінка задається в httpd.conf. Зазвичай використовуються index.php та index.md. За замовчуванням index.php дозволено. Якщо потрібно, то вимкніть.\n    \n5.  Визначте місце розташування php.ini або використовуйте налаштування за замовчуванням Зазвичай на macOS він розташований на шляху /usr/local/php/php.ini та виклик[phpinfo()](function.phpinfo.md)виведе відповідну інформацію. Якщо php.ini не використовується, PHP використовуватиме значення за замовчуванням. Також зверніть увагу на FAQ[пошук php.ini](faq.installation.md#faq.installation.phpini)\n    \n6.  Як знайти або встановити`DocumentRoot`DocumentRoot – це коренева директорія веб-сервера, в якій лежать скрипти сайту. Зазвичай шлях за замовчуванням він дорівнює /Library/WebServer/Documents, але його можна змінити на будь-який інший в httpd.conf. Також, для індивідуальних користувачів, DocumentRoot може бути встановлений як /Users/yourusername/Sites\n    \n7.  Створення файлу з[phpinfo()](function.phpinfo.md)\n    \n    Функция[phpinfo()](function.phpinfo.md)відображає інформацію про PHP. Створіть у DocumentRoot скрипт із таким кодом:\n    \n    ```php\n    <?php phpinfo(); ?>\n    ```\n    \n8.  Перезапустіть Apache і запитайте через браузер створений файл.\n    \n    Для перезапуску виконайте`sudo apachectl graceful` у терміналі або виконайте stop/start для \"Personal Web Server\" у системних налаштуваннях macOS. За промовчанням локальні файли можна завантажити, ввівши в рядок браузера URL, наприклад: [http://localhost/info.php](http://localhost/info.php), або використовуючи DocumentRoot в локальній директорії користувача, таким чином:[http://localhost/~yourusername/info.php](http://localhost/~yourusername/info.php)\n    \n\nCLI (або більш старих версіях CGI) називається як php і міститься в /usr/bin/php. Відкрийте термінал, прочитайте розділ документації PHP [командна строка](features.commandline.md), і запустіть `php -v` для перевірки встановленої версії PHP. Виклик функції [phpinfo()](function.phpinfo.md) також покаже цю інформацію.\n","title":"Використання вбудованого PHP до macOS Monterey","contentType":2,"navigation":[{"install.macosx.packages.md":"« Використання пакетів"},{"install.macosx.compile.md":"Компілювання PHP на macOS »"},{"index.md":"PHP Manual"},{"install.macosx.md":"Встановлення на macOS"}]}},"__N_SSG":true}