{"pageProps":{"page":{"slug":"install.pecl.windows.md","content":"## Встановлення PHP-модуля у Windows\n\nІснує два способи завантаження PHP-модуля в Windows (тут йдеться не про завантаження модуля, а про те, щоб PHP застосовував його в роботі): скомпілювати його разом з PHP або завантажити DLL. Завантаження заздалегідь скомпільованого модуля - найпростіший і рекомендований спосіб.\n\nЗавантажити модуль можна, якщо він існує у системі у вигляді .dll файлу. Усі модулі автоматично та періодично компілюються командою PHP (докладніше про завантаження розказано в наступному розділі).\n\nЩоб скомпілювати модуль усередині PHP, зверніться до розділу документації «[Складання з вихідних](install.windows.building.md)».\n\nДля компіляції окремого модуля у вигляді DLL-файлу зверніться до розділу «[Складання з вихідних](install.windows.building.md)». Якщо DLL-файлу немає ні в стандартному постачанні PHP, ні в PECL, можливо, потрібно скомпілювати його, перш ніж можна буде використовувати модуль.\n\n### Де знайти модуль?\n\nPHP-модулям зазвичай надають імена виду php\\_\\*.dll (де зірочка означає ім'я модуля), і вони розміщуються в папці PHP\\\\ext.\n\nPHP поставляється з найбільш корисними для більшості розробників модулями. Такі модулі називаються *що входять до комплекту*(“bundled”).\n\nОднак, якщо модулі, що входять до комплекту, не дають потрібної функціональності, потрібний модуль все ще може бути знайдений на сайті [» PECL](https://pecl.php.net/). Бібліотека модулів спільноти PHP (The PHP Extension Community Library, PECL) — це сховище модулів PHP, в якому розташований каталог всіх відомих модулів, і обладнання, яке дає місце для зберігання PHP-модулів, що скачуються і розробляються.\n\nРозроблений для окремих цілей модуль можна завантажити в бібліотеку PECL, щоб інші люди, яким він може бути потрібен, могли отримати з нього користь. Непоганим побічним наслідком цього буде гарна ймовірність отримати відгуки, подяки (сподіваємося, що так і буде), повідомлення про помилки і навіть виправлення/патчі. Будь ласка, прочитайте [»¦публікацію PECL](https://pecl.php.net/package-new.php)перед отправкой модуля в PECL.\n\n### Який модуль потрібно завантажити?\n\n*Часто буде доступно кілька версій кожного модуля DLL:*\n\n-   Різні номери версій (принаймні перші дві цифри мають збігатися)\n-   Різні налаштування потокобезпеки\n-   Різна архітектура процесора (x86, x64, ...)\n-   Різні налаштування налагодження\n-   `і т.д.`\n\nПам'ятайте, що параметри модулів повинні збігатися з усіма параметрами бінарного файлу PHP. Наступний PHP-скрипт виведе *Усе* налаштування PHP:\n\n**Приклад #1 Виклик функції [phpinfo()](function.phpinfo.md)**\n\n```php\n<?php\nphpinfo();\n?>\n```\n\nАбо запустіть з командного рядка:\n\n```\ndrive:\\path\\to\\php\\executable\\php.exe -i\n```\n\n### Завантаження модуля\n\nНайпоширеніший спосіб завантажити PHP-модуль - включити його в конфігураційному файлі php.ini. Зверніть увагу, що більшість модулів вже прописана у файлі php.ini, і для їх активації потрібно просто видалити крапку з комою.\n\nЗверніть увагу, починаючи з PHP 7.2.0, замість імені файлу модуля можна вказувати назву модуля. Такий спосіб стає рекомендованим для визначення, які модулі будуть завантажені, тому що він найлегший і платформонезалежний. Підтримка імен файлів зберігається для сумісності з попередніми версіями.\n\n```\n;extension=php_extname.dll\n```\n\n```\nextension=php_extname.dll\n```\n\n```\n; Начиная с PHP 7.2 лучше делать так:\nextension=extname\nzend_extension=another_extension\n```\n\nОднак деякі веб-сервери створюють плутанину, тому що вони не використовують файл php.ini, розташований у дистрибутиві PHP. Шлях розташування файлу php.ini вказаний у виводі функції [phpinfo()](function.phpinfo.md) :\n\n```\nConfiguration File (php.ini) Path  C:\\WINDOWS\n```\n\n```\nLoaded Configuration File   C:\\Program Files\\PHP\\8.2\\php.ini\n```\n\nПісля активації модуля збережіть php.ini, перезавантажте веб-сервер і знову перевірте виведення функції [phpinfo()](function.phpinfo.md). Для нового модуля з'явиться окремий розділ.\n\n### Вирішення проблем\n\nЯкщо модуль не з'явився у виводі функції [phpinfo()](function.phpinfo.md), необхідно перевірити лог-файли, щоб дізнатися, звідки береться проблема.\n\nПри роботі з PHP з командного рядка (CLI) помилки завантаження повідомлення про помилку завантаження модуля можна буде прочитати на екрані.\n\nРозташування та формат лог-файлів під час роботи PHP на веб-сервері залежить від програмного забезпечення. Будь ласка, зверніться до документації веб-сервера, щоб дізнатися розташування лог-файлів, оскільки їхнє розташування не залежить від PHP.\n\nЧасті проблеми - це розташування модуля DLL і DLL-файлів, від яких він залежить, значення директиви.[extension\\_dir](ini.core.md#ini.extension-dir)у файлі php.ini, а також розбіжність налаштувань компіляції.\n\nЯкщо проблема лежить у незбігу налаштувань компіляції, то, можливо, завантажено неправильний DLL-файл. Потрібно спробувати завантажити модуль знову із правильними налаштуваннями. Ще раз, інформація функції [phpinfo()](function.phpinfo.md) може суттєво допомогти.\n","title":"Встановлення PHP-модуля у Windows","contentType":2,"navigation":[{"install.pecl.downloads.md":"« Завантаження модулів PECL"},{"install.pecl.pear.md":"Компіляція модулів, що розділяються за допомогою команди pecl »"},{"index.md":"PHP Manual"},{"install.pecl.md":"Встановлення модулів PECL"}]}},"__N_SSG":true}