{"pageProps":{"page":{"slug":"intro.seaslog.md","content":"# Вступ\n\nSeaslog – це ефективний, швидкий та стабільний модуль ведення журналу для PHP.\n\nЖурнал, який зазвичай є запис роботи системи, програмного забезпечення та програми. Аналіз журналу може допомогти користувачам зрозуміти роботу системи, програмного забезпечення та ситуацію з програмами. Якщо журнал вашої програми досить великий, модуль також може аналізувати поведінку, тип, регіональний розподіл та іншу додаткову інформацію під час попереднього використання. Журнал програм також вказує на кілька рівнів одночасно, ви можете легко отримати аналіз стану працездатності програми, своєчасно знайти проблеми та швидко визначити місцезнаходження, а також вирішити проблему, виправити помилку.\n\nФункція syslog error\\_log, вбудована в PHP, є потужною та високопродуктивною, але через різні дефекти (у error\\_log немає рівня помилок, немає фіксованого формату, syslog незалежно від модуля і змішується із системним журналом), що знижує гнучкість і не може відповідати вимогам програми.\n\nХорошою новиною є те, що існує ряд сторонніх бібліотек класів журналів, створених для усунення дефектів, таких як log4php, plog, monolog (звичайно, для ведення журналу є багато додатків).\n\nОтже, чи існують бібліотеки для ведення журналу, які відповідають таким вимогам:\n\n-   Модулі, класифікація\n-   Проста конфігурація (бажано без конфігурації)\n-   Чіткий формат журналу та простота розуміння\n-   Просте додаток та хороша продуктивність\n\nSeaslog відповідає всім цим вимогам.\n\nЩо передбачено нині:\n\n-   У PHP-проекті швидко записує специфікацію журналу\n-   Налаштовується каталог та модуль журналу за промовчанням\n-   Налаштовується каталог журналу та поточна конфігурація запису\n-   Попередній аналіз системи раннього попередження\n-   Ефективний буфер журналу та зручне налагодження буфера\n-   Потрібно специфікації інтерфейсу журналу PSR-3\n-   Автоматично записує інформацію про помилки\n-   Автоматично записує ненормальну інформацію\n-   Підтримує підключення до TCP-порту, відправлення з RFC5424\n-   Підтримує підключення порту UDP, відправлення з RFC5424\n-   Підтримує диференційовані запити за допомогою RequestId\n-   Підтримує налаштування шаблонів журналу\n\nПодробнее в[» документації SeasLog](https://seasx.github.io/SeasLog/)на GitHub.\n","title":"Вступ","contentType":2,"navigation":[{"book.seaslog.md":"« Seaslog"},{"seaslog.setup.md":"Встановлення та налаштування \""},{"index.md":"PHP Manual"},{"book.seaslog.md":"Seaslog"}]}},"__N_SSG":true}