{"pageProps":{"page":{"slug":"intro-whatis.md","content":"## Що таке PHP?\n\nPHP (рекурсивний акронім словосполучення `PHP: Hypertext Preprocessor`) – це поширена мова програмування загального призначення з відкритим вихідним кодом. PHP спеціально сконструйований для веб-розробок, і його код може впроваджуватися безпосередньо в HTML.\n\nПроста відповідь, але що вона може означати? Ось приклад коду:\n\n**Приклад #1 Приклад програмування на PHP**\n\n```php\n<!DOCTYPE html>\n<html>\n    <head>\n        <title>Приклад</title>\n    </head>\n    <body>\n\n        <?php\n        echo \"Привет, я - скрипт PHP!\";\n        ?>\n\n    </body>\n</html>\n```\n\nЗамість рутинного виведення HTML-коду командами мови (як це відбувається, наприклад, Perl або C), скрипт PHP містить HTML з вбудованим кодом (у нашому випадку, це виведення тексту \"Привіт, я - скрипт PHP!\"). Код PHP відокремлюється спеціальними [початковим та кінцевим тегами `<?php`и`?>`](language.basic-syntax.phpmode.md), які дозволяють \"перемикатися\" на \"PHP-режим\" і виходити з нього.\n\nPHP відрізняється від JavaScript тим, що PHP-скрипти виконуються на сервері та генерують HTML, який надсилається клієнту. Якби у вас на сервері був розміщений скрипт, подібний до вищенаведеного, клієнт отримав би тільки результат його виконання, але не зміг би з'ясувати, який саме код його зробив. Ви навіть можете налаштувати свій сервер таким чином, щоб звичайні HTML-файли оброблялися процесором PHP, тому клієнти навіть не зможуть дізнатися, чи отримують вони звичайний HTML-файл або результат виконання скрипту.\n\nPHP вкрай простий для освоєння, але водночас здатний задовольнити запити професійних програмістів. Не лякайтеся довгого списку можливостей PHP. Ви можете швидко розпочати, і вже протягом кількох годин зможете створювати прості PHP-скрипти.\n\nХоча PHP, головним чином, призначений для роботи в середовищі веб-серверів, сфера його застосування не обмежується тільки цим. Читайте далі і не пропустіть розділ [Можливості PHP](intro-whatcando.md) либо, начните непосредственно с[Вступного керівництва](tutorial.md)Якщо вас цікавить виключно веб-програмування.\n","title":"Що таке PHP?","contentType":2,"navigation":[{"introduction.md":"\" Вступ"},{"intro-whatcando.md":"Можливості PHP »"},{"index.md":"PHP Manual"},{"introduction.md":"Вступ"}]}},"__N_SSG":true}