{"pageProps":{"page":{"slug":"intro.phar.md","content":"# Вступ\n\nМодуль phar надає можливість помістити цілий PHP-додаток в один-єдиний файл з ім'ям phar (PHP Archive) для простого поширення та встановлення. Крім цього, модуль phar надає метод абстракції формату файлу для створення та обробки архівів tar та zip через клас [PharData](class.phardata.md), приблизно як PDO забезпечує єдиний інтерфейс доступу до різних баз даних. На відміну від PDO, який не може конвертувати між різними базами даних, Phar може конвертувати дані між форматами tar, zip та phar лише одним рядком коду. Дивіться [Phar::convertToExecutable()](phar.converttoexecutable.md)для Приклада.\n\nЩо таке phar? Phar-архіви найкраще можна охарактеризувати як зручний спосіб угруповання кількох файлів на один. Також phar архів надає можливість розповсюджувати цілий PHP-додаток в одному єдиному файлі та запускати його прямо з цього файлу без необхідності розпаковувати його на диск. Крім того, phar-архіви можуть виконуватися PHP з тією ж легкістю, що будь-які інші файли, як з командного рядка, так і через веб-сервер. Phar - це як флеш-накопичувач для PHP-додатків.\n\nPhar реалізує цю функціональність через [потоки](book.stream.md). Зазвичай, щоб використовувати в PHP-скрипті зовнішній файл, ви б скористалися, наприклад, [include](function.include.md) :\n\n**Приклад #1 Використання зовнішнього файлу**\n\n```php\n<?php\n include '/path/to/external/file.php';\n ?>\n```\n\nPHP може розглядати це як перетворення `/path/to/external/file.php` в обгортку потоку `file:///path/to/external/file.php`, а насправді він використовує потокові функції обгортки простого файлового потоку для доступу до всіх локальних файлів.\n\nЩоб використовувати файл `file.php`, що знаходиться всередині phar-архіву `/path/to/myphar.phar`, используется синтаксис очень похожий на синтаксис`file://` вище.\n\n**Приклад #2 Використання файлу всередині phar-архіву**\n\n```php\n<?php\n include 'phar:///path/to/myphar.phar/file.php';\n ?>\n```\n\nНасправді, можна розглядати phar-архів як би це був зовнішній диск, використовуючи будь-які [fopen()](function.fopen.md)\\-подібні функції, [opendir()](function.opendir.md) і [mkdir()](function.mkdir.md)\\-подібні функції для читання, зміни або створення нових файлів і директорій всередині phar-архіву. Це дозволяє цілому PHP-програмі поширюватися в одному файлі і запускатися прямо з цього файлу.\n\nНайчастіше використовуване застосування для phar-архіву - це поширення цілої програми в одному файлі. Наприклад, установник PEAR, який постачається разом із PHP, є phar-архівом. Для використання phar-архіву, що розповсюджується таким способом, архів може бути виконаний через консоль або через веб-сервер.\n\nPhar-архіви можуть поширюватися як архіви `tar`и`zip`, або як формат користувача файлу `phar`призначений спеціально для модуля phar. Кожен формат файлу має як переваги, і недоліки. Формати tar і zip можуть бути прочитані або витягнуті будь-якою сторонньою утилітою, яка може працювати з цими форматами. Але щоб PHP міг їх запускати, йому буде потрібний модуль phar. Файли в phar-форматі налаштовуються та унікальні для модуля phar, і можуть бути створені лише ним або PEAR-пакетом [» PHP\\_Archive](https://pear.php.net/package/PHP_Archive). Але їхня перевага в тому, що програми, створені в цьому форматі, працюватимуть, навіть якщо модуль phar не включений.\n\nІншими словами, навіть якщо модуль phar відключено, phar-архів все одно може бути виконаний або підключений. Доступ до окремих файлів в архіві можливий тільки з модулем phar, якщо архів не був створений за допомогою PHP\\_Archive.\n\nМодуль phar також здатний конвертувати phar-архів з tar в zip або в phar-формат однією командою:\n\n**Приклад #3 Конвертування phar-архіву з формату phar у формат tar**\n\n```php\n<?php\n $phar = new Phar('myphar.phar');\n $pgz = $phar->convertToExecutable(Phar::TAR, Phar::GZ); // создаст myphar.phar.tar.gz\n ?>\n```\n\nPhar може стискати окремі файли або архів повністю з використанням [gzip](book.zlib.md)\\-компресії або [bzip2](book.bzip2.md)\\-компресії, а також автоматично перевіряти цілісність архіву, використовуючи сигнатури MD5, SHA-1, SHA-256 або SHA-512.\n\nНарешті, модуль Phar дбає про вашу безпеку та відключає доступ на запис для виконуваних phar-архівів за замовчуванням, а також вимагає відключення на системному рівні налаштування `phar.readonly` у php.ini для створення чи зміни phar-архівів. Звичайні архіви tar і zip, що не виконуються, завжди можуть бути створені або змінені за допомогою класу [PharData](class.phardata.md)\n\nЯкщо ви створюєте програму з метою поширення, ви, можливо, захочете прочитати розділ [Як створювати Phar-архіви](phar.creating.md). Якщо вам потрібно більше інформації про відмінності між трьома підтримуваними форматами файлів phar, вам слід прочитати розділ [Phar, Tar та Zip](phar.fileformat.md)\n\nЯкщо ви використовуєте phar-додаток, то корисні поради знаходяться у розділі [Як використовувати phar-архіви](phar.using.md)\n\nСлово`phar` - це скорочення від `PHP`и`Archive`, і воно частково засноване на `jar` (Java Archive), знайомий Java-розробникам.\n\nРеализация Phar-архивов основана на PEAR-пакете[» PHP\\_Archive](https://pear.php.net/package/PHP_Archive), і деталі реалізації схожі, хоча модуль Phar набагато потужніший. Крім того, модуль Phar дозволяє більшості PHP-програм запускатися без змін, тоді як phar-архіви, засновані на PHP\\_Archive часто вимагають істотних змін для роботи.\n","title":"Вступ","contentType":2,"navigation":[{"book.phar.md":"« Phar"},{"phar.setup.md":"Встановлення та налаштування \""},{"index.md":"PHP Manual"},{"book.phar.md":"Phar"}]}},"__N_SSG":true}