{"pageProps":{"page":{"slug":"intro.intl.md","content":"# Вступ\n\nМодуль інтернаціоналізації (далі Intl) - це обгортка для бібліотеки [» ICU](https://icu.unicode.org/), що дозволяє програмістам на PHP проводити різні операції, які залежать від локалі, наприклад, форматування, транслітерація, перетворення кодувань, операції з календарем, сумісне з [» UCA](https://www.unicode.org/reports/tr10/) порівняння, визначення меж тексту та працювати з ідентифікаторами локалів, часовими поясами та графемами.\n\nПрограмний інтерфейс модуля розробляється так, щоб якомога точніше повторювати API ICU, щоб люди, які працювали з ICE C/C++ або Java, могли легко використовувати API PHP. Також завдяки цьому документація ICE може бути корисною, щоб зрозуміти різницю функції ICU.\n\nIntl складається з кількох модулів, кожен із яких надає відповідний API ICU:\n\n-   Модуль порівняння: надає інструменти для порівняння рядків із підтримкою відповідного локалі порядку сортування.\n-   Модуль форматування чисел: дозволяє відображати числа відповідно до правил локалі, або заданого шаблону або набору правил. Також дозволяє правильно розбирати рядки у числа.\n-   Модуль форматування повідомлень: дозволяє створювати повідомлення, що включають дані (такі як числа та дати), відформатовані відповідно до заданих шаблонів та локальних правил, і, також, розбирати повідомлення, витягуючи з них дані.\n-   Модуль нормалізації: надає функції для перетворення тексту на одну з нормалізованих форм Unicode. Також надає можливість перевірити, чи наданий текст вже нормалізований.\n-   Модуль локалі: надає взаємодію з ідентифікаторами локалі як до функцій, дозволяючи отримати вкладені теги локалі; розбір, композиція, порівняння (пошук та фільтрація) ідентифікаторів локалі.\n-   Модуль календаря: надає клас, корисний для проведення залежних від локалі операцій з календарем, отримання різної інформації, такої як часові пояси для обраної локалі, перший день тижня або режим поточного зимового/літнього часу.\n-   Модуль часового поясу: надає обгортку над[» базою даних часових поясів](https://www.iana.org/time-zones), в якій міститься вичерпна інформація про всі світові часові пояси.\n-   Модуль форматування дати: дозволяє відображати дату відповідно до прийнятого для цієї локалі формату або заданого шаблону або набору правил. Також необхідний для розбору рядків, що містять опис дати та часу.\n-   Модуль транслітерації: дозволяє отримати уявлення рядка різними мовами в латиниці.\n\n## Посилання\n\n-   [» Різна документація ICU](https://icu.unicode.org/docs/)\n    \n-   [» Посібник користувача ICU](https://unicode-org.github.io/icu/userguide/)\n    \n-   [» Алгоритм зіставлення Unicode](https://www.unicode.org/reports/tr10/)\n","title":"Вступ","contentType":2,"navigation":[{"book.intl.md":"« intl"},{"intl.setup.md":"Встановлення та налаштування \""},{"index.md":"PHP Manual"},{"book.intl.md":"intl"}]}},"__N_SSG":true}