{"pageProps":{"page":{"slug":"intro.sem.md","content":"# Вступ\n\nМодулі забезпечують підтримку сімейства функцій міжпроцесної взаємодії System V. Сюди входять семафори, пам'ять, що розділяється, і обмін повідомленнями між процесами (IPC).\n\nСемафори можуть використовуватися для отримання ексклюзивного доступу до ресурсів локальної машини або для обмеження кількості процесів, які одночасно використовують ресурс.\n\nТакож цей модуль підтримує функції для роботи з пам'яттю System V, що розділяється. Розділювана пам'ять може бути використана для надання доступу до глобальних змінних. Різні httpd-демони і навіть інші програми (написані на Perl, C і т.д.) можуть отримати доступ до цих даних для здійснення глобального обміну даними. Пам'ятайте, що пам'ять, що розділяється НЕ ЗАХИЩЕНА від одночасного доступу. Використовуйте семафори для синхронізації.\n\n<table class=\"doctable table\"><caption><strong>Ліміти, накладені на пам'ять, що розділяється в Unix OS</strong></caption><tbody class=\"tbody\"><tr><td>SHMMAX</td><td>максимальний розмір пам'яті, що розділяється, зазвичай 131072 байт</td></tr><tr><td>SHMMIN</td><td>мінімальний розмір пам'яті, що розділяється, зазвичай 1 байт</td></tr><tr><td>SHMMNI</td><td>максимальна кількість сегментів пам'яті, що розділяється в системі, зазвичай 100</td></tr><tr><td>SHMSEG</td><td>максимальна кількість сегментів розділяється пам'яті на процес, зазвичай 6</td></tr></tbody></table>\n\nФункції обміну повідомленнями можна використовувати для надсилання та отримання повідомлень в/з іншого процесу. Вони забезпечують простий та ефективний засіб обміну даними між процесами без необхідності створення UNIX-сокетів.\n\n> **Зауваження**: У Windows доступні лише функції пам'яті, що розділяється. [ftok()](function.ftok.md). На цій платформі не підтримуються ні семафори, ні функції обміну повідомленнями між процесами.\n","title":"Вступ","contentType":2,"navigation":[{"book.sem.md":"« Семафори"},{"sem.setup.md":"Встановлення та налаштування \""},{"index.md":"PHP Manual"},{"book.sem.md":"Семафори"}]}},"__N_SSG":true}