{"pageProps":{"page":{"slug":"intro.ldap.md","content":"# Вступ\n\nLDAP - це полегшений протокол доступу до каталогів, який використовується для отримання доступу до серверів каталогів. Каталог – спеціальний вид бази даних, що містить інформацію у деревоподібній структурі.\n\nКонцепція схожа на структуру каталогів на жорсткому диску, за винятком того, що в цьому контексті кореневий каталог - це \"Світ\" і перший рівень підкаталогів - \"Країни\". Нижчі рівні структури каталогів містять записи для компаній, організацій або місць, тоді як ще нижче ми знаходимо записи каталогу для людей, і можливо обладнання або документів.\n\nДля звернення до файлу в підкаталозі на жорсткому диску, ви могли б використовувати щось на кшталт цього:\n\n/usr/local/myapp/docs\n\nСлєш зазначає кожен підрозділ на засланні, і послідовність читається зліва направо.\n\nЕквівалентом повністю певного посилання на файл у LDAP є так зване відмінне ім'я, згадане просто як \"dn\". Наприклад, dn може бути таким:\n\ncn=John Smith,ou=Accounts,o=My Company,c=US\n\nКома відзначає кожен підрозділ у засланні, і послідовність читається праворуч наліво. Ви читали б цей dn як:\n\nСтрана (country) = US Организация (organization) = My Company Подразделение (organizationalUnit) = Accounts Имя (commonName) = John Smith\n\nТаким чином, як немає жорстких правил для організації структури каталогів жорсткого диска, так і менеджер сервера каталогів може налаштувати будь-яку структуру, яка є значущою для поставленої мети. Однак, є деякі угоди, які використовуються.\n\nБагато інформації про LDAP можна знайти на\n\n-   [» Mozilla](https://wiki.mozilla.org/Directory)\n    \n-   [» OpenLDAP Project](http://www.openldap.org/)\n    \n-   Internet Engineering Taskforce RFCs з[» 4510](http://www.faqs.org/rfcs/rfcrfc4510)по[» 4519](http://www.faqs.org/rfcs/rfcrfc4519)\n    \n\nNetscape SDK содержит полезное[» Керівництво програміста](https://wiki.mozilla.org/Mozilla_LDAP_SDK_Programmer%27s_Guide)в HTML формате.\n","title":"Вступ","contentType":2,"navigation":[{"book.ldap.md":"« LDAP"},{"ldap.setup.md":"Встановлення та налаштування \""},{"index.md":"PHP Manual"},{"book.ldap.md":"LDAP"}]}},"__N_SSG":true}