{"pageProps":{"page":{"slug":"intro.stream.md","content":"# Вступ\n\nПотоки були введені як інструмент для роботи з файлами, мережного обміну, стиснення даних та виконання інших операцій за допомогою одного загального набору функцій. Висловлюючись простими поняттями, потік (`stream`) - це ресурс (resource), який веде себе як джерело безперервної послідовності даних. Це означає, що з потоку можна послідовно читати дані, так само як і записувати до нього. Також можна переміщатися ([fseek()](function.fseek.md)) у різні позиції всередині потоку.\n\nОбгортка (`wrapper`) - додатковий код, який пояснює потоку особливості роботи зі специфічними протоколами чи кодуваннями. Наприклад, обгортка `http` знає, як перетворити URL на `HTTP/1.0`\\-запит для файлу на віддаленому сервері. Існує безліч обгорток, як вбудованих в PHP спочатку (дивіться [Підтримувані протоколи та обгортки](wrappers.md)), і додаткових. Додаткові обгортки можна додавати окремим скриптом за допомогою функції [stream\\_wrapper\\_register()](function.stream-wrapper-register.md). Додавати можна довільну кількість обгорток, що робить можливість роботи з потоками практично безмежними. Переглянути список зареєстрованих на даний момент обгорток можна за допомогою функції [stream\\_get\\_wrappers()](function.stream-get-wrappers.md)\n\nПосилання на потік записується у такому вигляді: `scheme`://`target`\n\n-   `scheme`(Рядок) - Назва обгортки. Наприклад, file, http, https, ftp, ftps, compress.zlib, compress.bz2, php. Список вбудованих обгорток можна переглянути тут[Підтримувані протоколи та обгортки](wrappers.md). Якщо назва обгортки не вказана, кожна функція, що працює з потоком, використовує стандартну обгортку (зазвичай це`file`://).\n-   `target`\\- Залежить від того, яка обгортка використовується. Для потоків, пов'язаних із файловою системою це зазвичай шлях та ім'я файлу. Для мережевих потоків це, зазвичай, ім'я хоста (часто з додаванням до нього шляху). Опис цілей для вбудованих обгорток наведено в[Підтримувані протоколи та обгортки](wrappers.md)\n","title":"Вступ","contentType":2,"navigation":[{"book.stream.md":"« Потоки"},{"stream.setup.md":"Встановлення та налаштування \""},{"index.md":"PHP Manual"},{"book.stream.md":"Потоки"}]}},"__N_SSG":true}