{"pageProps":{"page":{"slug":"intro.image.md","content":"# Вступ\n\nPHP не обмежений створенням лише HTML сторінок. Він також дозволяє створювати та працювати з файлами зображень у різних форматах включаючи GIF, PNG, JPEG, WBMP, та XPM. Що зручніше, PHP дозволяє виводити зображення у потоці безпосередньо у браузер. Для цього необхідно скомпілювати PHP з графічною бібліотекою GD, що містить функції для роботи із зображеннями. Для роботи з GD можуть знадобитися інші бібліотеки (залежно від формату зображень, з якими виникла потреба працювати).\n\nІснує стандартна функція PHP для отримання розміру зображення таких форматів зображень: JPEG, GIF, PNG, SWF, TIFF та JPEG2000.\n\nС[модулем EXIF](ref.exif.md) доступна робота з інформацією, що зберігається у заголовках JPEG та TIFF зображень. Таким чином, можна читати мета-дані, згенеровані цифровими фотоапаратами. Модуль EXIF ​​не потрібний бібліотеці GD.\n\n> **Зауваження**: Прочитайте розділ вимог, щоб дізнатися, як розширити можливості читання, запису та модифікації зображень. Щоб мати можливість читати мета-дані зображень, взятих із цифрових фотоапаратів потрібно, вже згаданий [модуль EXIF](ref.exif.md)\n\n> **Зауваження**: Функция[getimagesize()](function.getimagesize.md) не потребує наявності бібліотеки GD.\n\n**Застереження**\n\nТогда как поставляемая с PHP библиотека GD использует менеджер памяти Zend, то системная нет. Соответственно ограничение[memory\\_limit](ini.core.md#ini.memory-limit) не працює.\n\nGD підтримує низку форматів. Нижче наведено список цих форматів та позначки про доступність, включаючи підтримку читання та запису.\n\n**Формати, що підтримуються GD**\n\n| Формат | Поддержка чтения | Поддержка записи | Примечания |\n| --- | --- | --- | --- |\n| JPEG | **`true`** | **`true`** |  |\n| PNG | **`true`** | **`true`** |  |\n| GIF | **`true`** | **`true`** |  |\n| XBM | **`true`** | **`true`** |  |\n| XPM | **`true`** | **`false`** |  |\n| WBMP | **`true`** | **`true`** |  |\n| WebP | **`true`** | **`true`** |  |\n| BMP | **`true`** | **`true`** | Доступно, починаючи з PHP 7.2.0 |\n\nНезважаючи на те, що більшість форматів у наведеній таблиці доступні для читання та запису, це не означає, що PHP був зібраний з їхньою підтримкою. Щоб дізнатися, які формати були включені для GD під час складання, використовуйте функцію [gd\\_info()](function.gd-info.md)Для дополнительной информации смотрите раздел об установке.\n","title":"Вступ","contentType":2,"navigation":[{"book.image.md":"« GD"},{"image.setup.md":"Встановлення та налаштування \""},{"index.md":"PHP Manual"},{"book.image.md":"GD"}]}},"__N_SSG":true}