{"pageProps":{"page":{"slug":"intro.session.md","content":"# Вступ\n\nПідтримка сесій у PHP полягає у збереженні набору даних між послідовними доступами.\n\nКожному відвідувачу сайту надається унікальний ідентифікатор, який називається ідентифікатором сесії (session id). Він зберігається або в cookie на стороні користувача, або передається через URL-адресу.\n\nПідтримка сесій допомагає зберігати дані між запитами у суперглобальному масиві. [$\\_SESSION](reserved.variables.session.md). Коли відвідувач заходить на сайт, PHP автоматично (якщо для директиви [session.auto\\_start](session.configuration.md#ini.session.auto-start) встановлено значення 1) або на запит (явним чином через виклик функції [session\\_start()](function.session-start.md)) перевіряє, чи був конкретний ідентифікатор сесії відправлений разом із запитом. Якщо так, відновлюється збережене раніше оточення.\n\n**Застереження**\n\nЯкщо директива [session.auto\\_start](session.configuration.md#ini.session.auto-start) включена, то єдиний спосіб помістити об'єкти в сесію - це завантажити визначення класу цього об'єкта черер директиву [auto\\_prepend\\_file](ini.core.md#ini.auto-prepend-file), інакше доведеться виконати серіалізацію (функцією [serialize()](function.serialize.md)) та десеріалізацію (функцією [unserialize()](function.unserialize.md)) об'єкта вручну.\n\nСуперглобальная переменная[$\\_SESSION](reserved.variables.session.md) (і всі зареєстровані змінні) серіалізуються всередині PHP після виконання запиту, використовуючи обробник серіалізації, заданий в INI-опції [session.serialize\\_handler](session.configuration.md#ini.session.serialize-handler). Зареєстровані, але невизначені змінні позначаються як невизначені. При повторному доступі вони не будуть визначені сесійним модулем, якщо користувач знову не визначить їх.\n\n**Увага**\n\nОскільки сесійні дані серіалізуються, змінні з типом ресурсів не можуть зберігатися в сесіях.\n\nОбробники серіалізації (`php`и`php_binary`) успадковують обмеження директиви register\\_Globals. Тому не можна використовувати числові чи рядкові індекси, що містять спеціальні символи ( и`!`). Вони призведуть до помилок під час завершення роботи скрипта. У оброблювача `php_serialize`такие ограничения отсутствуют.\n\n> **Зауваження** :\n> \n> Зауважте, при роботі з сесіями запис у сесії не створюється доти, доки змінна не буде зареєстрована в суперглобальному масиві [$\\_SESSION](reserved.variables.session.md). Це правило застосовуватиметься незалежно від того, чи запускалася сесія функцією [session\\_start()](function.session-start.md)\n","title":"Вступ","contentType":2,"navigation":[{"book.session.md":"« Сесії"},{"session.setup.md":"Встановлення та налаштування \""},{"index.md":"PHP Manual"},{"book.session.md":"Сесії"}]}},"__N_SSG":true}