{"pageProps":{"page":{"slug":"intro.com.md","content":"# Вступ\n\nCOM (акроним от`Component Object Model`) — це об'єктно-орієнтований шар (і пов'язані з ним сервіси), що базується на DCE RPC (відкритий стандарт), який визначає загальні угоди, що дозволяють коду, написаному будь-якою мовою викликати та взаємодіяти з кодом, написаним будь-якою іншою мовою (за умови , що ці мови є COM-орієнтованими). Не тільки код може бути написаний будь-якою мовою, але навіть немає необхідності, щоб він був частиною одного і того ж виконуваного файлу: код може бути завантажений з бібліотеки DLL, може бути знайдений в іншому процесі на тому самому комп'ютері або, за допомогою DCOM (Distributed COM) може бути знайдений в іншому процесі на віддаленій машині, і все це без необхідності вашому коду знати де знаходиться компонент.\n\nПідмножина COM, відома як OLE Automation, включає набір COM-інтерфейсів, які дозволяють здійснювати легке зв'язування COM-об'єктів, також будь-який об'єкт можна проаналізувати та викликати під час роботи без знання деталей його роботи на етапі компіляції. PHP-модуль COM використовує інтерфейси OLE Automation, які дозволяють створювати та викликати сумісні об'єкти з ваших скриптів. Говорячи технічною мовою, це слід назвати «`Модуль OLE Automation для PHP`», оскільки не всі COM-об'єкти є OLE-сумісними.\n\nТепер, чому ви повинні використовувати COM? COM - один з основних способів склеїти разом програми та компоненти на платформі Windows. Використовуючи COM, ви можете запустити Microsoft Word, заповнити шаблон документа та зберегти результати як документ Word, а потім відправити відвідувачу вашого веб-сайту. Ви також можете використовувати COM для виконання завдань адміністрування для вашої мережі та конфігурування вашого IIS-сервера. Це тільки звичайне застосування, з COM ви зможете більше.\n\nДодатково модуль підтримує створення екземпляра класу та створення .NET-складання, використовуючи шар взаємодії з COM, що надається Microsoft.\n","title":"Вступ","contentType":2,"navigation":[{"book.com.md":"« COM"},{"com.setup.md":"Встановлення та налаштування \""},{"index.md":"PHP Manual"},{"book.com.md":"COM"}]}},"__N_SSG":true}