{"pageProps":{"page":{"slug":"language.basic-syntax.phpmode.md","content":"## Ізолювання від HTML\n\nВсе, що знаходиться поза парою тегів, що відкривається і закривається, ігнорується інтерпретатором PHP, у якого є можливість обробляти файли зі змішаним вмістом. Це дозволяє PHP-коду бути вбудованим у документи HTML, наприклад, для створення шаблонів.\n\n```php\n<p>Это будет проигнорировано PHP и отображено браузером.</p>\n<?php echo 'А это будет обработано.'; ?>\n<p>Это тоже будет проигнорировано PHP и отображено браузером.</p>\n```\n\nЦе працює так, як і очікується, тому що коли інтерпретатор PHP зустрічає теги, що закривають ?>, він просто починає виводити все що знайде (за винятком відразу наступного символу перекладу рядка - дивіться розділ [поділ інструкцій](language.basic-syntax.instruction-separation.md)) поки не зустріне інший відкриваючий тег за винятком випадку з умовним оператором, що міститься всередині коду, в якому інтерпретатор визначає результат умови перед прийняттям рішення що пропустити. Ознайомтеся з наведеним нижче прикладом.\n\nВикористання структур з умовами\n\n**Приклад #1 Просунуте ізольування з використанням умов**\n\n```php\n<?php if ($expression == true): ?>\n  Это будет отображено, если выражение истинно.\n<?php else: ?>\n  В ином случае будет отображено это.\n<?php endif; ?>\n```\n\nУ цьому прикладі PHP пропускає блоки, де умова не дотримується. Навіть незважаючи на те, що вони знаходяться поза парою тегів, що відкривають/закривають, PHP пропустить їх відповідно до умови, оскільки інтерпретатор PHP буде перестрибувати через блоки, що містяться всередині умови, яке не дотримується.\n\nПри виведенні великих блоків тексту вихід з режиму синтаксичного аналізу PHP зазвичай ефективніший, ніж надсилання тексту за допомогою функцій [echo](function.echo.md) або [print](function.print.md)\n\n> **Зауваження** :\n> \n> Крім того, якщо ви маєте намір вставляти PHP-код у XML або XHTML, щоб відповідати стандартам XML, вам слід використовувати форму\n","title":"Ізолювання від HTML","contentType":2,"navigation":[{"language.basic-syntax.phptags.md":"« Теги PHP"},{"language.basic-syntax.instruction-separation.md":"Поділ інструкцій »"},{"index.md":"PHP Manual"},{"language.basic-syntax.md":"Основи синтаксису"}]}},"__N_SSG":true}