{"pageProps":{"page":{"slug":"language.errors.basics.md","content":"## Основи\n\nPHP повідомляє про помилки у відповідь на деякі внутрішні помилкові обставини. Вони можуть бути використані для сповіщення про різні стани, а також можуть виводитися на екран і записуватися в логі за бажанням.\n\nКожна помилка, що генерується PHP, обов'язково містить інформацію про свій тип . [У цьому списку](errorfunc.constants.md) перераховані всі типи помилок, а також описи їх поведінок і причини, що їх провокують.\n\n### Обробка помилок\n\nPHP, за умовчанням, може обробляти будь-які помилки відповідно до своєї конфігурації, якщо обробник помилок не встановлений. Про які помилки повідомляти та які помилки ігнорувати вказується у параметрі [`error_reporting`](errorfunc.configuration.md#ini.error-reporting) конфігурації php.ini, або під час виконання програми за допомогою виклику [error\\_reporting()](function.error-reporting.md). Рекомендується заздалегідь конфігурувати php.ini, оскільки деякі помилки можуть статися до початку виконання вашого скрипта.\n\nНа стадии разработки, обязательно настройте параметр[`error_reporting`](errorfunc.configuration.md#ini.error-reporting)на значение\\*\\*`E_ALL`\\*\\*, так як вам необхідно знати про всі помилки для їх вирішення на цій стадії. Коли продукт готовий, ви можете змінити значення менш докладне, начебто `E_ALL & ~E_NOTICE & ~E_DEPRECATED`, але у багатьох випадках значення **`E_ALL`** також бажано, тому що воно може попереджати заздалегідь про інші можливі помилки.\n\nПодальша робота PHP з помилками, що з'явилися, залежить від двох інших параметрів в php.ini. Параметр [`display_errors`](errorfunc.configuration.md#ini.display-errors) визначає, чи включати дані помилки у висновок скрипта чи ні. Коли продукт готовий, обов'язково вимкніть цей параметр, оскільки в описі помилки може бути конфіденційна інформація, на кшталт паролів бази даних. Під час розробки цей параметр краще увімкнути для вирішення проблем, що провокують помилки.\n\nКрім відображення помилок, їх можна записувати в лог за допомогою увімкненого параметра [`log_errors`](errorfunc.configuration.md#ini.log-errors). Файл лога вказується у параметрі [`error_log`](errorfunc.configuration.md#ini.error-log). Ця функція незамінна на стадії кінцевого продукту, оскільки дозволяє бачити інформацію про помилки і складати засновані на них звіти далеко від очей користувача.\n\n### Користувальницька обробка помилок\n\nЯкщо вас не влаштовує робота попередньо встановленого обробника помилок, ви також можете обробляти безліч видів помилок за допомогою свого обробника, який можна встановити викликом функції [set\\_error\\_handler()](function.set-error-handler.md). Деякі помилки не можуть оброблятися користувачем, але ті, які можуть, обробляються за вашим бажанням: наприклад, ваш скрипт може видавати користувачеві будь-яку окрему сторінку помилки, а докладну інформацію записувати в лог або надсилати поштою.\n","title":"Основи","contentType":2,"navigation":[{"language.errors.md":"« Помилки"},{"language.errors.php7.md":"Помилки у PHP 7 »"},{"index.md":"PHP Manual"},{"language.errors.md":"Помилки"}]}},"__N_SSG":true}