{"pageProps":{"page":{"slug":"mbstring.ja-basic.md","content":"# Основи японських багатобайтних кодувань\n\nЯпонські символи можуть бути представлені тільки в багатобайтних кодування, і багато стандартів кодування залежать від платформи та призначення тексту. Ускладнює ситуацію те, що ці стандарти дещо один від одного відрізняються. Щоб створити веб-додаток, що правильно працює в японському оточенні, розробнику необхідно тримати всі ці розбіжності в розумі, щоб бути впевненим, що в кожний момент використовується правильне кодування.\n\n-   Кодовий простір для символу може тривати до шести байт\n-   Більшість японських багатобайтних символів вимагають для зберігання вдвічі більше простору ніж однобайтні символи. Такі символи називають \"zen-kaku\" японською, що означає \"повна ширина\". Інші, вужчі символи називають \"han-kaku\", що означає \"напівширина\". Проте графічні властивості символів залежать від шрифту, яким вони відображаються.\n-   У деяких кодуваннях для зміни кодової розмітки певної області кодів (`00h`на`7fh`) використовуються клавіші shift(escape), визначені в стандарті ISO-2022.\n-   ISO-2022-JP повинен використовуватися в SMTP/NNTP, а заголовки та сутності повинні перекодуватися відповідно до вимог RFC. Навіть якщо перекодування не потрібне, все ж таки воно буде не зайвим, оскільки деякі популярні поштові клієнти не вміють працювати з іншими кодуваннями.\n-   Веб-сторінки, що створюються для мобільних телефонів, таких як[» i-mode](http://www.nttdocomo.com/services/imode/) або [» EZweb](http://www.au.kddi.com/english/service/ezweb/index.md)повинні використовувати кодування Shift\\_JIS.\n-   Емодзі, що використовуються у сервісах мобільних телефонів, таких як[» i-mode](http://www.nttdocomo.com/services/imode/) або [» EZweb](http://www.au.kddi.com/english/service/ezweb/index.md)\n","title":"Основи японських багатобайтних кодувань","contentType":2,"navigation":[{"mbstring.encodings.md":"« Короткий огляд підтримуваних кодувань"},{"mbstring.http.md":"Введення та виведення HTTP »"},{"index.md":"PHP Manual"},{"book.mbstring.md":"Багатобайтові рядки"}]}},"__N_SSG":true}