{"pageProps":{"page":{"slug":"mbstring.constants.md","content":"# Обумовлені константи\n\nНаведені нижче константи визначені цим модулем і доступні або в збірках PHP з підтримкою цього модуля, або коли модуль динамічно завантажений під час виконання коду.\n\n**`MB_OVERLOAD_MAIL`**(int)\n\nВидалено з PHP 8.0.0.\n\n**`MB_OVERLOAD_STRING`**(int)\n\nВидалено з PHP 8.0.0.\n\n**`MB_OVERLOAD_REGEX`**(int)\n\nВидалено з PHP 8.0.0.\n\n**`MB_CASE_UPPER`**(int)\n\nВиконує повне перетворення у верхній регістр. Може змінити довжину рядка. Це режим, що використовується mb\\_strtoupper().\n\n**`MB_CASE_LOWER`**(int)\n\nВиконує повне перетворення на нижній регістр. Може змінити довжину рядка. Це режим, що використовується mb\\_strtolower().\n\n**`MB_CASE_TITLE`**(int)\n\nВиконує повне перетворення прецеденту заголовка на основі властивостей похідного Unicode Cased та CaseIgnorable. Зокрема, покращує обробку лапок та апострофів. Може змінити довжину рядка.\n\n**`MB_CASE_FOLD`**(int)\n\nВиконує повне перетворення, яке видаляє відмінності регістру, що є у рядку. Використовується для порівняння без урахування регістру. Може змінити довжину рядка. Доступно з PHP 7.3.\n\n**`MB_CASE_LOWER_SIMPLE`**(int)\n\nВиконує просте перетворення на нижній регістр. Не змінює довжину рядка. Доступно з PHP 7.3.\n\n**`MB_CASE_UPPER_SIMPLE`**(int)\n\nВиконує просте перетворення у верхній регістр. Не змінює довжину рядка. Доступно з PHP 7.3.\n\n**`MB_CASE_TITLE_SIMPLE`**(int)\n\nВиконує просте перетворення на великі літери. Не змінює довжину рядка. Доступно з PHP 7.3.\n\n**`MB_CASE_FOLD_SIMPLE`**(int)\n\nВиконує просте перетворення, яке видаляє відмінності регістру, що є у рядку. Використовується для порівняння без урахування регістру. Не змінює довжину рядка. Використовується без урахування регістру внутрішніх операцій модулем MBString. Доступно з PHP 7.3.\n\n**`MB_ONIGURUMA_VERSION`**(string)\n\nВерсія Oniguruma, наприклад, `6.9.4`Доступно с PHP 7.4.\n","title":"Обумовлені константи","contentType":2,"navigation":[{"mbstring.resources.md":"« Типи ресурсів"},{"mbstring.encodings.md":"Короткий огляд підтримуваних кодувань »"},{"index.md":"PHP Manual"},{"book.mbstring.md":"Багатобайтові рядки"}]}},"__N_SSG":true}