{"pageProps":{"page":{"slug":"migration71.other-changes.md","content":"## Інші зміни\n\n### Зауваження та попередження під час виконання арифметичних операцій з некоректними рядками\n\nНові помилки рівнів **`E_WARNING`** і **`E_NOTICE`** були додані при використанні некоректних рядків з операторами, які чекають на число (`+` `-` `*` `**` `%` `<<` `>>` `&` `^`) та їх еквівалентами з присвоєнням. Помилка рівня **`E_NOTICE`** видається, коли рядок починається з цифр, але далі містить цифрові символи, і помилка рівня **`E_WARNING`** видається тоді, коли рядок взагалі не містить цифр.\n\n```php\n<?php\n'1b' + 'что-то';\n```\n\nРезультат виконання наведеного прикладу:\n\n```\nNotice: A non well formed numeric value encountered in %s on line %d\nWarning: A non-numeric value encountered in %s on line %d\n```\n\n### Попередження при переповненні вісімкової послідовності екранованої\n\nРаніше 3-октетний вісімковий рядок переповнювався нікому нічого не повідомляючи. Тепер при переповненні буде викликана помилка рівня **`E_WARNING`**\n\n```php\n<?php\nvar_dump(\"\\500\");\n```\n\nРезультат виконання наведеного прикладу:\n\n```\nWarning: Octal escape sequence overflow \\500 is greater than \\377 in %s on line %d\nstring(1) \"@\"\n```\n\n### Исправлена несогласованность`$this`\n\nВ той час як `$this` вважається спеціальною змінною в PHP, їй не вистачало спеціальних перевірок, що її не використовують як змінну і не визначили. Тепер використовувати `$this` як користувальницьку змінну заборонено. Також заборонено надавати їй значення та використовувати у глобальному просторі імен.\n\n### Генерація ідентифікаторів сесій без хешування\n\nІдентифікатори сесій більше не хешуються під час створення. Разом з цим видалено такі чотири параметри з ini-файлу:\n\n-   `session.entropy_file`\n-   `session.entropy_length`\n-   `session.hash_function`\n-   `session.hash_bits_per_character`\n\nІ додані два інші:\n\n-   `session.sid_length`\\- Визначає довжину ідентифікатора сесії. За промовчанням використовується 32 символи для забезпечення зворотної сумісності.\n-   `session.sid_bits_per_character`\\- Визначає кількість біт на кожен символ ідентифікатора (тобто можна збільшити кількість доступних для використання в ідентифікаторі символів). Для зворотної сумісності за замовчуванням використовується 4 біти.\n\n### Зміни в обробці INI-файлів\n\n`precision`\n\nЯкщо встановлено -1, то буде використано режим dtoa. Значення за промовчанням 14.\n\n`serialize_precision`\n\nЯкщо встановлено -1, то буде використано режим dtoa. Тепер значення за промовчанням -1.\n\n`gd.jpeg_ignore_warning`\n\nЗначення за промовчанням для цієї настройки php.ini змінено на 1, так що за замовчуванням попередження libjpeg будуть ігноруватися.\n\n`opcache.enable_cli`\n\nУ PHP 7.1.2 значення за промовчанням для цієї настройки php.ini змінено на 1 (ввімкнено), а в PHP 7.1.7 повернуто значення 0 (вимкнено)\n\n### Генерація ідентифікаторів сесій лише за допомогою CSPRNG\n\nІдентифікатори сесій тепер створюються лише за допомогою CSPRNG.\n\n### Більш інформативне повідомлення [TypeError](class.typeerror.md), якщо допустимо **`null`**\n\nТеперь исключение[TypeError](class.typeerror.md) для перевірок типу arg\\_info надає більш інформативне повідомлення про помилку. Якщо тип параметра або значення, що повертається, може бути **`null`**(либо имеет значение\\*\\*`null`\\*\\* за замовчуванням або має тип, що обнулюється), то тепер у повідомленні буде згадано \"must be ... or null\" або \"must ... or be null.\"\n","title":"Інші зміни","contentType":2,"navigation":[{"migration71.changed-functions.md":"« Змінені функції"},{"migration71.windows-support.md":"Підтримка Windows »"},{"index.md":"PHP Manual"},{"migration71.md":"Міграція з PHP 7.0.x на PHP 7.1.x"}]}},"__N_SSG":true}