{"pageProps":{"page":{"slug":"migration72.deprecated.md","content":"## Функціонал, оголошений застарілим у PHP 7.2.x\n\n### Рядки без лапок\n\nРядки без лапок, які не є існуючими глобальними константами, рахувалися за рядки. Така поведінка раніше викликала помилку рівня **`E_NOTICE`**, але тепер буде **`E_WARNING`**. У наступній основній версії PHP замість помилки викидатиметься виняток [Error](class.error.md)\n\n```php\n<?php\n\nvar_dump(NONEXISTENT);\n\n/* Вывод:\nWarning: Use of undefined constant NONEXISTENT - assumed 'NONEXISTENT' (this will throw an Error in a future version of PHP) in %s on line %d\nstring(11) \"NONEXISTENT\"\n*/\n```\n\n### [png2wbmp()](function.png2wbmp.md) і [jpeg2wbmp()](function.jpeg2wbmp.md)\n\nФункції [png2wbmp()](function.png2wbmp.md) і [jpeg2wbmp()](function.jpeg2wbmp.md) з модуля GD оголошені застарілими та будуть видалені у наступній основній версії PHP.\n\n### Вариант\\*\\*`INTL_IDNA_VARIANT_2003`\\*\\*\n\nУ модулі Intl оголошено застарілим варіант **`INTL_IDNA_VARIANT_2003`**, який в даний час використовується за замовчуванням для функцій [idn\\_to\\_ascii()](function.idn-to-ascii.md) і [idn\\_to\\_utf8()](function.idn-to-utf8.md)В PHP 7.4 значение по умолчанию будет изменено на\\*\\*`INTL_IDNA_VARIANT_UTS46`\\*\\*, а в наступній основній версії PHP константа **`INTL_IDNA_VARIANT_2003`** буде повністю видалено.\n\n### Функция[\\_\\_autoload()](function.autoload.md)\n\nФункция[\\_\\_autoload()](function.autoload.md) була оголошена застарілою, тому що вона поступається альтернативною функцією [spl\\_autoload\\_register()](function.spl-autoload-register.md) (через те, що не може мати чергу з функцій автозавантаження), і через те, що немає сумісності між цими двома стилями автозавантаження.\n\n### Параметр`track_errors`и переменная`$php_errormsg`\n\nКогда параметр`track_errors` включений в ini-налаштуваннях, змінна `$php_errormsg` створюється у локальній області видимості, коли відбувається не фатальна помилка. Враховуючи, що кращим способом отримання такої інформації про помилку є використання функції [error\\_get\\_last()](function.error-get-last.md), дана можливість була оголошена застарілою.\n\n### Функция[create\\_function()](function.create-function.md)\n\nВраховуючи проблеми з безпекою цієї функції (через те, що вона є обгорткою над [eval()](function.eval.md)), ця функція оголошена застарілою. Переважною альтернативою є використання [анонімних функцій](functions.anonymous.md)\n\n### Параметр`mbstring.func_overload`\n\nВраховуючи проблеми сумісності рядкових функцій, що використовуються в оточеннях із включеним цим параметром, цей параметр оголошено застарілим.\n\n### Приведение типа`(unset)`\n\nПриведення будь-якого виразу з використанням цього типу завжди призводить до **`null`**, і тому цей надлишковий тип приведення оголошено застарілим.\n\n### [parse\\_str()](function.parse-str.md) без другого параметра\n\nБез передачі другого параметра функції [parse\\_str()](function.parse-str.md), параметри рядка запиту будуть заповнювати поточну таблицю символів (доступні як змінні в локальній області видимості). Враховуючи наслідки для безпеки через це, використання [parse\\_str()](function.parse-str.md) без другого параметра оголошено застарілим. Ця функція завжди повинна використовуватися з двома аргументами, тому що в другому аргументі зберігаються параметри рядка запиту як елементи масиву.\n\n### Функция[gmp\\_random()](function.gmp-random.md)\n\nЦя функція генерує випадкове число, засноване на діапазоні, який обчислюється залежно від платформи розміру лімба (limb). Через це ця функція оголошена застарілою. Переважним способом генерації випадкового числа через модуль GMP є використання функцій [gmp\\_random\\_bits()](function.gmp-random-bits.md) і [gmp\\_random\\_range()](function.gmp-random-range.md)\n\n### Функция[each()](function.each.md)\n\nЦя функція набагато повільніша за ітерацією, ніж використання звичайного `foreach`, і створює проблеми з реалізацією деяких змін мови, тому дана функція оголошена застарілої.\n\n### [assert()](function.assert.md) з рядковим аргументом\n\nИспользование[assert()](function.assert.md) з рядковим параметром вимагало передачі рядка для виконання [eval()](function.eval.md). Враховуючи можливість віддаленого виконання коду, використання [assert()](function.assert.md) із рядковим аргументом тепер оголошено застарілим на користь використання логічних виразів.\n\n### Аргумент`$errcontext` в обробниках помилок\n\nАргумент`$errcontext` містить усі локальні змінні в місці, де була помилка. Зважаючи на рідкісне його використання та проблеми, пов'язані з внутрішньою оптимізацією, цей параметр оголошено застарілим. Натомість рекомендується використовувати налагоджувач для отримання інформації про помилки.\n\n### Функция[read\\_exif\\_data()](function.read-exif-data.md)\n\nПсевдоним[read\\_exif\\_data()](function.read-exif-data.md) був оголошений застарілим на користь функції [exif\\_read\\_data()](function.exif-read-data.md)\n","title":"Функціонал, оголошений застарілим у PHP 7.2.x","contentType":2,"navigation":[{"migration72.incompatible.md":"« Зміни, що ламають зворотну сумісність"},{"migration72.other-changes.md":"Інші зміни »"},{"index.md":"PHP Manual"},{"migration72.md":"Міграція з PHP 7.1.x на PHP 7.2.x"}]}},"__N_SSG":true}