{"pageProps":{"page":{"slug":"mongodb.installation.windows.md","content":"## Встановлення драйвера PHP MongoDB під Windows\n\nПопередньо скомпіловані виконувані файли прикріплюються до [» випусків проекту на GitHub](https://github.com/mongodb/mongo-php-driver/releases/). Архіви публікуються для різних комбінацій версії PHP, потокової безпеки (TS чи NTS) та архітектури (x86 чи x64). Визначте правильний архів для PHP-оточення та вийміть файл php\\_mongodb.dll - директорію з модулями (за замовчуванням \"ext\").\n\nДодайте наступний рядок у файл php.ini для кожного оточення, в якому буде використано драйвер:\n\nextension=php\\_mongo.dll\n\nНеправильний вибір двійкового файлу призведе до помилки під час спроби завантажити DLL-модуль під час виконання:\n\nPHP Warning: PHP Startup: Unable to load dynamic library 'mongodb'\n\nПереконайтеся, що завантажена DLL відповідає наступним властивостям середовища виконання PHP:\n\n-   Версія PHP (**`PHP_VERSION`**) .\n-   Поточна безпека (**`PHP_ZTS`**) .\n-   Архітектура (**`PHP_INT_SIZE`**) .\n\nЦі властивості можна побачити у виведенні функції [phpinfo()](function.phpinfo.md). Якщо в системі встановлено кілька версій PHP, перевірте двічі, що висновок функції [phpinfo()](function.phpinfo.md) відповідає оточенню.\n\n> **Зауваження** **Додаткові залежності DLL для користувачів Windows**\n> \n> Для роботи цього модуля системної змінної Windows PATH повинні бути доступні DLL-файли. Щоб дізнатися, як цього досягти, зверніться до розділу FAQ \"[Як додати мою директорію з PHP до змінної Windows PATH](faq.installation.md#faq.installation.addtopath)\". Хоча копіювання DLL-файлів з директорії PHP до системної папки Windows також вирішує проблему (бо системна директорія за умовчанням знаходиться в змінній PATH), це не рекомендується. . \\*Цей модуль потребує наступних файлів у змінній PATH:\\*libsasl.dll\n","title":"Встановлення драйвера PHP MongoDB під Windows","contentType":2,"navigation":[{"mongodb.installation.homebrew.md":"« Установка драйвера PHP MongoDB на macOS за допомогою Homebrew"},{"mongodb.installation.manual.md":"Складання драйвера PHP MongoDB з вихідного коду »"},{"index.md":"PHP Manual"},{"mongodb.installation.md":"Установка"}]}},"__N_SSG":true}