{"pageProps":{"page":{"slug":"mysqlinfo.concepts.buffering.md","content":"## Буферизовані та небуферизовані запити\n\nЗа промовчанням запити використовують режим буферизації. Це означає, що результати запиту негайно надходять від сервера MySQL до PHP та зберігаються у пам'яті PHP-процесу. Це дозволяє робити додаткові операції, такі як підрахунок кількості рядків та переміщення (пошук) поточного покажчика результату. Це також дозволяє виконувати нові запити в тому ж з'єднанні під час роботи над результатом останнього запиту. Недоліком режиму буферизації є те, що великі набори результатів можуть вимагати досить багато оперативної пам'яті. Пам'ять залишається зайнятою до тих пір, поки всі покажчики на результуючий набір не будуть видалені або результуючий набір не буде звільнений, що автоматично відбувається під час закінчення останнього запиту. Термін \"результат збереження\" (\"store result\") також використовується для режиму буферизації, оскільки весь результуючий набір зберігається відразу.\n\n> **Зауваження** :\n> \n> При використанні libmysqlclient як бібліотека обмеження пам'яті PHP не враховуватиме пам'ять, що використовується для результуючих наборів, якщо дані не будуть збережені в змінні PHP. З mysqlnd облік пам'яті також буде включати розмір результуючого набору.\n\nНебуферизовані MySQL запити виконуються, а потім очікують на отримання даних з сервера MySQL. Це використовує менше пам'яті PHP, але може збільшити навантаження на сервер. Поки повний результуючий набір не буде переданий із сервера, ніякі подальші запити не можуть бути надіслані через це з'єднання. Небуферизовані запити можуть бути відкладені як \"use result\". Коли всі рядки з набору результатів вилучені, набір результатів зникає і його не можна повторно ітерувати.\n\nВиходячи з цих характеристик, небуферизовані запити слід використовувати лише в тих випадках, коли очікується великий набір результатів, який послідовно оброблятиметься. Небуферизовані запити містять ряд підводних каменів, що ускладнює їх використання, наприклад, кількість рядків у наборі результатів невідома доти, доки не буде вилучено останній рядок. Буферизовані запити - простіший і гнучкий спосіб обробки наборів результатів.\n\nОскільки буферизовані запити застосовуються за замовчуванням, такі приклади продемонструють, як виконати небуферизовані запити в кожному з API\n\n**Приклад #1 Приклад небуферизованого запиту: mysqli**\n\n```php\n<?php\n$mysqli  = new mysqli(\"localhost\", \"my_user\", \"my_password\", \"world\");\n$unbufferedResult = $mysqli->query(\"SELECT Name FROM City\", MYSQLI_USE_RESULT);\n\nforeach ($unbufferedResult as $row) {\n    echo $row['Name'] . PHP_EOL;\n}\n?>\n```\n\n**Приклад #2 Приклад небуферизованого запиту: pdo\\_mysql**\n\n```php\n<?php\n$pdo = new PDO(\"mysql:host=localhost;dbname=world\", 'my_user', 'my_password');\n$pdo->setAttribute(PDO::MYSQL_ATTR_USE_BUFFERED_QUERY, false);\n\n$unbufferedResult = $pdo->query(\"SELECT Name FROM City\");\nforeach ($unbufferedResult as $row) {\n    echo $row['Name'] . PHP_EOL;\n}\n?>\n```\n","title":"Буферизовані та небуферизовані запити","contentType":2,"navigation":[{"mysqlinfo.concepts.md":"\" Основні поняття"},{"mysqlinfo.concepts.charset.md":"Кодування символів »"},{"index.md":"PHP Manual"},{"mysqlinfo.concepts.md":"Основні поняття"}]}},"__N_SSG":true}