{"pageProps":{"page":{"slug":"mysqli.quickstart.connections.md","content":"## З'єднання\n\nСервер MySQL підтримує різні способи передачі. З'єднання можуть використовувати протоколи TCP/IP, сокети Unix-доменів або іменовані пайпи Windows.\n\nИмя хоста`localhost` має особливе значення. Воно використовується лише в сокетах доменів Unix. Щоб відкрити TCP/IP-з'єднання з локальним хостом, необхідно використовувати `127.0.0.1`вместо имени хоста`localhost`\n\n**Приклад #1 Спеціальне призначення**\n\n```php\n<?php\n\n$mysqli = new mysqli(\"localhost\", \"user\", \"password\", \"database\");\n\necho $mysqli->host_info . \"\\n\";\n\n$mysqli = new mysqli(\"127.0.0.1\", \"user\", \"password\", \"database\", 3306);\n\necho $mysqli->host_info . \"\\n\";\n```\n\nРезультат виконання наведеного прикладу:\n\n```\nLocalhost via UNIX socket\n127.0.0.1 via TCP/IP\n```\n\n**Умовчання для параметрів з'єднань**\n\nЗалежно від функції, що здійснює підключення, якісь параметри не можна задавати. Якщо параметр не заданий, модуль спробує використати значення за промовчанням для цього параметра, яке встановлено в конфігураційному файлі PHP.\n\n**Приклад #2 Завдання значень за замовчуванням**\n\nmysqli.default\\_host=192.168.2.27 mysqli.default\\_user=root mysqli.default\\_pw=\"\" mysqli.default\\_port=3306 mysqli.default\\_socket=/tmp/mysql.sock\n\nДалі, щоб встановити з'єднання, функція передає параметри клієнтську бібліотеку, якою користується модуль. Якщо бібліотека виявить порожні або відсутні параметри, вона може встановити замість них свої вбудовані значення за промовчанням.\n\n**Вбудовані бібліотечні значення за промовчанням для параметрів з'єднання**\n\nЯкщо ім'я хоста не задано або передано порожній рядок, клієнтська бібліотека використовує для підключення до Unix-сокету хоста `localhost`. Якщо сокет не заданий або передано порожній рядок, і при цьому запитане підключення до Unix-сокету, бібліотека спробує підключитися до сокету `/tmp/mysql.sock`\n\nУ Windows-системах, якщо як ім'я хоста передається , бібліотека спробує відкрити з'єднання з урахуванням іменованого пайпа. У цьому випадку ім'я сокета буде сприйнято як пайп. Якщо ім'я сокета не задано, то буде використано значення `\\\\.\\pipe\\MySQL`\n\nЯкщо з'єднання не використовує ні сокет домену Unix, ні іменований пайп Windows, і при цьому не заданий порт для підключення, бібліотека використовує номер порту `3306`\n\nУ драйвері [mysqlnd](mysqlnd.overview.md) та клієнтській бібліотеці MySQL (libmysqlclient) закладена та сама логіка визначення умовчань.\n\n**Налаштування з'єднання**\n\nНалаштування з'єднання дозволяють, наприклад, встановити якісь команди, які потрібно виконати відразу після підключення, або віддати розпорядження використовувати певний набір символів. Установки повинні бути задані до підключення до сервера.\n\nКоли потрібно встановити налаштування з'єднання, операція підключення виконується в три етапи: функцією [mysqli\\_init()](mysqli.init.md) або [mysqli::\\_\\_construct()](mysqli.construct.md) створюється дескриптор підключення, потім підключення налаштовується за допомогою функції [mysqli::options()](mysqli.options.md), і нарешті встановлюється мережне з'єднання з сервером за допомогою функції [mysqli::real\\_connect()](mysqli.real-connect.md)\n\n**Об'єднання підключень до пулу**\n\nМодуль mysqli підтримує постійні з'єднання з базою даних, які являють собою спеціальний вид об'єднаних з'єднань. За замовчуванням кожне відкрите скриптом з'єднання закривається або самим скриптом під час виконання, або автоматично після завершення роботи скрипта. Постійні з'єднання відрізняються тим, що не закриваються, а поміщаються в пул для повторного використання надалі. Якщо потрібно підключитися до того ж сервера та бази даних, з тим самим ім'ям користувача, паролем, сокетом і портом, то замість створення нового підключення з пулу виймається вже існуюче. Повторне використання з'єднань дозволяє уникнути накладних витрат на створення нових з'єднань.\n\nКожен PHP процес використовує свій пул підключень mysqli. Залежно від конфігурації веб-сервера, процес PHP може обслуговувати один або кілька запитів. Відповідно, з'єднання з пулу можуть послідовно використовувати кілька скриптів.\n\n**Постійне з'єднання**\n\nНове підключення створюється, тільки якщо в кулі не знайдеться вільного підключення з тими самими даними хоста, імені користувача, пароля, сокету, порту та бази даних за промовчанням. Механізм постійних з'єднань можна включати та вимикати PHP директивою [mysqli.allow\\_persistent](mysqli.configuration.md#ini.mysqli.allow-persistent). Максимальна кількість з'єднань, які може відкрити скрипт, обмежена значенням [mysqli.max\\_links](mysqli.configuration.md#ini.mysqli.max-links). Максимальна кількість з'єднань, які може відкрити один PHP-процес, обмежена значенням [mysqli.max\\_persistent](mysqli.configuration.md#ini.mysqli.max-persistent). Слід зазначити, що веб-сервер може породжувати безліч процесів PHP.\n\nГоловний недолік постійних підключень полягає в тому, що перед повторним використанням їхній стан не скидається до первісного. Наприклад, відкриті та незавершені транзакції не будуть автоматично відкочуватися. Також, якщо під час знаходження з'єднання в пулі для процесу змінилися будь-які дозволи або рівні доступу, цей факт ніяк не вплине на підключення під час його вилучення з пулу. Така поведінка може спричинити небажані результати. Хоча, з іншого боку, назва `постійний` можна розглядати, як обіцянку, що підключення і справді залишиться в тому стані, в якому воно було поміщене в пул.\n\nМодуль mysqli підтримує обидві інтерпретації терміну постійне з'єднання: стан з'єднання може зберігатися, а може скидатися в початкове. За замовчуванням під час вилучення з пулу з'єднання скидається. mysqli робить це неявним викликом функції [mysqli::change\\_user()](mysqli.change-user.md) щоразу, коли підключення використовується повторно. З точки зору користувача підключення виглядає, як щойно створене.\n\nОднак, виклик функції [mysqli::change\\_user()](mysqli.change-user.md) Досить дорога операція. Для покращення швидкодії можна перекомпілювати модуль із встановленим прапором **`MYSQLI_NO_CHANGE_USER_ON_PCONNECT`**\n\nВибір між безпечною поведінкою підключень та найкращою швидкодією залишається за користувачем. Тут не можна дати однозначної поради. Для простоти використання, за умовчанням увімкнено безпечний режим з очищенням з'єднань.\n\n**Дивіться також**\n\n-   [mysqli::\\_\\_construct()](mysqli.construct.md)\n-   [mysqli\\_init()](mysqli.init.md)\n-   [mysqli::options()](mysqli.options.md)\n-   [mysqli::real\\_connect()](mysqli.real-connect.md)\n-   [mysqli::change\\_user()](mysqli.change-user.md)\n-   [$mysqli::host\\_info](mysqli.get-host-info.md)\n-   [MySQLi Configuration Options](mysqli.configuration.md)\n-   [Persistent Database Connections](features.persistent-connections.md)\n","title":"З'єднання","contentType":2,"navigation":[{"mysqli.quickstart.dual-interface.md":"« Процедурний та об'єктно-орієнтований інтерфейс"},{"mysqli.quickstart.statements.md":"Виконання запитів »"},{"index.md":"PHP Manual"},{"mysqli.quickstart.md":"Короткий посібник"}]}},"__N_SSG":true}