{"pageProps":{"page":{"slug":"mysqlnd.plugin.mysql-proxy.md","content":"## Порівняння плагінів mysqlnd з MySQL Proxy\n\nПлагіни `mysqlnd` і MySQL Proxy – це різні технології, що використовують різні підходи. Обидва варіанти є відповідними інструментами для вирішення різноманітних стандартних завдань, таких як балансування навантаження, моніторинг та покращення продуктивності. Важливою відмінністю є те, що MySQL Proxy працює з усіма клієнтами MySQL, тоді як плагіни `mysqlnd` - Тільки для PHP-додатків.\n\nКак модуль PHP, плагин`mysqlnd` встановлюється на сервері додатків PHP разом із рештою PHP. MySQL Proxy може бути запущений на сервері додатків PHP або бути встановлений на окремій машині для підтримки множинних серверів додатків PHP.\n\nУстановка MySQL Proxy на сервері додатків має дві переваги:\n\n1.  Відсутність єдиної точки відмови\n    \n2.  Легкість у масштабуванні (горизонтальному або клієнтському)\n    \n\nMySQL Proxy (а також плагіни `mysqlnd`) можуть легко вирішувати проблеми, заради вирішення яких інакше знадобилися зміни в існуючих додатках.\n\nТим не менш, у MySQL Proxy є деякі недоліки:\n\n-   MySQL Proxy - це новий елемент та технологія, яку потрібно вивчити та встановити\n    \n-   MySQL Proxy вимагає знання скриптової мови Lua\n    \n\nMySQL Proxy може бути змінений за допомогою C та Lua. Lua є кращою мовою скриптів для MySQL Proxy. Для більшості експертів PHP, Lua є новою мовою, яку потрібно вивчати. Плагін `mysqlnd` може бути написаний на C. Також можна написати плагін на PHP, використовуючи [» PECL/mysqlnd\\_uh](http://pecl.php.net/package/mysqlnd_uh)\n\nMySQL Proxy працює як демон – фоновий процес. MySQL Proxy може згадати раніше прийняті рішення, оскільки всі стани можуть бути збережені. Однак плагіни `mysqlnd` прив'язані до життєвого циклу PHP, що базується на запитах. Також MySQL Proxy може розділяти один раз отриманий результат між різними серверами додатків. Плагіни `mysqlnd` для вирішення цього завдання повинні використовувати якесь постійне сховище, для збереження результатів між запитами. Наприклад, для цього може бути використаний інший демон, такий як Memcache. Так що в цьому випадку MySQL Proxy працює явно краще.\n\nMySQL Proxy працює поверх мережевих протоколів. За допомогою MySQL Proxy ви можете розібрати та піддати інженерному аналізу протокол MySQL Client Server. Що-небудь змінити можна лише маніпулюючи протоколом обміну. Якщо протокол раптом зміниться (що трапляється вкрай рідко), скрипти MySQL Proxy потрібно буде переписувати.\n\nПлагіни `Mysqlnd` працюють поверх C API, який дублює клієнт `libmysqlclient`. Це C API насправді звичайна обгортка навколо протоколу MySQL Client Server. Ви можете перехоплювати всі дзвінки C API. PHP використовує C API, фактично ви можете перехоплювати взагалі всі виклики PHP без необхідності програмувати на рівні протоколу обміну.\n\n`Mysqlnd` реалізує протокол обміну. Таким чином, плагіни можуть перехоплювати, досліджувати, змінювати і навіть повністю замінювати протокол зв'язку. Хоча, зазвичай, нічого цього не потрібно.\n\nПлагіни дозволяють вам використовувати два рівні (C API та протокол обміну), у цьому вони набагато гнучкіші, ніж MySQL Proxy. Якщо плагін `mysqlnd`реализован с использованием C API, изменения протокола обмена не потребуют изменения плагина.\n","title":"Порівняння плагінів mysqlnd з MySQL Proxy","contentType":2,"navigation":[{"mysqlnd.plugin.md":"API для плагінів до вбудованого драйвера MySQL"},{"mysqlnd.plugin.obtaining.md":"Отримання API плагінів mysqlnd »"},{"index.md":"PHP Manual"},{"mysqlnd.plugin.md":"API для плагінів до вбудованого драйвера MySQL"}]}},"__N_SSG":true}