{"pageProps":{"page":{"slug":"oci8.configuration.md","content":"## Налаштування під час виконання\n\nПоведінка цих функцій залежить від установок у php.ini.\n\n**Параметри конфігурації OCI8**\n\n| Имя | По умолчанию | Место изменения | Список изменений |\n| --- | --- | --- | --- |\n| [oci8.connection\\_class](oci8.configuration.md#ini.oci8.connection-class) | \"\" | **`INI_ALL`** |  |\n| [oci8.default\\_prefetch](oci8.configuration.md#ini.oci8.default-prefetch) | \"100\" | **`INI_SYSTEM`** |  |\n| [oci8.events](oci8.configuration.md#ini.oci8.events) | Off | **`INI_SYSTEM`** |  |\n| [oci8.max\\_persistent](oci8.configuration.md#ini.oci8.max-persistent) | \"-1\" | **`INI_SYSTEM`** | Оголошена застарілою починаючи з PHP 8.1.0. |\n| [oci8.old\\_oci\\_close\\_semantics](oci8.configuration.md#ini.oci8.old-oci-close-semantics) | Off | **`INI_SYSTEM`** |  |\n| [oci8.persistent\\_timeout](oci8.configuration.md#ini.oci8.persistent-timeout) | \"-1\" | **`INI_SYSTEM`** |  |\n| [oci8.ping\\_interval](oci8.configuration.md#ini.oci8.ping-interval) | \"60\" | **`INI_SYSTEM`** |  |\n| [oci8.prefetch\\_lob\\_size](oci8.configuration.md#ini.oci8.prefetch-lob-size) | \"0\" | **`INI_SYSTEM`** | Доступна з версії PECL OCI8 3.2. |\n| [oci8.privileged\\_connect](oci8.configuration.md#ini.oci8.privileged-connect) | Off | **`INI_SYSTEM`** |  |\n| [oci8.statement\\_cache\\_size](oci8.configuration.md#ini.oci8.statement-cache-size) | \"20\" | **`INI_SYSTEM`** |  |\n\nКоротке пояснення конфігураційних директив.\n\n`oci8.connection_class`string\n\nЦей текст, що визначається користувачем, обов'язково повинен бути заданий при використанні резидентного пулу з'єднань бази даних Oracle (Database Resident Connection Pooling (DRCP)). Це дозволяє суб-партиціонування пулу з'єднань DRCP, що дозволяє постійним з'єднанням OCI8 із програми знову використовувати сесії бази даних від попереднього PHP-скрипту, покращуючи масштабованість. Якщо програма використовує процес з пулу бази даних, який раніше використовується з іншим класом з'єднань, налаштування сесії, такі як формат дати Oracle, будуть скинуті. Це запобігає випадковому обміну інформацією між різними додатками.\n\nЗначення може бути встановлене під час виконання скрипту за допомогою [ini\\_set()](function.ini-set.md)до установки соединения.\n\nДля використання DRCP, OCI8 має бути зібрана з бібліотеками Oracle 11*g* або новіше і база даних має бути Oracle 11*g* чи новіший. Пул з'єднань DRCP у базі даних має бути включений, `oci8.connection_class` має бути встановлене в те саме рядкове значення для всіх веб-серверів, що виконують одну і ту ж програму, а рядок з'єднання OCI8 повинен вказувати на сервер з пула. Програма має використовувати постійні з'єднання.\n\n`oci8.default_prefetch`int\n\nЦя опція встановлює значення за замовчуванням для кількості екстра рядів, які будуть повернуті та автоматично закешовані за низькорівневого запиту даних з бази даних. Встановлення значення в вимикає попередню вибірку (prefetching).\n\nЗначення попередньої вибірки не змінює кількість рядів, що повертаються користувачеві такими функціями як [oci\\_fetch\\_array()](function.oci-fetch-array.md); OCI8 внутрішньо обробляє попередню вибірку та кешування рядів.\n\nЗначення може бути встановлене окремо для кожного виразу (per-statement) за допомогою [oci\\_set\\_prefetch()](function.oci-set-prefetch.md) до виконання самого виразу.\n\nПри використанні Oracle Database 12*c* або нове попереднє значення, задане PHP, може бути перевизначено клієнтським конфігураційним файлом Oracle `oraaccess.xml`Обратитесь к документации Oracle.\n\n> **Зауваження**: Велика попередня вибірка може покращити продуктивність за рахунок деякого збільшеного використання пам'яті. Для запитів, що повертають великі масиви даних, вигода у продуктивності буде значною.\n\n`oci8.events`bool\n\nВключення (`On`) дозволяє повідомити PHP про події Швидкого Повідомлення Додатків бази даних (FAN).\n\nБез FAN, якщо екземпляр бази даних або вузол машини несподівано дасть збій, PHP програми можуть бути заблоковані, очікуючи на відповідь від бази даних до перевищення часу очікування TCP. За допомогою подій FAN PHP програми швидко будуть повідомлені про збої, які впливають на встановлені ними з'єднання до бази даних. Модуль OCI8 підчистить з'єднання, що не використовуються, в кеші постійних з'єднань.\n\nПри використанні директиви (`On`), база даних також має бути налаштована на відправку FAN подій.\n\nПідтримка FAN доступна, якщо OCI8 була злінкована з бібліотеками Oracle 10*g*R2 (або пізнішими) та з'єднання було здійснено до Oracle Database 10*g*R2 (або пізнішої версії).\n\n`oci8.max_persistent`int\n\nМаксимальна кількість постійних з'єднань OCI8 на один процес PHP. Встановлення цієї опції -1 означає відсутність ліміту.\n\n`oci8.old_oci_close_semantics`bool\n\nЦя опція контролює поведінку функції [oci\\_close()](function.oci-close.md). Її включення означає, що [oci\\_close()](function.oci-close.md) не робить нічого; з'єднання не буде закрито, доки не закінчиться виконання скрипту. Це зроблено лише з метою зворотної сумісності. Якщо ви відчуваєте потребу в цьому налаштуванні, *суворо рекомендується* налаштувати виклики [oci\\_close()](function.oci-close.md) у ваших скриптах замість увімкнення цієї опції.\n\n`oci8.persistent_timeout`int\n\nМаксимальна кількість секунд, що дозволяється PHP-процесу тримати постійне з'єднання, що не використовується, відкритим. Встановлення цієї опції в -1 означає, що з'єднання, що не використовуються, будуть утримані, поки PHP-процес не завершить своє виконання або з'єднання не буде примусово закрито за допомогою функції [oci\\_close()](function.oci-close.md)\n\n> **Зауваження**: У PHP закінчення терміну дії ресурсів, що не використовуються, не засноване на повідомленнях. Воно відбувається коли PHP завершує обробку скрипта і перевіряє позначку часу останніх використаних ресурсів. Звідси виникає наступний парадокс: з'єднання, що не використовуються, можуть бути закриті тільки коли є деяка активність (хоча і не обов'язково пов'язана з OCI8) в PHP-процесі. Якщо є більше одного PHP-процесу, то кожен з них окремо повинен бути приведений в дію для того, щоб ініціювати закінчення терміну дії ресурсів, що простоюють. Введення резидентного пулу з'єднань бази даних (DRCP) у Oracle 11*g* вирішує проблеми з пам'яттю та ресурсами, які раніше намагалися вирішити `oci8.max_persistent`и`oci8.persistent_timeout`\n\n`oci8.ping_interval`int\n\nКількість секунд, що має пройти до пінгу протягом виконання [oci\\_pconnect()](function.oci-pconnect.md). Пінг забезпечує коректність з'єднання бази даних. Якщо встановлено 0, постійні з'єднання будуть пінгуватись при кожному виклику [oci\\_pconnect()](function.oci-pconnect.md). Для повного відключення пінгів встановіть цю опцію -1.\n\n> **Зауваження**: Отключение пингов позволяет[oci\\_pconnect()](function.oci-pconnect.md) діяти з максимальною ефективністю, але PHP може бути нездатним визначити непридатні з'єднання, наприклад, при обриві мережі або при відключенні бази даних Oracle після того, як PHP встановив з'єднання, доки з'єднання знову не буде використано в скрипті. Проконсультуйтесь із документацією функції [oci\\_pconnect()](function.oci-pconnect.md) для більш детальної інформації.\n\n`oci8.prefetch_lob_size`int\n\nПараметр налаштування, що впливає на внутрішню буферизацію даних LOB. Збільшення цього значення може покращити продуктивність вибірки менших LOB за рахунок скорочення кругових обходів між PHP та базою даних. Використання пам'яті зміниться.\n\nЗначення впливає на LOB, що повертаються як екземпляри OCILob, а також на ті, що повертаються з використанням **`OCI_RETURN_LOBS`**\n\nЗначення може бути встановлене для кожного оператора за допомогою функції [oci\\_set\\_prefetch\\_lob()](function.oci-set-prefetch-lob.md) до виконання оператора.\n\n> **Зауваження**: Використовуйте з Oracle Database 12.2 або новіше.\n\n`oci8.privileged_connect`bool\n\nЦя опція дозволяє з'єднанням використовувати привілейовані зовнішні облікові записи **`OCI_SYSOPER`** або **`OCI_SYSDBA`**\n\n> **Зауваження**: Встановлення цієї директиви в `On` дозволить скриптам, запущеним з відповідними користувальницькими привілеями операційної системи, з'єднуватися з базою даних як привілейовані користувачі бази даних без вимог пароля. Це може бути брехнею системи безпеки.\n\n`oci8.statement_cache_size`int\n\nЦя опція включає кешування виразів, а також вказує, скільки виразів необхідно кешувати. Для відключення кешування виразів просто встановіть значення цієї опції 0.\n\nКешування виразів прибирає необхідність передавати текст виразу до бази даних, а також зворотну передачу різних метаданих про це вираз назад до PHP. Це може значно покращити загальну продуктивність системи у додатках, які повторно використовують вирази протягом життя однієї сполуки. Деякі додаткові \"курсори\" баз даних можуть залишитися відкритими, маючи на увазі, що дані вирази будуть використані повторно.\n\nВстановіть це значення розміром робочого набору виразів, що використовуються вашою програмою. Встановлення занадто малого значення може спричинити викид виразів з кешу до їх повторного використання.\n\nЦя опція найчастіше використовується із постійними з'єднаннями.\n\nПри використанні Oracle Database 12*c* або вище, попереднє значення, задане PHP, може бути перевизначено клієнтським конфігураційним файлом Oracle `oraaccess.xml`Обратитесь к документации Oracle.\n","title":"Налаштування під час виконання","contentType":2,"navigation":[{"oci8.test.md":"« Тестування"},{"oci8.constants.md":"Обумовлені константи »"},{"index.md":"PHP Manual"},{"oci8.setup.md":"Встановлення та налаштування"}]}},"__N_SSG":true}