{"pageProps":{"page":{"slug":"oci8.installation.md","content":"## Установка\n\n## Складання PHP спільно з OCI8\n\nПеред збиранням OCI8 вивчіть попередній розділ \"[Вимоги](oci8.requirements.md)\".\n\nПеред початком веб-сервера, OCI8 зазвичай потрібно кілька змінних оточення Oracle (див. нижче) для виявлення бібліотек, конфігураційних файлів та встановлення деяких базових властивостей, таких як кодування, використовуване бібліотеками Oracle. Ці змінні мають бути встановлені *перед* запуск будь-якого PHP-процесу.\n\nБінарний файл PHP повинен використовувати ту ж чи більш свіжу основну версію бібліотек Oracle, ніж ту, з якою він був зібраний. Наприклад, якщо ви зібрали OCI8 з бібліотеками Oracle 19, PHP також повинен працювати з бібліотеками Oracle 19. Програми PHP можуть підключатися до інших версій Oracle Database, оскільки Oracle має клієнт-серверну сумісність різних версій.\n\n## Установка OCI8 із PECL\n\nМодуль OCI8 може бути включений до поточної установки PHP як автоматично, так і вручну за допомогою [» PECL](https://pecl.php.net/package/oci8)\n\n-   Якщо комп'ютер знаходиться за фаєрволом, встановіть проксі для PEAR, наприклад:\n    \n    ```\n    pear config-set http_proxy http://my-proxy.example.com:80/\n    ```\n    \n-   Запустіть\n    \n    ```\n    pecl install oci8\n    ```\n    \n    Для PHP 7, використовуйте`pecl install oci8-2.2.0`\n    \n    При запиті введіть або значення`$ORACLE_HOME`, либо`instantclient,/path/to/instant/client/lib`\n    \n    Зверніть увагу: Не вводьте ім'я змінної, такої як`$ORACLE_HOME`или`$HOME`т.к. вона не буде розгорнута. Натомість, введіть повний шлях. Наприклад`/opt/oracle/product/19c/dbhome_1`или`instantclient,/Users/myname/Downloads/instantclient_19_8`\n    \n-   Ошибка`oci8_dtrace_gen.h: No such file or directory`означає, що PHP було зібрано з підтримкою[DTrace Dynamic Tracing](features.dtrace.md). У такому разі встановлюйте так:\n    \n    ```\n    $ export PHP_DTRACE=yes\n    $ pecl install oci8\n    ```\n    \n-   Додайте до php.ini наступний рядок:\n    \n    ```\n    extension=oci8.so\n    ```\n    \n    Переконайтеся, що oci8.so встановлений у директорію, задану у директиві[extension\\_dir](ini.core.md#ini.extension-dir)файла php.ini.\n    \n\n## Установка OCI8 із PECL за допомогою phpize\n\nЯкщо з якихось причин немає можливості скористатися командою `pecl`, можна самостійно завантажити пакет із сайту [» PECL](https://pecl.php.net/package/oci8)НаПриклад oci8-3.0.0.tgz.\n\n-   Розархівуйте пакет:\n    \n    ```\n    tar -zxf oci8-3.0.0.tgz\n    cd oci8-3.0.0\n    ```\n    \n-   Підготуйте його:\n    \n    ```\n    phpize\n    ```\n    \n-   Налаштуйте використовуючи`$ORACLE_HOME`або Instant Client\n    \n    ```\n    ./configure -with-oci8=shared,$ORACLE_HOME\n    ```\n    \n    or\n    \n    ```\n    ./configure -with-oci8=shared,instantclient,/path/to/instant/client/lib\n    ```\n    \n-   Проінсталюйте:\n    \n    ```\n    make install\n    ```\n    \n-   Ошибка`oci8_dtrace_gen.h: No such file or directory`означає, що PHP було зібрано з підтримкою[DTrace Dynamic Tracing](features.dtrace.md). У такому разі перезапустіть`configure`и`make`, попередньо встановивши змінну оточення:\n    \n    ```\n    $ export PHP_DTRACE=yes\n    ```\n    \n-   Додайте до php.ini наступний рядок:\n    \n    ```\n    extension=oci8.so\n    ```\n    \n    Переконайтеся, що oci8.so встановлений у директорію, задану у директиві[extension\\_dir](ini.core.md#ini.extension-dir)файла php.ini.\n    \n\n## Установка OCI8 у вигляді підвантажуваного (shared) модуля під час складання PHP\n\nУказание опции конфигурации`shared` дозволяє зібрати OCI8 у вигляді бібліотеки, що динамічно підвантажується. Складання у вигляді модуля, що підвантажується, дозволяє легко оновлювати OCI8 без перескладання всього PHP.\n\nЗберіть OCI8 за допомогою однієї з наведених нижче опцій.\n\n-   При використанні безкоштовних бібліотек[»  Oracle Instant Client](https://www.oracle.com/database/technologies/instant-client.md) :\n    \n    ```\n    ./configure --with-oci8=shared,instantclient,/шлях/до/instant/client/lib\n    ```\n    \n    Якщо Instant Client 12.2 (або раніше) встановлено з ZIP-архіву, не забудьте в першу чергу створити символічне посилання на бібліотеку, наприклад:`ln -s libclntsh.so.12.1 libclntsh.so`\n    \n    Якщо Oracle Instant Client було встановлено за допомогою RPM, команда конфігурації виглядатиме так:\n    \n    ```\n    ./configure --with-oci8=shared,instantclient,/usr/lib/oracle/<version>/client/lib\n    ```\n    \n    НаПриклад,**\\--with-oci8=shared,instantclient,/usr/lib/oracle/19.9/client/lib**\n    \n-   При використанні бази даних Oracle database або повної установки Oracle Client:\n    \n    ```\n    ./configure --with-oci8=shared,$ORACLE_HOME\n    ```\n    \n    Переконайтеся, що користувач, під яким запущено веб-сервер, (`nobody` `www`) має доступ до бібліотек, файлів ініціалізації та tnsnames.ora (якщо використовується) у папці`$ORACLE_HOME`. При використанні Oracle 10*g*R2, може знадобитися запуск утиліти $ ORACLE\\_HOME/install/changePerm.sh для отримання доступу до цієї папки.\n    \n\nПісля налаштування дотримуйтесь звичайної процедури складання PHP, наприклад, *make install*, після чого буде створено бібліотеку, що підвантажується oci8.so. Можливо, вам потрібно буде вручну перенести її в папку модулів PHP, вказану опцією [extension\\_dir](ini.core.md#ini.extension-dir)вашего php.ini.\n\nДля завершення встановлення OCI8 додайте наступний рядок до php.ini:\n\n```\nextension=oci8.so\n```\n\n## Установка OCI8 у вигляді статично скомпільованого модуля\n\nСкладання PHP зі статичним підключенням OCI8, використовуючи одну з наступних конфігураційних опцій.\n\n-   При використанні Oracle Instant Client:\n    \n    ```\n    ./configure --with-oci8=instantclient,/шлях/до/instant/client/lib\n    ```\n    \n-   У разі використання бази даних Oracle або повної установки Oracle Client:\n    \n    ```\n    ./configure --with-oci8=$ORACLE_HOME\n    ```\n    \n\nПісля налаштування дотримуйтесь звичайної процедури встановлення PHP, наприклад, *make install*. Після успішного складання немає необхідності додавати oci8.so у файл php.ini. Жодних додаткових кроків складання більше не потрібно.\n\n## Встановлення OCI8 у Windows\n\nМодуль OCI8 можна додати до PHP за допомогою бібліотек з репозиторію [» PECL](https://pecl.php.net/package/oci8) або з директорії `ext`, що міститься у вашій інсталяції PHP.\n\nДля бібліотек Oracle 12*c* (і вище), розкоментуйте відповідний рядок у php.ini: `extension=php_oci8_12c.dll` `extension=php_oci8_11g.dll`или`extension=php_oci8.dll`. Одночасно можна використовувати лише одну з цих бібліотек. Нові бібліотеки можуть містити більш сучасний функціонал. Склад доступних бібліотек може змінюватись в залежності від версії PHP. Впевніться, що [extension\\_dir](ini.core.md#ini.extension-dir) вказує на директорію, що містить бібліотеки модулів PHP.\n\nУ разі використання Instant Client встановіть системну змінну оточення PATH на папку з бібліотекою Oracle.\n\n## Встановлення оточення Oracle\n\nПеред використанням цього модуля переконайтеся, що змінні оточення Oracle правильно налаштовані для користувача, під яким працює веб-сервер. Якщо веб-сервер автоматично стартує під час завантаження, переконайтеся, що оточення завантаження також налаштовано коректно.\n\n> **Зауваження** :\n> \n> Не встановлюйте змінні оточення Oracle через [putenv()](function.putenv.md) у PHP-скрипті, тому що бібліотеки Oracle можуть бути завантажені та проініціалізовані до запуску вашого скрипту. Змінні, встановлені через [putenv()](function.putenv.md) можуть потім викликати конфлікти, падіння та іншу непередбачувану поведінку. Деякі функції можуть працювати, в той час як інші дають дрібні помилки. Необхідно встановлювати ці змінні *до*запуска веб-сервера.\n\nУ Red Hat Linux та його варіантах експортуйте змінні в кінці файлу /etc/sysconfig/httpd. Інші системи з Apache 2 можуть використовувати скрипт envvars з папки bin у дистрибутиві Apache. Третім варіантом є директива Apache `SetEnv` у файлі httpd.conf, на якихось системах вона може працювати, однак відомо, що на деяких її недостатньо.\n\nЩоб переконатися в коректному налаштуванні змінних оточення, використовуйте функцію [phpinfo()](function.phpinfo.md) та перевірте, що розділ *Environment*(не*Apache Environment*) містить очікувані змінні.\n\nНаступна таблиця містить змінні, які можуть знадобитися. Докладніше про всі доступні змінні див. у документації Oracle.\n\n**Загальні змінні оточення Oracle**\n\n| Название | Цель |\n| --- | --- |\n| ORACLE\\_HOME | Вказує на папку з повністю встановленою базою даних Oracle. Не встановлюйте цю змінну під час використання Oracle Instant Client, т.к. у цьому немає потреби і може викликати проблеми під час встановлення. |\n| ORACLE\\_SID | Містить назву бази даних на локальній машині, до якої йде підключення. Немає необхідності встановлювати цю змінну під час використання Oracle Instant Client або завжди передавати у параметрах з'єднання у функцію [oci\\_connect()](function.oci-connect.md) |\n| LD\\_LIBRARY\\_PATH | Встановіть цю змінну (або її еквівалент на платформі, наприклад, `LIBPATH`или`SHLIB_PATH`) у місцезнаходження бібліотек Oracle, наприклад, $ORACLE\\_HOME/lib або /usr/lib/oracle/18.5/client/lib. Зверніть увагу, що для ZIP архівів Instant Client у Linux надійніше використовувати ldconfig. Зверніться до інструкції з інсталяції Instant Client. Для RPM пакетів Instant Client 19 (і старших), `ldconfig`, буде запущено автоматично. Хтось використовує `LD_PRELOAD` замість `LD_LIBRARY_PATH` |\n| NLS\\_LANG | Це основна змінна, яка використовується для вказівки кодування та налаштувань глобалізації у бібліотеках Oracle. |\n| ORA\\_SDTZ | Встановлює часовий пояс сесії Oracle. |\n| TNS\\_ADMIN | Містить папку, де зберігаються конфігураційні файли Oracle Net Services, такі як tnsnames.ora та sqlnet.ora. У ній немає необхідності, якщо рядок з'єднання у функції [oci\\_connect()](function.oci-connect.md) використовує синтаксис Easy Connect, такий як, наприклад, `localhost/XE`. . У ній також немає необхідності, якщо мережні конфігураційні файли містяться в місцях зберігання за промовчанням, таких як /usr/lib/oracle/VERSION/client/lib/network/admin, $ORACLE\\_HOME/network/admin чи /etc. |\n\nМенш використовувані змінні оточення Oracle включають `TWO_TASK` `ORA_TZFILE`, а також різні установки глобалізації Oracle на кшталт змінних `NLS*`и`ORA_NLS_*`\n\n## Вирішення проблем\n\nНайчастішою проблемою при встановленні OCI8 є неправильне встановлення оточення Oracle. Зазвичай це виявляється у проблемі під час використання функцій [oci\\_connect()](function.oci-connect.md) або [oci\\_pconnect()](function.oci-pconnect.md). Помилка може виявлятися у вигляді помилок PHP, наприклад, *Call to undefined function oci\\_connect()*, помилок Oracle, таких як ORA-12705, або навіть аварії Apache. Перевірте лог-файли Apache на наявність помилок запуску та вищеописані розділи для вирішення цієї проблеми.\n\nНезважаючи на те, що мережні помилки, на кшталт ORA-12154 або ORA-12514 сигналізують про помилку в іменуванні або конфігурації мережі Oracle, реальною причиною може бути некоректно встановлене оточення PHP, через що бібліотеки Oracle не можуть знайти конфігураційний файл tnsnames.ora.\n\nУ Windows використання декількох версій Oracle на одній машині може легко викликати їх конфлікти, яких можна уникнути при дотриманні особливих запобіжних заходів, що передбачають, що PHP використовує коректну версію Oracle.\n\nУтиліта, яка допомагає визначити пошукові та завантажені в результаті бібліотеки, може допомогти у разі проблем при відсутніх або конфліктуючих бібліотеках, особливо у Windows.\n\n> **Зауваження** **Якщо веб-сервер не стартує або падає під час старту**\n> \n> Перевірте, що Apache зібрано з бібліотекою pthread:\n> \n> ```\n> # ldd /www/apache/bin/httpd\n>   libpthread.so.0 => /lib/libpthread.so.0 (0x4001c000)\n>   libm.so.6 => /lib/libm.so.6 (0x4002f000)\n>   libcrypt.so.1 => /lib/libcrypt.so.1 (0x4004c000)\n>   libdl.so.2 => /lib/libdl.so.2 (0x4007a000)\n>   libc.so.6 => /lib/libc.so.6 (0x4007e000)\n>   /lib/ld-linux.so.2 => /lib/ld-linux.so.2 (0x40000000)\n> ```\n> \n> Якщо libpthread немає у списку, переустановіть Apache:\n> \n> ```\n> # cd /usr/src/apache_1.3.xx\n> # make clean\n> # LIBS=-lpthread ./config.status\n> # make\n> # make install\n> ```\n> \n> Майте на увазі, що на деяких системах, на зразок UnixWare, libpthread називається libthread. Таким чином, PHP та Apache повинні бути налаштовані за допомогою EXTRA\\_LIBS=-lthread.\n","title":"Установка","contentType":2,"navigation":[{"oci8.requirements.md":"« Вимоги"},{"oci8.test.md":"Тестування »"},{"index.md":"PHP Manual"},{"oci8.setup.md":"Встановлення та налаштування"}]}},"__N_SSG":true}