{"pageProps":{"page":{"slug":"openssl.cms.flags.md","content":"## Прапори/Константи CMS\n\nФункції CMS використовують прапори, які задаються за допомогою бітового поля, яке може включати одне або кілька таких значень:\n\n**Константи CMS**\n\n| Константа | Опис |\n| --- | --- |\n| **`OPENSSL_CMS_TEXT`**(int) | Додає заголовки content-type text/plain у зашифроване/підписане повідомлення. При розшифровці або перевірці ці заголовки видаляються з виводу - якщо розшифроване або перевірене повідомлення не відноситься до MIME типу text/plain, відбудеться помилка. |\n| **`OPENSSL_CMS_BINARY`**(int) | Зазвичай вхідне повідомлення перетворюється на «канонічний» формат, який ефективно використовує символи `CR`и`LF` як кінець рядка: як вимагає специфікація CMS. Коли є ця опція, переклад не виконується. Це корисно при обробці бінарних даних, які можуть бути не у форматі CMS. |\n| **`OPENSSL_CMS_NOINTERN`**(int) | Під час перевірки повідомлення сертифікати (якщо є), включені до повідомлення, зазвичай перевіряються на наявність сертифіката підпису. З цією опцією використовуються лише сертифікати, зазначені у параметрі `untrusted_certificates_filename` функції [openssl\\_cms\\_verify()](function.openssl-cms-verify.md). . Однак сертифікати можна використовувати як ненадійні центри сертифікації. |\n| **`OPENSSL_CMS_NOVERIFY`**(int) | Не перевіряти сертифікат підписаного підписаного повідомлення. |\n| **`OPENSSL_CMS_NOCERTS`**(int) | При підписанні повідомлення сертифікат сторони, що підписує, зазвичай включається — з цією опцією він виключається. Це зменшить розмір підписаного повідомлення, але у перевіряючого має бути копія сертифіката підписала доступна локально (наприклад, передана в параметр `untrusted_certificates_filename` функції [openssl\\_cms\\_verify()](function.openssl-cms-verify.md) |\n| **`OPENSSL_CMS_NOATTR`**(int) | Зазвичай під час підписання повідомлення включається набір атрибутів, який включає час підпису та підтримувані симетричні алгоритми. З цією опцією вони не включені. |\n| **`OPENSSL_CMS_DETACHED`**(int) | Під час підписання повідомлення використовуйте підпис відкритим текстом із MIME-типом `\"multipart/signed\"`. . Це значення за замовчуванням, якщо ви не вкажете жодних `flags`для[openssl\\_cms\\_sign()](function.openssl-cms-sign.md). . Якщо ви вимкнете цю опцію, повідомлення буде підписано з використанням непрозорого підпису, який більш стійкий до перекладу поштовими ретрансляторами, але не може бути прочитаний поштовими агентами, які не підтримують S/MIME. |\n| **`OPENSSL_CMS_NOSIGS`**(int) | Не намагатись перевіряти підписи у повідомленні |\n| **`OPENSSL_CMS_OLDMIMETYPE`**(int) | Доступно з PHP 8.3.0. Встановлює тип вмісту `application/x-pkcs7-mime` замість `application/pkcs7-mime` для шифрування повідомлення. |\n","title":"Прапори/Константи CMS","contentType":2,"navigation":[{"openssl.pkcs7.flags.md":"« Прапори/константи PKCS7"},{"openssl.signature-algos.md":"Алгоритми підпису »"},{"index.md":"PHP Manual"},{"openssl.constants.md":"Обумовлені константи"}]}},"__N_SSG":true}