{"pageProps":{"page":{"slug":"openssl.installation.md","content":"## Установка\n\nДля підтримки OpenSSL у PHP вам необхідно скомпілювати його з опцією **\\--with-openssl\\[=DIR\\]**\n\nТакож бібліотека OpenSSL має додаткові вимоги до нормальної роботи під час виконання. Найголовніше, OpenSSL потрібен доступ до генераторів випадкових чи псевдовипадкових чисел; на більшості систем Unix/Linux це означає доступ до пристроїв `/dev/urandom`или`/dev/random`\n\nОпція конфігурації **\\--with-system-ciphers** змушує PHP використовувати системний список шифрів замість жорстко заданого за умовчанням.\n\n> **Зауваження** **Примітки для користувачів Win32**\n> \n> Для роботи цього модуля системної змінної Windows PATH повинні бути доступні DLL-файли. Щоб дізнатися, як цього досягти, зверніться до розділу FAQ \"[Як додати мою директорію з PHP до змінної Windows PATH](faq.installation.md#faq.installation.addtopath)\". Хоча копіювання DLL-файлів з директорії PHP до системної папки Windows також вирішує проблему (бо системна директорія за умовчанням знаходиться в змінній PATH), це не рекомендується. . *Цей модуль потребує наступних файлів у змінній PATH:* libeay32.dll, або, починаючи з OpenSSL 1.1, libcrypto-\\*.dll.\n> \n> Додатково, якщо ви збираєтеся використовувати функції генерації ключів та підписи сертифікатів, вам доведеться встановити коректний файл openssl.cnf у вашій системі. Ми включили демонстраційний конфігураційний файл до бінарної поставки під win32. Він лежить у директорії extras/ssl.\n> \n> PHP шукатиме openssl.cnf, використовуючи наступну логіку:\n> \n> -   Змінне оточення`OPENSSL_CONF`. Якщо встановлено, то має містити шлях (включно з ім'ям файлу) до конфігураційного файлу.\n> -   змінна оточення`SSLEAY_CONF`. Якщо встановлено, то має містити шлях (включно з ім'ям файлу) до конфігураційного файлу.\n> -   Файл openssl.cnf буде шукатися стандартним шляхом для сертифікатів, заданим при компіляції DLL. Зазвичай він заданий як C:\\\\Program Files\\\\Common Files\\\\SSL\\\\openssl.cnf (x64) або C:\\\\Program Files (x86)\\\\Common Files\\\\SSL\\\\openssl.cnf (x86), або до PHP 7.4.0, як C:\\\\usr\\\\local\\\\ssl\\\\openssl.cnf.\n> \n> Під час встановлення ви повинні визначити, чи встановити файл за стандартним шляхом або зберігати його в іншому місці і задати шлях до нього через змінні оточення, що корисно при використанні віртуальних хостів. Зверніть увагу, що шлях за замовчуванням можна перевизначити у скрипті, використовуючи параметр `options` функції, який потрібний цей файл.\n> \n> **Застереження**\n> \n> Переконайтеся, що непривілейовані користувачі не можуть змінювати openssl.cnf.\n\n### список змін\n\n| Версия | Опис |\n| --- | --- |\n| 7.4.0 | Конфігураційний шлях OpenSSL було змінено з C:\\\\usr\\\\local\\\\ssl на C:\\\\Program Files\\\\Common Files\\\\SSL або C:\\\\Program Files (x86)\\\\Common Files\\\\SSL відповідно. |\n","title":"Установка","contentType":2,"navigation":[{"openssl.requirements.md":"« Вимоги"},{"openssl.configuration.md":"Налаштування під час виконання »"},{"index.md":"PHP Manual"},{"openssl.setup.md":"Встановлення та налаштування"}]}},"__N_SSG":true}