{"pageProps":{"page":{"slug":"outcontrol.flushing-system-buffers.md","content":"## Скидання (відправлення) системних буферів\n\nРозробники PHP передбачили два взаємопов'язані способи скидання (відправлення та видалення вмісту) системних буферів: один — виклик функції [flush()](function.flush.md), інший - включення неявного скидання функцією [ob\\_implicit\\_flush()](function.ob-implicit-flush.md) або директивою [implicit\\_flush](outcontrol.configuration.md#ini.implicit-flush)в файле php.ini.\n\nКоли неявне скидання вимкнено, PHP скидатиме висновок, лише коли викликана функція [flush()](function.flush.md)или когда скрипт завершил работу.\n\nПри включеному неявному скиданні PHP намагатиметься скинути висновок після кожного кодового блоку, який виводить дані. Висновок у цьому контексті – це дані ненульової довжини, які:\n\n-   написані за межами тегів`<?php ?>`\n-   виводять мовні конструкції і функції, явна мета яких - виведення змін або рядків, як наприклад:[echo](function.echo.md) [print](function.print.md) [printf()](function.printf.md) [var\\_dump()](function.var-dump.md) [var\\_export()](function.var-export.md) [vprintf()](function.vprintf.md)\n-   виводять функції, мета яких - збирання та виведення даних або інформації про запущений скрипт або PHP, як наприклад:[debug\\_print\\_backtrace()](function.debug-print-backtrace.md) [phpcredits()](function.phpcredits.md) [phpinfo()](function.phpinfo.md) [ReflectionExtension::info()](reflectionextension.info.md)\n-   виводить PHP за неперехопленого виключення або необробленої помилки (за умови, що включені директиви[display\\_errors](errorfunc.configuration.md#ini.display-errors) і [error\\_reporting](errorfunc.configuration.md#ini.error-reporting)) .\n-   записують у потік`php://output`\n\n> **Зауваження**: Друк порожніх рядків або надсилання заголовків не розглядається як висновок і не призведе до операції скидання.\n\n**Увага**\n\nЯкщо неявне скидання увімкнено, керуючі символи (наприклад, `«\\n»` `«\\r»` `«\\0»`) також викликають скидання.\n\n## Обмеження\n\nФункції скидання системних буферів не скидають користувацькі буфери виведення. Щоб використовувати системний та користувальницький буфери разом, користувацькі буфери виводу скидають перед скиданням системних буферів, щоб PHP вивів дані.\n\n**Увага**\n\nНе виключено ризик того, що виклик функції [flush()](function.flush.md) або включене неявне скидання перешкодить обробникам буферів виводу користувача, що встановлює і відправляє заголовки у веб-контексті (наприклад, функція [ob\\_gzhandler()](function.ob-gzhandler.md)), відправивши заголовки доти, як їх відправлять обробники.\n\nПрацюючи з функціями управління PHP-буфером враховують, що PHP не вміє перевизначати буферизацію, реалізовану базовими програмними чи апаратними засобами. Перевірка налаштувань буферизації веб-серверів, браузерів, консолей і робота з ними допомагають усунути проблеми, що виникають. При роботі у веб-контексті для спільної узгодженої роботи регулюють налаштування буферизації веб-сервера або буферизації скрипта, тоді як обійти стратегії буферизації веб-браузерів можна, налаштувавши буферизацію в PHP-скрипті. На консолях, що реалізують буферизацію рядків, символи нового рядка вставляють у потрібні місця перед викиданням.\n\n## Відмінності скидання в інтерфейсах SAPI\n\nХоча реалізації скидання у кожному інтерфейсі SAPI трохи різняться, ці реалізації потрапляють до однієї з категорій:\n\n-   Інтерфейси SAPI у веб-контексті спочатку скинуть заголовки, а потім висновок. До таких SAPI відносяться`Apache2Handler` `CGI` `FastCGI`и`FPM`\n-   інші SAPI, наприклад`CLI`и`embed`, тільки скинуть висновок\n","title":"Скидання (відправлення) системних буферів","contentType":2,"navigation":[{"outcontrol.output-buffering.md":"« Буферизація висновку"},{"outcontrol.user-level-output-buffers.md":"Користувальницькі буфери виводу »"},{"index.md":"PHP Manual"},{"book.outcontrol.md":"Контроль виведення"}]}},"__N_SSG":true}