{"pageProps":{"page":{"slug":"password.constants.md","content":"# Обумовлені константи\n\nНаведені нижче константи завжди доступні як частина ядра PHP.\n\n**`PASSWORD_BCRYPT`**(string)\n\n**`PASSWORD_BCRYPT`** використовується для створення нових хеш паролів використовуючи алгоритм **`CRYPT_BLOWFISH`**\n\nРезультат завжди є хеш формату \"$2y$\" довжиною 60 символів.\n\nОпції, що підтримуються:\n\n-   `salt`(string) - сіль для використання під час створення хешу пароля. Зауважте, що завдання цієї опції запобігає автоматичній генерації солі.\n    \n    Якщо не задано, то для кожного пароля, що хешується, буде створена випадкова сіль за допомогою функції[password\\_hash()](function.password-hash.md). Це є кращим способом, а з PHP 7.0.0 опція salt оголошена застарілою.\n    \n-   `cost`(int) – алгоритмічна вартість, яку слід використовувати. Приклади використання цього значення дивіться на сторінці опису функції[crypt()](function.crypt.md)\n    \n    Якщо не встановлено, то буде використано значення`10`. Це хороша базова вартість, але ви завжди можете її збільшити в залежності від обчислювальних ресурсів, що є у вашому розпорядженні.\n    \n\n**`PASSWORD_ARGON2I`**(string)\n\n**`PASSWORD_ARGON2I`** використовується для створення нових хеш паролів за допомогою алгоритму Argon2i.\n\nОпції, що підтримуються:\n\n-   `memory_cost`(int) - Максимальний розмір пам'яті (кібібайти), яку можна використовувати для обчислення хешу Argon2. За замовчуванням\\*\\*`PASSWORD_ARGON2_DEFAULT_MEMORY_COST`\\*\\*\n    \n-   `time_cost`(int) - Максимально можливий час, який можна витратити для обчислення хешу Argon2. За замовчуванням\\*\\*`PASSWORD_ARGON2_DEFAULT_TIME_COST`\\*\\*\n    \n-   `threads`(int) – кількість потоків, які можна використовувати для обчислення хешу Argon2. За замовчуванням\\*\\*`PASSWORD_ARGON2_DEFAULT_THREADS`\\*\\*. Доступно тільки з libargon2, але не з реалізацією libsodium.\n    \n\nДоступно з PHP 7.2.0.\n\n**`PASSWORD_ARGON2ID`**(string)\n\n**`PASSWORD_ARGON2ID`** використовується для створення хеш паролів за допомогою алгоритму Argon2id. Підтримуються ті ж опції, що і для [**`PASSWORD_ARGON2I`**](password.constants.md#constant.password-argon2i)\n\nДоступно з PHP 7.3.0.\n\n**`PASSWORD_ARGON2_DEFAULT_MEMORY_COST`**(тип int)\n\nОб'єм пам'яті в байтах за замовчуванням, який використовуватиметься при спробі обчислити хеш.\n\nДоступно з PHP 7.2.0.\n\n**`PASSWORD_ARGON2_DEFAULT_TIME_COST`**(int)\n\nОбмеження часу за промовчанням на обчислення хеша.\n\nДоступно з PHP 7.2.0.\n\n**`PASSWORD_ARGON2_DEFAULT_THREADS`**(int)\n\nКількість стандартних потоків для бібліотеки Argon2lib. Недоступно з реалізацією libsodium.\n\nДоступно з PHP 7.2.0.\n\n**`PASSWORD_DEFAULT`** [mixed](language.types.declarations.md#language.types.declarations.mixed)) .\n\nАлгоритм хешування за замовчуванням, якщо не задано примусово. Може бути змінений у нових версіях PHP на більш надійний алгоритм.\n\nВарто зазначити, що згодом ця константа може (і, мабуть, так і буде) змінитись. Тож майте на увазі, що довжина отриманого хеша може змінитися. Пам'ятайте, що якщо ви використовуєте **`PASSWORD_DEFAULT`**, передбачте для зберігання хешей більше 60 символів (рекомендується 255).\n\nЗначення цієї константи:\n\n-   PHP 5.5.0 -**`PASSWORD_BCRYPT`**\n\n##### список змін\n\n| Версия | Опис |\n| --- | --- |\n| 7.4.0 | Значення ідентифікаторів алгоритму пароля (**`PASSWORD_BCRYPT`** **`PASSWORD_ARGON2I`** **`PASSWORD_ARGON2ID`** і **`PASSWORD_DEFAULT`**) Тепер є рядками (string). Раніше вони були номерами (int). |\n","title":"Обумовлені константи","contentType":2,"navigation":[{"password.resources.md":"« Типи ресурсів"},{"ref.password.md":"Функції хешування паролів »"},{"index.md":"PHP Manual"},{"book.password.md":"Хешування паролів"}]}},"__N_SSG":true}