{"pageProps":{"page":{"slug":"posix.constants.setrlimit.md","content":"## Константи функції [posix\\_setrlimit()](function.posix-setrlimit.md)\n\n> **Зауваження** :\n> \n> Будь ласка, зверніть увагу, що деякі з цих констант можуть бути недоступні у вашій операційній системі.\n\n> **Зауваження** :\n> \n> На додаток до наведеної нижче інформації можна вивчити розділ керівництва функції **setrlimit()** для конкретної операційної системи, тому що існують відмінності в тому, як ці обмеження інтерпретуються навіть у системах, які заявляють про повну реалізацію POSIX.\n\n**`POSIX_RLIMIT_AS`**(int)\n\nМаксимальний розмір адресного простору процесу у байтах. Також дивіться конфігураційну директиву [memory\\_limit](ini.core.md#ini.memory-limit)\n\n**`POSIX_RLIMIT_CORE`**(int)\n\nМаксимальний розмір файлу дампа ядра. Якщо це обмеження встановлено як 0, файл дампа ядра створюватися не буде.\n\n**`POSIX_RLIMIT_CPU`**(int)\n\nМаксимальна кількість процесорного часу в секундах може бути використана процесом. Коли досягається м'яке обмеження, процесу буде надіслано сигнал `SIGXCPU`, який може бути оброблений функцією [pcntl\\_signal()](function.pcntl-signal.md). Залежно від операційної системи, може щомиті посилатися додатковий сигнал `SIGXCPU`, поки не буде досягнуто жорсткої межі, досягнення якої не можна обробити. Процесу буде надіслано сигнал `SIGKILL`Смотрите также описание функции[set\\_time\\_limit()](function.set-time-limit.md)\n\n**`POSIX_RLIMIT_DATA`**(int)\n\nМаксимальний розмір сегмента даних процесу у байтах. Вкрай малоймовірно, що це обмеження впливатиме на виконання PHP, за винятком модулів, що викликають функції **brk()** або **sbrk()**\n\n**`POSIX_RLIMIT_FSIZE`**(int)\n\nМаксимальний розмір файлів у байтах, які можуть бути створені процесом.\n\n**`POSIX_RLIMIT_LOCKS`**(int)\n\nМаксимальна кількість блокувань, яку цей процес може створити. Це підтримується лише на дуже старих ядрах Linux.\n\n**`POSIX_RLIMIT_MEMLOCK`**(int)\n\nМаксимальна кількість байт, яка може бути заблокована у пам'яті.\n\n**`POSIX_RLIMIT_MSGQUEUE`**(int)\n\nМаксимальна кількість байт, яка може бути виділена під чергу повідомлень POSIX. Стандартна збірка PHP не підтримує POSIX чергу повідомлень, тому це обмеження не матиме жодного ефекту, крім випадків, коли ви використовуєте модулі, які забезпечують цю підтримку.\n\n**`POSIX_RLIMIT_NICE`**(int)\n\nМаксимальне значення, пріоритет планувальника процесів, яке може бути [встановлено](function.pcntl-setpriority.md). Підсумкове значення обчислюється як `20 - limit`. Як обмеження ресурсу значення може бути негативним.\n\n**`POSIX_RLIMIT_NOFILE`**(int)\n\nЗначення, що перевищує 1, максимальна кількість файлових дескрипторів, яку можна відкрити процесом.\n\n**`POSIX_RLIMIT_NPROC`**(int)\n\nМаксимальна кількість процесів (і/або ниток, залежно від операційної системи), яка може бути створена для реального користувача процесу.\n\n**`POSIX_RLIMIT_RSS`**(int)\n\nМаксимальний розмір фізичної пам'яті (RAM), що використовується кодом процесу та даними, у сторінках.\n\n**`POSIX_RLIMIT_RTPRIO`**(int)\n\nМаксимальний пріоритет реального часу, який може бути встановлений системними викликами функцій **sched\\_setscheduler()** і **sched\\_setparam()**\n\n**`POSIX_RLIMIT_RTTIME`**(int)\n\nМаксимальна кількість процесорного часу в мілісекундах, яку може займати без блокування системних викликів при використанні планувальника реального часу.\n\n**`POSIX_RLIMIT_SIGPENDING`**(int)\n\nМаксимальна кількість сигналів, які можна поставити в чергу для реального користувача цього процесу.\n\n**`POSIX_RLIMIT_STACK`**(int)\n\nМаксимальний розмір стека процесу у байтах.\n\n**`POSIX_RLIMIT_INFINITY`**(int)\n\nВикористовується для відображення нескінченного обмеження ресурсу.\n\n**`POSIX_RLIMIT_KQUEUES`**(int)\n\nМаксимальна кількість kqueue, яку може створити цей ідентифікатор користувача (FreeBSD). Доступно з PHP 8.1.0.\n\n**`POSIX_RLIMIT_NPTS`**(int)\n\nМаксимальна кількість псевдотерміналів може створити цей ідентифікатор користувача (FreeBSD). Доступно з PHP 8.1.0.\n","title":"Константи функції [posix\\_setrlimit()](function.posix-setrlimit.md)","contentType":2,"navigation":[{"posix.constants.mknod.md":"« Константи функції posix\\_mknod"},{"posix.constants.pathconf.md":"Константи функції posix\\_pathconf »"},{"index.md":"PHP Manual"},{"posix.constants.md":"Обумовлені константи"}]}},"__N_SSG":true}