{"pageProps":{"page":{"slug":"preface.md","content":"# Передмова\n\nPHP, що означає \"`PHP: Hypertext Preprocessor`\" - «PHP: Препроцесор Гіпертексту», — поширена інтерпретована мова загального призначення з відкритим вихідним кодом, яка створювалася спеціально для ведення веб-розробок, і код нею вбудовується безпосередньо в HTML-код. Синтаксис мови бере початок з мов C, Java і Perl і легкий для вивчення Основна мета мови - допомогти веб-розробникам створювати динамічно генеровані веб-сторінки швидко, але з PHP можна зробити значно більше.\n\nЦе керівництво в основному складається з [довідника з функцій](funcref.md), але також містить [довідник мови](langref.md), пояснення найважливіших [особливостей](features.md) PHP та інші [додаткові](appendices.md)сведения.\n\nПосібник доступний у кількох форматах за адресою [» https://www.php.net/download-docs.php](https://www.php.net/download-docs.php). Докладніше про те, як ведеться робота над керівництвом, розказано у додатку « [Про це керівництво](about.md) ». Тим, кому цікава історія мови, звертаються до розділу « [Історія PHP](history.md) ».\n\n# Автори та Учасники\n\nМи публікуємо імена найактивніших на поточний момент учасників розробки документації на першій сторінці, але є ще безліч людей, які допомагають нам під час розробки або допомогли раніше. Є також багато учасників, які допомагають нам через систему зауважень користувача, які постійно включаються в основну документацію. Нижче відсортовані списки в алфавітному порядку.\n\n# Автори та Редактори\n\nНаступні учасники зробили значний внесок у наповнення документації в минулому: Bill Abt, Jouni Ahto, Alexander Aulbach, Stig Bakken, George Peter Banyard, Christoph M. Becker, Daniel Beckham, Nilgün Belma Bugüner, Jesus M. Castagnetto, Ron Chmara, Sean Coates, John Coggeshall, Simone Cortesi, Peter Cowburn, Daniel Egeberg, Markus Fischer, Wez Furlong, Sara Golemon, Rui Hirokawa, Brad House, Pierre-Alain Joye, Etienne Kneuss, Moriyoshi Koizumi, Rasmus Lerdorf, Andrew Lindeman, Stanislav Rafael Martinez, Rick McGuire, Moacir de Oliveira Miranda Junior, Kalle Sommer Nielsen, Yasuo Ohgaki, Philip Olson, Richard Quadling, Derick Rethans, Rob Richards, Sander Roobol, Egon Schmid, Thomas Schoefbeck, Sascha Schumann, Dan Scott, Masahiro Taka Takaoka, Yannick Torres, Michael Wallner, Lars Torben Wilson, Jim Winstead, Jeroen van Wolffelaar та Andrei Zmievski.\n\nНаступні учасники зробили значний внесок у редагування та коригування документації у минулому: Stig Bakken, Gabor Hojtsy, Hartmut Holzgraefe, Philip Olson та Egon Schmid.\n\n# Редактори зауважень користувача\n\nНайактивніші редактори: Daniel Brown, Nuno Lopes, Felipe Pena, Thiago Pojda та Maciek Sokolewicz.\n\nЦі люди внесли свій внесок в управління користувальницькими зауваженнями в минулому: Mehdi Achour, Daniel Beckham, Friedhelm Betz, Victor Boivie, Jesus M. Castagnetto, Nicolas Chaillan, Ron Chmara, Sean Coates, James Cox, Vincent Gevers, Sara Golemon, Zak Greant, Szabolcs Heilig, Oliver Hinckel, Hartmut Holzgraefe, Etienne Kneuss, Rasmus Lerdorf, Matthew Li, Andrew Lindeman, Aidan Lister, Hannes Magnusson, Maxim Maletsky, Bobby Matthis, James Moore, Philip Olson, Sebastian Picklum, Derick , Jason Sheets, Tom Sommer, Jani Taskinen, Yasuo Ohgaki, Jakub Vrana, Lars Torben Wilson, Jim Winstead, Jared Wyles та Jeroen van Wolffelaar.\n\n## Інші перекладачі\n\nНайбільш активні перекладачі, що надсилали патчі: Spbima, Тигрович, Іван Ремень, Serg, Wolg, Degit, Nooneon, StelZek, Grul, Alexandr Fedotov, Marina Lagun, Mike, HaJIuBauKa, Sunny, dba, Олександр Тушин.\n\nМи публікуємо імена найактивніших на даний момент перекладачів документації, але ще багато учасників допомагають покращувати довідкові матеріали. І кожен їхній переклад, поправка чи порада — цінний та важливий.\n\nПерекладачі, які раніше брали участь в перекладі керівництва на російську мову (в алфавітному порядку): Олександр Войцеховский, Алексей Asemov, Андрій Демєнев, Антоні Довгал, Боріс Безруков, Данііл Реюжков, Євгеній Суюв, Іріна Гобл, Іван Ковальенко, Olishuk Andrey, Veniamin Zolotukhin.\n\nА також невідомі перекладачі із наступними ніками: freespace, santiago, shafff, sveta.\n","title":"Передмова","contentType":2,"navigation":[{"manual.md":"« Посібник з PHP"},{"getting-started.md":"Приступаючи до роботи»"},{"index.md":"PHP Manual"},{"manual.md":"Посібник з PHP"}]}},"__N_SSG":true}