{"pageProps":{"page":{"slug":"ref.pdo-odbc.md","content":"# Функції ODBC та DB2 (PDO\\_ODBC)\n\n## Вступ\n\nPDO\\_ODBC - драйвер, реализующий[інтерфейс PHP Data Objects (PDO)](intro.pdo.md) для доступу до баз даних через драйвер ODBC або бібліотеку IBM DB2 Call Level Interface (DB2 CLI). На даний момент PDO\\_ODBC підтримує різні \"відтінки\" драйверів баз даних:\n\nibm-db2\n\nПідтримка доступу до серверів IBM DB2 Universal Database, Cloudscape та Apache Derby через вільний клієнт DB2 express-C.\n\nunixODBC\n\nПідтримує доступ до баз даних через менеджер драйверів unixODBC та власні ODBC драйвери баз даних.\n\ngeneric\n\nНадає опцію компіляції менеджерів драйверів ODBC, які не підтримуються PDO\\_ODBC безпосередньо.\n\nУ Windows php\\_pdo\\_odbc.dll має бути включений як модуль у php.ini. Він збирається за участю Windows ODBC Driver Manager, тому PHP може підключатися до будь-якої бази даних, визначеної як System DSN.\n\n## Установка\n\n**PDO\\_ODBC на UNIX системах**\n\n1.  Модуль PDO\\_ODBC включено у вихідний код PHP. Ви можете скомпілювати модуль як статичний або розділяється, використовуючи наступний синтаксис**configure**\n    \n    ibm\\_db2\n    \n    ```\n    ./configure --with-pdo-odbc=ibm-db2,/opt/IBM/db2/V8.1/\n    ```\n    \n    Для збирання PDO\\_ODBC для ibm-db2 потрібно попередньо встановити файли заголовків пакета розробника програм DB2. Заголовкові файли пакета розробника додатків DB2 можна встановити як за допомогою інсталяційного пакета сервера DB2, так і у складі окремого клієнта \"DB2 Application Development Client\", доступного для завантаження з [» сайту підтримки](https://www.ibm.com/developerworks/downloads/im/db2express/index.md)IBM developerWorks.\n    \n    Якщо ви не вкажете директорію установки бібліотек та заголовних файлів DB2,**configure**буде шукати їх у /home/db2inst1/sqllib.\n    \n    unixODBC\n    \n    ```\n    ./configure --with-pdo-odbc=unixODBC,/usr/local\n    ```\n    \n    Якщо ви не вкажете директорію установки бібліотек і файлів заголовків unixODBC,**configure**буде шукати їх у /usr/local.\n    \n    generic\n    \n    ```\n    ./configure --with-pdo-odbc=generic,/usr/local,libname,ldflags,cflags\n    ```\n    \n\n## Обумовлені константи\n\nНаведені нижче константи визначені цим драйвером і будуть доступні лише у випадку, якщо PHP був зібраний за допомогою цього модуля, або модуль був динамічно завантажений під час виконання. Крім того, ці залежні від драйвера константи повинні бути використані лише разом із цим драйвером. Використання атрибутів, специфічних для деякого драйвера з іншим драйвером, може викликати несподівану поведінку. Якщо ваш код виконується з кількома драйверами, можна використовувати функцію [PDO::getAttribute()](pdo.getattribute.md)для получения атрибута\\*\\*`PDO::ATTR_DRIVER_NAME`\\*\\*для проверки драйвера.\n\n**`PDO::ODBC_ATTR_USE_CURSOR_LIBRARY`**(int)\n\nЦей параметр визначає, чи використовується бібліотека курсорів ODBC. Бібліотека курсорів ODBC підтримує деякі додаткові особливості ODBC (наприклад, блокові курсори, що прокручуються), які можуть не реалізовуватися драйвером. Підтримуються такі значення:\n\n-   **`PDO::ODBC_SQL_USE_IF_NEEDED`**(за замовчуванням): використовувати бібліотеку курсорів ODBC, якщо необхідно.\n    \n-   **`PDO::ODBC_SQL_USE_DRIVER`**: ніколи не використовувати бібліотеку курсорів ODBC\n    \n-   **`PDO::ODBC_SQL_USE_ODBC`**: використовувати бібліотеку курсорів ODBC.\n    \n\n**`PDO::ODBC_ATTR_ASSUME_UTF8`**(bool)\n\nЛише для Windows. Якщо **`true`**, то дані в кодуванні UTF-16 (`CHAR` `VARCHAR`и`LONGVARCHAR`) будуть конвертовані в UTF-8 під час читання або запису. Якщо **`false`** (за умовчанням), перетворення кодування символів може бути виконане драйвером.\n\n## Налаштування під час виконання\n\nПоведінка цих функцій залежить від установок у php.ini.\n\n**Конфігураційні опції PDO\\_ODBC**\n\n| Имя | По умолчанию | Место изменения | Список изменений |\n| --- | --- | --- | --- |\n| [pdo\\_odbc.connection\\_pooling](ref.pdo-odbc.md#ini.pdo-odbc.connection-pooling) | \"strict\" | **`INI_ALL`** |  |\n| [pdo\\_odbc.db2\\_instance\\_name](ref.pdo-odbc.md#ini.pdo-odbc.db2-instance-name) | NULL | **`INI_SYSTEM`** | Ця можливість застаріла та *буде* *видалено*в будущем. |\n\nДодаткова інформація та опис режимів INI\\_\\* дано у розділі «[Місця встановлення параметрів конфігурації](configuration.changes.modes.md)».\n\nКоротке пояснення конфігураційних директив.\n\n`pdo_odbc.connection_pooling`string\n\nЧи потрібно поєднувати з'єднання ODBC. Може бути `\"strict\"` `\"relaxed\"`или`\"off\"` (аналогічно `\"\"`). Параметр визначає, як менеджер з'єднань повинен порівнювати параметри з'єднань для вибору, створювати нове з'єднання або повертати вже існуюче. За промовчанням рекомендується використовувати **`strict`**, що означає, що збережене з'єднання повертатиметься лише, якщо всі параметри точно збігаються . **`relaxed`** призведе до того, що закешоване з'єднання буде повернуто, якщо параметри схожі. Це спричинить більш активне використання кеша, але може призвести до витоку інформації про з'єднання (наприклад) між віртуальними хостами.\n\nЦе налаштування можна змінити тільки в php.ini та впливає на всі процеси; всі модулі, завантажені в процес і які використовують ті ж бібліотеки ODBC, залежатимуть від цієї настройки, включаючи [Уніфікований модуль ODBC](ref.uodbc.md)\n\n**Увага**\n\nЗначение\\*\\*`relaxed`\\*\\* не повинно використовуватися на загальному хостингу з метою безпеки.\n\n**Підказка**\n\nЯкщо у вас немає дуже серйозного приводу використовувати значення, відмінне від **`strict`** - Не змінюйте його.\n\n`pdo_odbc.db2_instance_name`string\n\nЯкщо ви скомпілювали PDO\\_ODBC с использованием`db2`, ця опція встановить значення змінної оточення DB2INSTANCE у системах Linux і UNIX, що дорівнює обраному імені екземпляра DB2. Це дозволяє PDO\\_ODBC визначити розташування бібліотек DB2 і з'єднатися з каталогом бази даних DB2.\n\nЦе налаштування можна змінити тільки в php.ini, і воно впливає на всі процеси; всі модулі, завантажені в процес і які використовують ті ж бібліотеки ODBC, залежатимуть від цієї настройки, включаючи [уніфікований модуль ODBC](ref.uodbc.md)\n\nЦя опція не працює у Windows.\n\n## Зміст\n\n-   [PDO\\_ODBC DSN](ref.pdo-odbc.connection.md)— З'єднання з базами даних ODBC або DB2\n","title":"Функції ODBC та DB2 (PDO\\_ODBC)","contentType":2,"navigation":[{"ref.pdo-oci.connection.md":"« PDO\\_OCI DSN"},{"ref.pdo-odbc.connection.md":"PDO\\_ODBC DSN »"},{"index.md":"PHP Manual"},{"pdo.drivers.md":"Драйвери PDO"}]}},"__N_SSG":true}