{"pageProps":{"page":{"slug":"ref.pdo-sqlsrv.md","content":"# Функції модуля PDO\\_SQLSRV для Microsoft SQL Server\n\n## Вступ\n\nPDO\\_SQLSRV - це драйвер, що реалізує інтерфейс [PHP Data Objects (PDO)](intro.pdo.md) для отримання доступу з PHP до баз даних MS SQL Server (починаючи з версії SQL Server 2005) та SQL Azure.\n\n## Установка\n\nОстання версія драйвера доступна для завантаження за посиланням: [» Завантаження SQLSRV](http://msdn.microsoft.com/en-us/sqlserver/ff657782.aspx). Вихідний код драйвера розміщено в [» публічній репозиторії](https://github.com/microsoft/msphpsql)\n\nЗа детальною інформацією про системні вимоги зверніться до розділу [» Системні вимоги SQLSRV](http://msdn.microsoft.com/en-us/library/cc296170.aspx)\n\nУ Windows модуль PDO\\_SQLSRV включається шляхом завантаження та додавання необхідних DLL-файлів у каталог модулів PHP та додавання до файлу php.ini запису, який завантажить модуль.\n\nУ Linux та macOS модуль PDO\\_SQLSRV можно установить из библиотеки[» PECL](https://pecl.php.net/)Подробности смотрите в[» посібнику з встановлення](https://docs.microsoft.com/en-us/sql/connect/php/installation-tutorial-linux-mac)\n\n## Обумовлені константи\n\nНаведені нижче константи визначені цим драйвером і будуть доступні лише у випадку, якщо PHP був зібраний за допомогою цього модуля, або модуль був динамічно завантажений під час виконання. Крім того, ці залежні від драйвера константи повинні бути використані лише разом із цим драйвером. Використання атрибутів, специфічних для деякого драйвера з іншим драйвером, може викликати несподівану поведінку. Якщо ваш код виконується з кількома драйверами, можна використовувати функцію [PDO::getAttribute()](pdo.getattribute.md)для получения атрибута\\*\\*`PDO::ATTR_DRIVER_NAME`\\*\\*для проверки драйвера.\n\n**`PDO::SQLSRV_TXN_READ_UNCOMMITTED`**(int)\n\nЦя константа - допустиме значення для ключа TransactionIsolation SQLSRV DSN. Встановлює рівень ізоляції транзакцій для з'єднання значення Read Uncommitted.\n\n**`PDO::SQLSRV_TXN_READ_COMMITTED`**(int)\n\nЦя константа - допустиме значення для ключа TransactionIsolation SQLSRV DSN. Встановлює рівень ізоляції транзакцій для з'єднання значення Read Committed.\n\n**`PDO::SQLSRV_TXN_REPEATABLE_READ`**(int)\n\nЦя константа - допустиме значення для ключа TransactionIsolation SQLSRV DSN. Встановлює рівень ізоляції транзакцій для з'єднання значення Repeateable Read.\n\n**`PDO::SQLSRV_TXN_SNAPSHOT`**(int)\n\nЦя константа - допустиме значення для ключа TransactionIsolation SQLSRV DSN. Встановлює рівень ізоляції транзакцій для з'єднання значення Snapshot.\n\n**`PDO::SQLSRV_TXN_SERIALIZABLE`**(int)\n\nЦя константа - допустиме значення для ключа TransactionIsolation SQLSRV DSN. Встановлює рівень ізоляції транзакцій для з'єднання значення Serializable.\n\n**`PDO::SQLSRV_ENCODING_BINARY`**(int)\n\nВизначає, що дані відправляються/виходять у вигляді потоку байтів до сервера без виконання перетворення кодування або іншого перетворення. Константа може бути передана функції PDOStatement::setAttribute, PDO::prepare, PDOStatement::bindColumn і PDOStatement::bindParam.\n\n**`PDO::SQLSRV_ENCODING_SYSTEM`**(int)\n\nВизначає, що дані відправляються/виходять до/від сервера в 8-бітному кодуванні локалі Windows, встановленої в системі. Усі мультибайтові символи та символи, що не перетворюються на це кодування, замінюються символом питання (?). Константа може бути передана до функцій PDOStatement::setAttribute, PDO::setAttribute, PDO::prepare, PDOStatement::bindColumn і PDOStatement::bindParam.\n\n**`PDO::SQLSRV_ENCODING_UTF8`**(int)\n\nВизначає, що дані відправляються/виходять до/від сервера в кодуванні UTF-8. Константа може бути передана до функцій PDOStatement::setAttribute, PDO::setAttribute, PDO::prepare, PDOStatement::bindColumn і PDOStatement::bindParam.\n\n**`PDO::SQLSRV_ENCODING_DEFAULT`**(int)\n\nВизначає, що дані відправляються/виходять до/від сервера відповідно до значення PDO::SQLSRV\\_ENCODING\\_SYSTEM, вказаному під час підключення. Для підключення може використовуватися кодування, вказане під час підготовки виразу. Константа може бути передана до функцій PDOStatement::setAttribute, PDO::setAttribute, PDO::prepare, PDOStatement::bindColumn і PDOStatement::bindParam.\n\n**`PDO::SQLSRV_ATTR_QUERY_TIMEOUT`**(int)\n\nНегативне ціле число, що відображає час очікування в секундах. Нуль (0) - це значення за промовчанням, що означає, що час очікування не враховується. Константа може бути передана функції PDOStatement::setAttribute, PDO::setAttribute і PDO::prepare.\n\n**`PDO::SQLSRV_ATTR_DIRECT_QUERY`**(int)\n\nПоказує, що запит має бути негайно виконаний, без підготовки виразу. Константа може бути передана функції PDO::setAttribute і PDO::prepare. За подробицями зверніться до розділу документації [» Негайне виконання виразів та виконання підготовлених виразів](http://msdn.microsoft.com/en-us/library/ff754356.aspx)\n\n## Зміст\n\n-   [PDO\\_SQLSRV DSN](ref.pdo-sqlsrv.connection.md)— Підключення до баз даних MS SQL Server та SQL Azure\n","title":"Функції модуля PDO\\_SQLSRV для Microsoft SQL Server","contentType":2,"navigation":[{"ref.pdo-mysql.connection.md":"« PDO\\_MYSQL DSN"},{"ref.pdo-sqlsrv.connection.md":"PDO\\_SQLSRV DSN »"},{"index.md":"PHP Manual"},{"pdo.drivers.md":"Драйвери PDO"}]}},"__N_SSG":true}