{"pageProps":{"page":{"slug":"regexp.reference.delimiters.md","content":"## Розділювачі\n\nПри использовании любой PCRE функции необходимо заключать шаблон в*роздільники*. Розділювачем може бути будь-який символ, що не є буквою, цифрою, зворотною косою рисою або будь-яким пробіловим символом. Прогалини спочатку перед коректним роздільником ігноруються.\n\nЧасто використовуваними роздільниками є косі риси ( ), знаки грати (`#`) та тильди (`~`). Нижче наведено приклади шаблонів з коректними роздільниками.\n\n```\n/foo bar/\n#^[^0-9]$#\n+php+\n%[a-zA-Z0-9_-]%\n```\n\nТакож можна використовувати роздільник у вигляді дужок, де стартовий і завершальний роздільники є відповідно дужками, що відкриває і закриває. . `()` `{}` `[]`и`<>` є допустимими парами роздільників.\n\n```\n(this [is] a (pattern))\n{this [is] a (pattern)}\n[this [is] a (pattern)]\n<this [is] a (pattern)>\n```\n\nРозділювачі у вигляді дужок не потрібно екранувати, якщо вони також використовуються як метасимволи у шаблоні, але як і з іншими роздільниками їх потрібно екранувати, якщо вони використовуються безпосередньо як символи.\n\nЯкщо потрібно використовувати роздільник усередині шаблону, його потрібно проекранувати за допомогою зворотної косої межі. Якщо розділювач часто використовується в шаблоні, з метою зручності читання, краще вибрати інший роздільник для цього шаблону.\n\n```\n/http:\\/\\//\n#http://#\n```\n\nФункция[preg\\_quote()](function.preg-quote.md) може бути використана для екранування рядка, що використовується в шаблоні, а її необов'язковий другий параметр дозволяє вказати роздільник, що використовується.\n\nПісля закриваючого роздільника можна використовувати [модифікатори шаблонів](reference.pcre.pattern.modifiers.md). Нижче наведено приклад реєстронезалежного пошуку:\n\n```\n#[a-z]#i\n```\n","title":"Розділювачі","contentType":2,"navigation":[{"regexp.introduction.md":"« Вступ"},{"regexp.reference.meta.md":"Метасимволи »"},{"index.md":"PHP Manual"},{"reference.pcre.pattern.syntax.md":"Опис синтаксису Perl-сумісних регулярних виразів"}]}},"__N_SSG":true}