{"pageProps":{"page":{"slug":"regexp.reference.character-classes.md","content":"## Символьні класи\n\nВідкриваюча квадратна дужка оголошує початок символьного класу, що завершується квадратною дужкою, що закриває. Символ «\\]» не має спеціального значення, і Якщо закриваюча квадратна дужка необхідна як член символьного класу, вона повинна бути першим символом безпосередньо після квадратної дужки (якщо вказано метасимвол «^», то безпосередньо після нього), або екрануватися за допомогою зворотного сліша.\n\nСимвольний клас відповідає одиночному символу рядка, причому сам символ повинен утримуватися в наборі, що визначається класом. Якщо першим йде символ опису класу - \"^\", логіка роботи інвертується: клас відповідає одиночному символу, який не міститься в наборі, що визначається класом. Якщо символ \"^\" потрібен як член класу, його не потрібно поміщати першим символом в описі класу, або необхідно екранувати за допомогою зворотного слішу.\n\nНаприклад, символьний клас \\[aeiou\\] відповідає будь-який голосної літери в нижньому регістрі, в той час, як \\[^aeiou\\] відповідає будь-якому символу, що не є голосною літерою нижнього регістру. Слід розуміти, що символ «^» всього лише зручний інструмент для опису символів, що не використовуються в зіставленні, це не твердження, так як він все ж таки займає символ в рядку, що обробляється, і не збігається, якщо поточна позиція порівняння знаходиться в кінці рядка.\n\nЯкщо реєструється незалежне зіставлення, будь-яка буква символьного класу відповідає як своєму верхньому, так і нижньому регістру. Таким чином, символьний клас \\[aeiou\\] відповідає як \"A\", так і \"a\". Аналогічно, клас \\[^aeiou\\] не відповідає ні «A», ні «a», тоді як у реєстрозалежному режимі збіг відбувся б.\n\nВсередині символьного класу символ перекладу рядка «\\\\n» немає спеціального значення, незалежно від наявності модифікаторів [PCRE\\_DOTALL](reference.pcre.pattern.modifiers.md) і [PCRE\\_MULTILINE](reference.pcre.pattern.modifiers.md). Символьні класи, побудовані на запереченні, наприклад \\[^a\\], завжди відповідають символу перекладу рядка.\n\nСимвол минус «-» (дефис) внутри класса используется для задания символьного диапазона. НаПриклад,\\[d-m\\] відповідає будь-якому символу, що знаходиться між \"d\" і \"m\", включаючи самі символи \"d\" та \"m\". Якщо \"-\" необхідний, як член класу, він повинен знаходитися в такій позиції, в якій він не може інтерпретуватися як діапазон (як правило, це перший і останній символ опису класу), або екрануватись за допомогою зворотного слішу.\n\nНеприпустимо використовувати квадратну дужку, що закриває.\\]» як межа символьного діапазону. Наприклад, шаблон «\\[W-\\]46\\]» буде інтерпретований як символьний клас, що складається з двох символів («W» і «-»), за якими слідує рядок «46\\]», таким чином шаблон відповідатиме рядкам «W46\\]» або «-46\\]». Щоб все ж таки використовувати символ «\\]» в описі діапазону його необхідно екранувати зворотним слешем, наприклад, шаблон \\[W-\\\\\\]46\\] буде інтерпретований як символьний клас, що складається із символьного діапазону разом із двома наступними символами «4» та «6». Такого ж результату можна досягти, використовуючи шістнадцяткове або вісімкове уявлення символу «\\]».\n\nДля побудови символьних діапазонів використовується ASCII уявлення символів. Таким чином, прикордонні символи можна задавати безпосередньо в числовому поданні, наприклад, \\[\\\\000-\\\\037\\]. Якщо виконується незалежний пошук, символи, описані в діапазоні, також відповідатимуть символам обох регістрів. Наприклад, діапазони \\[W-c\\]и\\[\\]\\[\\\\^\\_\\`wxyzabc\\] еквівалентні (у разі реєстронезалежного пошуку). Наприклад, якщо встановлено локаль \"fr\" (Франція), можна використовувати \\[\\\\xc8-\\\\xcb\\] для завдання відповідності ударному \"E\" в обох регістрах.\n\nЗагальні типи символів \\\\d,\\\\D,\\\\s,\\\\S,\\\\w и\\\\W також можна використовувати у символьних класах, додаючи у клас ті символи, яким відповідають. Наприклад, клас \\[\\\\dABCDEF\\] відповідає будь-якій шістнадцятковій цифрі. Символ «^» може використовуватися разом із загальним типом, взятим у верхньому регістрі, для зазначення вужчого набору символів. Наприклад, клас \\[^\\\\W\\_\\] відповідає будь-якій букві чи цифрі, але не символу підкреслення.\n\nУсі не буквено-цифрові символи, крім \\\\, -, ^ (спочатку) і завершального «\\]», не є спеціальними символами, але використання екрануючого слюшу перед ними не зашкодить. Символ кінця шаблону завжди є особливим випадком і завжди має бути проекранований усередині виразу.\n\nPerl підтримує нотацію POSIX для класів символів. Це включає використання імен, укладених у `[:`и`:]`, у свою чергу ув'язнених у квадратні дужки. PCRE також підтримує цей запис. Наприклад, `[01[:alpha:]%]` збігається з \"0\", \"1\", будь-яким алфавітним символом або \"%\". Підтримуються такі імена класів:\n\n<table class=\"doctable table\"><caption><strong>Символьні класи</strong></caption><tbody class=\"tbody\"><tr><td><code class=\"literal\">alnum</code></td><td>літери та цифри</td></tr><tr><td><code class=\"literal\">alpha</code></td><td>літери</td></tr><tr><td><code class=\"literal\">ascii</code></td><td>символи з кодами 0–127</td></tr><tr><td><code class=\"literal\">blank</code></td><td>тільки пробіл або символ табуляції</td></tr><tr><td><code class=\"literal\">cntrl&lt; /code&gt;</code></td><td>керуючі символи</td></tr><tr><td><code class=\"literal\">digit</code></td><td>десяткові цифри (тобто те ж саме, що й \\d)</td></tr><tr><td><code class=\"literal\">graph</code></td><td>друковані символи, крім пробілів</td></tr><tr><td><code class=\"literal\">lower</code></td><td>малі літери</td></tr><tr><td><code class=\"literal\">print</code></td><td>друковані символи, включаючи пропуск</td></tr><tr><td><code class=\"literal\">punct</code>&lt; /td&gt;</td><td>друковані символи, за винятком букв і цифр</td></tr><tr><td><code class=\"literal\">space</code></td><td>пробельні символи( майже те саме, що і \\s)</td></tr><tr><td><code class=\"literal\">upper</code></td><td>великі літери</td></tr><tr><td><code class=\"literal\">word</code></td><td>символи «слова» (те саме, що й \\w)</td></tr><tr><td><code class=\"literal\">xdigit</code></td><td>шістнадцяткові цифри</td></tr></tbody></table>\n\nКлас пробілових символів (`space`) — це горизонтальна табуляція (HT, 9), переклад рядка (LF, 10), вертикальна табуляція (VT, 11), розрив сторінки (FF, 12), повернення каретки (CR, 13) та пропуск (32). Зверніть увагу, що цей список включає вертикальну табуляцію (VT, код 11). Це відрізняє «space» від `\\s`, який не містить цього символу (для сумісності з Perl).\n\nНазвание`word` - це модуль Perl, а `blank` – модуль GNU, починаючи з версії Perl 5.8. Інший модуль Perl – це заперечення, яке вказується символом `^`после двоеточия. НаПриклад,`[12[:^digit:]]` збігається з «1», «2», або з будь-якою нецифрою.\n\nУ режимі UTF-8 символи зі значеннями, що перевищують 128, не співпадуть з жодним із символьних класів POSIX. Починаючи з libpcre 8.10, деякі символьні класи змінені, щоб використовувати властивості символів Unicode, у цьому випадку згадане обмеження не застосовується. Читайте [»Керівництво PCRE(3)](http://www.pcre.org/pcre.txt) для подробиць.\n\nВластивості символів Unicode можуть виникнути всередині класу. Вони не можуть бути частиною діапазону. Символ мінус (дефіс), після символьного класу Unicode буде збігатися буквально. Спроба закінчити діапазон за допомогою властивості символу Unicode викликає попередження.\n","title":"Символьні класи","contentType":2,"navigation":[{"regexp.reference.dot.md":"« Метасимвол крапка"},{"regexp.reference.alternation.md":"Альтернативний вибір »"},{"index.md":"PHP Manual"},{"reference.pcre.pattern.syntax.md":"Опис синтаксису Perl-сумісних регулярних виразів"}]}},"__N_SSG":true}