{"pageProps":{"page":{"slug":"reserved.variables.server.md","content":"# $\\_SERVER\n\n(PHP 4 >= 4.1.0, PHP 5, PHP 7, PHP 8)\n\n$\\_SERVER — Інформація про сервер та середовище виконання\n\n### Опис\n\nЗмінна $\\_SERVER - це масив (array), що містить таку інформацію, як заголовки, шляхи та розташування скриптів. Записи в цьому масиві створюються веб-сервером, тому немає гарантії, що кожен веб-сервер надаватиме будь-яку з цих змінних; сервери можуть опускати деякі з них або надавати інші, не вказані тут. Проте більшість із цих змінних враховано у специфікації [» CGI/1.1](http://www.faqs.org/rfcs/rfc3875) і, швидше за все, буде визначено.\n\n> **Зауваження**: При запуске PHP в[командному рядку](features.commandline.md) більшість із цих записів будуть недоступні або не матимуть жодного значення.\n\nНа додаток до наведених нижче елементів, PHP буде створювати додаткові елементи зі значеннями із заголовків запитів. У елементів буде ім'я `HTTP_`, За яким слідує ім'я заголовка, написане з великої літери та з підкресленням замість дефісу. Наприклад, заголовок `Accept-Language`будет доступен как`$_SERVER['HTTP_ACCEPT_LANGUAGE']`\n\n### Індекси\n\n'PHP\\_SELF'\n\nІм'я файлу скрипта, який зараз виконується, щодо кореня документів. Наприклад, $\\_SERVER\\['PHP\\_SELF'\\]в скрипте по адресу[http://example.com/foo/bar.php](http://example.com/foo/bar.php)будет /foo/bar.php. Константа[\\_\\_FILE\\_\\_](language.constants.predefined.md) містить повний шлях та ім'я файлу поточного (тобто підключеного) файлу. Якщо PHP запущено у командному рядку, ця змінна містить ім'я скрипта.\n\n'[argv](reserved.variables.argv.md)'\n\nМасив аргументів переданих скрипту. Коли скрипт запущено у командному рядку, це дає C-подібний доступ до параметрів командного рядка. Коли викликається через метод GET, цей масив міститиме рядок запиту.\n\n'[argc](reserved.variables.argc.md)'\n\nМістить кількість параметрів, переданих скрипту (якщо запуск здійснено в командному рядку).\n\n'GATEWAY\\_INTERFACE'\n\nМістить версію специфікації CGI, що використовується сервером; наприклад `'CGI/1.1'` .. .\n\n'SERVER\\_ADDR'\n\nIP-адреса сервера, на якому виконується поточний скрипт.\n\n'SERVER\\_NAME'\n\nІм'я хоста, де виконується поточний скрипт. Якщо скрипт виконується на віртуальному хості, тут буде міститись ім'я, визначене для цього віртуального хоста.\n\n> **Зауваження**: В Apache 2 необходимо установить`UseCanonicalName = On`и`ServerName`. Інакше це значення відобразить ім'я хоста, надане клієнтом, яке можна підробити. Небезпечно покладатися на це значення в контексті, що потребує безпеки.\n\n'SERVER\\_SOFTWARE'\n\nРядок ідентифікації сервера, вказаний у заголовках, коли відбувається відповідь на запит.\n\n'SERVER\\_PROTOCOL'\n\nІм'я та версія інформаційного протоколу, через який було запрошено сторінку; наприклад `'HTTP/1.0'`\n\n'REQUEST\\_METHOD'\n\nЯкий метод використали для запиту сторінки; наприклад `'GET'` `'HEAD'` `'POST'` `'PUT'`\n\n> **Зауваження** :\n> \n> PHP-скрипт завершується після надсилання заголовків (тобто після того, як здійснюється будь-який висновок без буферизації виводу), якщо метод запиту був `HEAD`\n\n'REQUEST\\_TIME'\n\nТимчасова позначка початку запиту.\n\n'REQUEST\\_TIME\\_FLOAT'\n\nТимчасова позначка початку запиту з точністю до мікросекунд.\n\n'QUERY\\_STRING'\n\nРядок запиту, якщо є, через яку було відкрито сторінку.\n\n'DOCUMENT\\_ROOT'\n\nДиректорія кореня документів, в якій виконується поточний скрипт, точно та, що вказана в конфігураційному файлі сервера.\n\n'HTTPS'\n\nПриймає непусте значення, якщо запит було здійснено через протокол HTTPS.\n\n'REMOTE\\_ADDR'\n\nIP-адреса, з якої користувач переглядає поточну сторінку.\n\n'REMOTE\\_HOST'\n\nВіддалений хост, з якого користувач переглядає поточну сторінку. Зворотний пошук DNS базується на значенні змінної REMOTE\\_ADDR.\n\n> **Зауваження**: Сервер повинен бути налаштований, щоб створювати цю змінну. Наприклад, в Apache потрібна присутність директиви `HostnameLookups On` у файлі httpd.conf, щоб ця змінна створювалася. Дивіться також [gethostbyaddr()](function.gethostbyaddr.md)\n\n'REMOTE\\_PORT'\n\nПорт на дистанційній машині, який використовується для зв'язку з сервером.\n\n'REMOTE\\_USER'\n\nАвтентифікований користувач.\n\n'REDIRECT\\_REMOTE\\_USER'\n\nАутентифікований користувач, якщо запит перенаправлено зсередини.\n\n'SCRIPT\\_FILENAME'\n\nАбсолютний шлях до скрипту.\n\n> **Зауваження** :\n> \n> Якщо скрипт запускається в командному рядку (CLI), використовуючи відносний шлях, такий як file.php або ../file.php, змінна $\\_SERVER\\['SCRIPT\\_FILENAME'\\] міститиме відносний шлях, вказаний користувачем.\n\n'SERVER\\_ADMIN'\n\nЦя змінна набуває свого значення (для Apache) з директиви конфігураційного файлу сервера. Якщо скрипт запущено на віртуальному хості, це буде значення, визначене для цього віртуального хоста.\n\n'SERVER\\_PORT'\n\nПорт на комп'ютері сервера, який використовує сервер для з'єднання. Для установок за замовчуванням, значення буде `'80'`; використовуючи SSL, наприклад, це значення буде таким, яке налаштовано для з'єднань безпечного HTTP.\n\n> **Зауваження**: Щоб отримати фізичний (реальний) порт в Apache 2, необхідно встановити `UseCanonicalName = On`и`UseCanonicalPhysicalPort = On`, інакше це значення може бути підмінено і не повернути реальне значення фізичного порту. Покладатися на це значення є небезпечним у контексті додатків, що потребують посиленої безпеки.\n\n'SERVER\\_SIGNATURE'\n\nРядок, що містить версію сервера та ім'я віртуального хоста, які додаються до сторінок, що генеруються сервером, якщо включено.\n\n'PATH\\_TRANSLATED'\n\nШлях файлової системи (не document root) до поточного скрипту після того, як сервер виконав відображення virtual-to-real.\n\n> **Зауваження**: Користувачі Apache 2 можуть використовувати директиву. `AcceptPathInfo = On` у конфігураційному файлі httpd.conf для завдання змінної PATH\\_INFO.\n\n'SCRIPT\\_NAME'\n\nМістить шлях до поточного виконуваного скрипту. Це корисно для сторінок, які повинні вказувати на себе. Константа [\\_\\_FILE\\_\\_](language.constants.predefined.md) містить повний шлях та ім'я поточного (тобто включеного) файлу.\n\n'REQUEST\\_URI'\n\nURI, який було надано для доступу до цієї сторінки. Наприклад, '`/index.md`'.\n\n'PHP\\_AUTH\\_DIGEST'\n\nПри виконанні аутентифікації HTTP Digest цій змінній надається заголовок 'Authorization', надісланий клієнтом (який потім слід використовувати для проведення відповідної перевірки).\n\n'PHP\\_AUTH\\_USER'\n\nПри виконанні HTTP-автентифікації цієї змінної надається ім'я користувача, надане користувачем.\n\n'PHP\\_AUTH\\_PW'\n\nПри виконанні HTTP-автентифікації цієї змінної надається пароль, наданий користувачем.\n\n'AUTH\\_TYPE'\n\nПри виконанні HTTP-автентифікації цій змінній надається тип автентифікації, який використовується.\n\n'PATH\\_INFO'\n\nМістить будь-який наданий користувачем шлях, що міститься після імені скрипта, але до рядка запиту, якщо він є. Наприклад, якщо поточний скрипт запрошений на URL [http://www.example.com/php/path\\\\\\_info.php/some/stuff?foo=bar](http://www.example.com/php/path%5C_info.php/some/stuff?foo=bar), то змінна $\\_SERVER\\['PATH\\_INFO'\\] міститиме `/some/stuff`\n\n'ORIG\\_PATH\\_INFO'\n\nВихідне значення змінної 'PATH\\_INFO' перед обробкою PHP.\n\n### Приклади\n\n**Приклад #1 Приклад використання $\\_SERVER**\n\n```php\n<?php\necho $_SERVER['SERVER_NAME'];\n?>\n```\n\nВисновок наведеного прикладу буде схожим на:\n\n```\nwww.example.com\n```\n\n### Примітки\n\n> **Зауваження** :\n> \n> Це «суперглобальна» чи автоматична глобальна змінна. Це просто означає, що вона доступна у всіх контекстах скрипту. Немає необхідності виконувати **global $variable;** для доступу до неї всередині методу чи функції.\n\n### Дивіться також\n\n-   [Фільтрування даних](book.filter.md)\n","title":"$\\_SERVER","contentType":2,"navigation":[{"reserved.variables.globals.md":"« $GLOBALS"},{"reserved.variables.get.md":"$\\_GET »"},{"index.md":"PHP Manual"},{"reserved.variables.md":"Зумовлені змінні"}]}},"__N_SSG":true}