{"pageProps":{"page":{"slug":"security.variables.md","content":"# Дані, введені користувачем\n\nНайбільш небезпечні вразливості у багатьох PHP-скриптах виникають не стільки через саму мову, скільки через код, написаний без урахування відповідних вимог безпеки. Як наслідок, ви завжди повинні виділяти час на дослідження ділянки коду, що розробляється, щоб оцінити потенційну загрозу від введення змінної з нестандартним значенням.\n\n**Приклад #1 Потенційно небезпечне використання змінних**\n\n```php\n<?php\n// удалить файлы из домашней директории пользователя...\n// а может, из ещё какой-нибудь?\nunlink ($evil_var);\n\n// записать в лог-файл выполняемое действие...\n// а может быть в /etc/passwd?\nfwrite ($fp, $evil_var);\n\n// выполнение тривиальных действий... или rm -rf *?\nsystem ($evil_var);\nexec ($evil_var);\n\n?>\n```\n\nВи повинні ретельно перевіряти ваш код і бути абсолютно впевнені в тому, що всі дані, що надсилаються веб-браузером, перевіряються належним чином. Спробуйте відповісти собі на такі вопросы:\n\n-   Чи впливатиме цей скрипт виключно на передбачувані дані?\n-   Чи можуть бути оброблені некоректні чи нестандартні дані?\n-   Чи можливе використання скрипту непередбаченим способом?\n-   Чи можливе його використання у поєднанні з іншими скриптами в негативних цілях?\n-   Чи буде кожна транзакція коректно логована?\n\nВідповівши на ці запитання під час написання скрипта, а не після, ви, можливо, запобігте подальшому доробку скрипту з метою підвищення його безпеки. Починаючи з цих питань, ви не гарантуєте повну безпеку вашої системи, але зможете значно підвищити її.\n\nВи також можете розглянути відключення таких конфігураційних опцій, як register\\_globals, magic\\_quotes та деяких інших, які можуть призводити до сумнівів щодо походження чи значення одержуваних змінних. Використання під час написання PHP-коду режиму error\\_reporting(E\\_ALL) може допомогти попередити вас про використання змінних до ініціалізації або перевірки (що запобігатиме роботі з даними, відмінними від очікуваних).\n","title":"Дані, введені користувачем","contentType":2,"navigation":[{"security.errors.md":"« Повідомлення про помилки"},{"security.hiding.md":"Приховування PHP »"},{"index.md":"PHP Manual"},{"security.md":"Безпека"}]}},"__N_SSG":true}