{"pageProps":{"page":{"slug":"security.cgi-bin.attacks.md","content":"## Можливі атаки\n\nВикористання PHP як бінарного CGI-Програми є одним з варіантів, коли з яких-небудь причин небажано інтегрувати PHP у веб-сервер (наприклад, Apache) як модуль, або передбачається використання різних CGI-обгорток та таких утиліт, як chroot та setuid для організації безпечного оточення роботи скриптів. Така установка зазвичай супроводжується копіюванням виконуваного файлу PHP до директорії cgi-bin веб-сервера. CERT (організація, яка стежить за загрозами безпеці) [» CA-96.11](http://www.cert.org/advisories/CA-1996-11.md) рекомендує не поміщати будь-які інтерпретатори до каталогу cgi-bin. Навіть якщо PHP використовується як самостійний інтерпретатор, він спроектований так, щоб запобігти можливості наступних атак:\n\n-   Доступ до системних файлів:[http://my.host/cgi-bin/php?/etc/passwd](http://my.host/cgi-bin/php?/etc/passwd)Дані, введені в рядку запиту (URL) після знака запитання, передаються інтерпретатору як аргументи командного рядка за допомогою інтерфейсу CGI. Зазвичай інтерпретатори відкривають та виконують файл, вказаний як перший аргумент. У разі використання PHP як CGI-додатка він не буде інтерпретувати аргументи командного рядка.\n-   Доступ до довільного документа на сервері:[http://my.host/cgi-bin/php/secret/doc.md](http://my.host/cgi-bin/php/secret/doc.md)Відповідно до загальноприйнятої угоди, частина шляху в запитаній сторінці, яка розташована після імені модуля PHP, /secret/doc.md, використовується для вказівки файлу, який буде інтерпретований CGI-програмою. Зазвичай, деякі параметри конфігурації веб-сервера (наприклад, Action для сервера Apache) використовуються для перенаправлення документа, наприклад, для перенаправлення запитів виду[http://my.host/secret/script.php](http://my.host/secret/script.php)інтерпретатор PHP. У такому разі веб-сервер спочатку перевіряє права доступу до директорії /secret, і після цього створює перенаправлений запит[http://my.host/cgi-bin/php/secret/script.php](http://my.host/cgi-bin/php/secret/script.php). На жаль, якщо запит спочатку задано у повному вигляді, перевірка на наявність прав для файлу /secret/script.php не виконується, вона відбувається лише для файлу /cgi-bin/php. Таким чином, користувач може звернутися до /cgi-bin/php, і, як наслідок, до будь-якого захищеного документа на сервері. Якщо в PHP вказати під час виконання скрипту опції[cgi.force\\_redirect](ini.core.md#ini.cgi.force-redirect) [doc\\_root](ini.core.md#ini.doc-root) і [user\\_dir](ini.core.md#ini.user-dir), то можна запобігти подібним атакам для директорій з обмеженим доступом. Більш детально наведені опції та їх комбінації будуть розглянуті нижче.\n","title":"Можливі атаки","contentType":2,"navigation":[{"security.cgi-bin.md":"« Якщо PHP встановлено як CGI"},{"security.cgi-bin.default.md":"Варіант 1: обслуговуються лише загальнодоступні файли »"},{"index.md":"PHP Manual"},{"security.cgi-bin.md":"Якщо PHP встановлено як CGI"}]}},"__N_SSG":true}