{"pageProps":{"page":{"slug":"session.security.ini.md","content":"## INI-налаштування безпеки сесій\n\nНадаючи INI-налаштування, пов'язані з сесіями, ви можете покращити безпеку сесій. Деякі важливі параметри безпеки не мають рекомендованих значень. Ви самі несете відповідальність за вибір необхідних значень.\n\n-   [session.cookie\\_lifetime](session.configuration.md#ini.session.cookie-lifetime)\\=\n    \n    має особливе значення. Він повідомляє браузеру не зберігати cookie у постійне сховище. Отже, коли браузер закривається, сесійні cookie відразу видаляються. Якщо встановити значення, відмінне від 0, це може дозволити іншим користувачам використовувати ці cookie. Найчастіше найкраще використовувати \" \".\n    \n    Якщо потрібна функціональність автологіну, реалізовуйте його самостійно і ніколи не використовуйте для цього сесії. Докладніше викладено у відповідних розділах.\n    \n-   [session.use\\_cookies](session.configuration.md#ini.session.use-cookies)\\=On\n    \n    [session.use\\_only\\_cookies](session.configuration.md#ini.session.use-only-cookies)\\=On\n    \n    Незважаючи на те, що HTTP-cookie мають деякі проблеми, все ж вони найкращі для зберігання ідентифікатора сесії. Коли це можливо, для керування ідентифікаторами сесій необхідно використовувати cookie. Більшість програм повинні використовувати cookie для ідентифікатора сесії.\n    \n    Якщо [session.use\\_only\\_cookies](session.configuration.md#ini.session.use-only-cookies)\\=Off, модуль сесії буде використовувати ідентифікатор, встановлений через GET або POST, якщо cookie не була виставлена ​​заздалегідь.\n    \n-   [session.use\\_strict\\_mode](session.configuration.md#ini.session.use-strict-mode)\\=On\n    \n    Вкрай рекомендується включати[session.use\\_strict\\_mode](session.configuration.md#ini.session.use-strict-mode). За промовчанням не увімкнено.\n    \n    Це не дозволить сесійному модулю використовувати неініціалізовані ідентифікатори сесій. Іншими словами, сесійний модуль прийматиме лише коректні ідентифікатори, згенеровані ним же і ігноруватиме ідентифікатори створені на стороні користувача.\n    \n    Из-за особенностей спецификации cookie, атакующий может сделать cookie с идентификатором сессии неудаляемой с помощью локальной базы cookie или JavaScript-инъекцией . [session.use\\_strict\\_mode](session.configuration.md#ini.session.use-strict-mode)може не дати атакуючого використовувати цей ідентифікатор.\n    \n    > **Зауваження** :\n    > \n    > Атакуючі можуть ініціалізувати ідентифікатор сесії на своєму пристрої та виставити його жертві. Вони мають підтримувати сесію в активному стані для зловживань. Атакуючим знадобиться вжити додаткових дій для проведення атаки за цим сценарієм. Тому[session.use\\_strict\\_mode](session.configuration.md#ini.session.use-strict-mode)служить як запобігання цьому.\n    \n-   [session.cookie\\_httponly](session.configuration.md#ini.session.cookie-httponly)\\=On\n    \n    Забороняє доступ до сесійної cookie для JavaScript. Ця опція запобігає крадіжці cookie за допомогою JavaScript-ін'єкції.\n    \n    Сесійний ID можна використовувати як захисний ключ CSRF, але не рекомендується. Наприклад, HTML може бути збережений та надісланий іншому користувачеві. Розробник не повинен записувати сесійний ID усередині сторінки для підвищення безпеки. Майже всі програми повинні використовувати атрибут httponly для сесійної cookie.\n    \n    > **Зауваження** :\n    > \n    > Захисний ключ CSRF має періодично оновлюватись, як і ідентифікатор сесії.\n    \n-   [session.cookie\\_secure](session.configuration.md#ini.session.cookie-secure)\\=On\n    \n    Дозволяє отримувати доступ до cookie ідентифікатора сесії лише за умови використання протоколу HTTPS. Якщо ваш сайт використовує лише протокол HTTPS, необхідно включити цю опцію.\n    \n    Для таких сайтів слід також розглядати використання HSTS.\n    \n-   [session.cookie\\_samesite](session.configuration.md#ini.session.cookie-samesite)\\=\"Lax\" або [session.cookie\\_samesite](session.configuration.md#ini.session.cookie-samesite)\\=\"Strict\"\n    \n    Починаючи з PHP 7.3, можна встановити cookie-прапор`\"SameSite\"`для ідентифікатора cookie сесії. Цей прапор є способом пом'якшення атак CSRF (міжсайтова підробка запиту).\n    \n    Різниця між Lax і Strict полягає в доступності cookie в запитах, що виходять з іншого домену, що реєструється з використанням HTTP-методу GET. Cookie, що використовують Lax, будуть доступні в GET-запиті, що виходить з іншого домену, що реєструється, тоді як cookie, що використовують Strict, не будуть.\n    \n-   [session.gc\\_maxlifetime](session.configuration.md#ini.session.gc-maxlifetime)\\=\\[вибрати найменший із можливих\\]\n    \n    [session.gc\\_maxlifetime](session.configuration.md#ini.session.gc-maxlifetime)налаштування для видалення застарілих ідентифікаторів сесій. Покладатись на цю опцію категорично*не*рекомендується. Ви повинні керувати життєвим циклом сесії самостійно.\n    \n    Сесійний збирач сміття GC (garbage collection) краще використовувати за допомогою[session\\_gc()](function.session-gc.md)ю[session\\_gc()](function.session-gc.md)найкраще запускати через планувальник, наприклад, cron на\\*nix-системах.\n    \n    За замовчуванням GC працює на принципі імовірності. Це налаштування*не*гарантує видалення старих сесій. Розробнику не слід покладатися на це налаштування, але все одно рекомендується виставити його мінімально можливим значенням. Налаштовуйте[session.gc\\_probability](session.configuration.md#ini.session.gc-probability) і [session.gc\\_divisor](session.configuration.md#ini.session.gc-divisor)так, щоб застарілі сесії видалялися досить часто. Якщо потрібна функціональність автологіну, реалізуйте його самостійно і ніколи не використовуйте для цього сесії.\n    \n    > **Зауваження** :\n    > \n    > Деякі обробники сесій не використовують механізм старіння сесій на основі ймовірностей. Наприклад, memcached, memcache. Читайте відповідну документацію для більш повної інформації.\n    \n-   [session.use\\_trans\\_sid](session.configuration.md#ini.session.use-trans-sid)\\=Off\n    \n    Використання прозорого керування сесійним ID не рекомендується. Ви можете використовувати його, якщо потрібно. Однак, відключення прозорого управління підвищує безпеку сесій загалом, прибираючи можливість ін'єкції сесійного ID та його крадіжки.\n    \n    > **Зауваження** :\n    > \n    > Ідентифікатор сесії може витекти через закладку в браузері, URL надісланий поштою, збережений вихідний HTML.\n    \n-   [session.trans\\_sid\\_tags](session.configuration.md#ini.session.trans-sid-tags)\\=\\[ігноровані теги\\]\n    \n    (PHP 7.1.0 >=) Ви не повинні перезаписувати непотрібні HTML-теги. Значення за промовчанням має бути достатньою для більшості випадків. Старі версії PHP для цього використовують [url\\_rewriter.tags](outcontrol.configuration.md#ini.url-rewriter.tags)\n    \n-   [session.trans\\_sid\\_hosts](session.configuration.md#ini.session.trans-sid-hosts)\\=\\[список хостів\\]\n    \n    (PHP 7.1.0 >=) Ця установка визначає білий список хостів, для яких дозволено прозоре керування ідентифікаторами сесій. Ніколи не додавайте недовірені хости. Якщо це налаштування порожнє, то буде дозволено лише $\\_SERVER\\['HTTP\\_HOST'\\]\n    \n-   [session.referer\\_check](session.configuration.md#ini.session.referer-check)\\=\\[ваш вихідний URL\\]\n    \n    Якщо [session.use\\_trans\\_sid](session.configuration.md#ini.session.use-trans-sid)включено, то рекомендується використовувати цю опцію, якщо це можливо. Це зменшує ризик ін'єкції сесійного ID. Якщо ваш сайт знаходиться за адресою`http://example.com/`, то встановіть цю опцію значення`http://example.com/`. Зверніть увагу, що під час використання HTTPS, браузер не надсилає referrer заголовок. Таким чином, цей параметр не є достатньо надійним показником безпеки, але все ж таки рекомендується його використовувати.\n    \n-   [session.cache\\_limiter](session.configuration.md#ini.session.cache-limiter)\\=nocache\n    \n    Переконайтеся, що вміст HTTP не кешується для автентифікаційної сесії. Дозволяється кешувати лише неконфіденційний контент. Інакше може скористатися вмістом. Можна використовувати значення`\"private\"`, якщо вміст HTTP не містить чутливих до безпеки даних. Врахуйте, що`\"private\"`може залишати конфіденційні дані у загальному кеші клієнтів. Значення`\"public\"`можна використовувати тільки якщо HTTP-контент взагалі не містить жодних конфіденційних даних.\n    \n-   [session.sid\\_length](session.configuration.md#ini.session.sid-length)\\=\"48\"\n    \n    (PHP 7.1.0 >=) Чим довше ідентифікатор сесії, тим він надійніший. Довжина, що рекомендується, - 32 символи і більше. У будь-якому випадку, не менше 26 символів потрібно для [session.sid\\_bits\\_per\\_character](session.configuration.md#ini.session.sid-bits-per-character)\\=\"5\".\n    \n-   [session.sid\\_bits\\_per\\_character](session.configuration.md#ini.session.sid-bits-per-character)\\=\"6\"\n    \n    (PHP 7.1.0 >=) Чим більше бітів використовується для символів ідентифікатора сесії, тим більше надійні ідентифікатори будуть створені для тієї ж довжини ідентифікатора сесії.\n    \n-   [session.hash\\_function](session.configuration.md#ini.session.hash-function)\\=\"sha256\"\n    \n    (PHP 7.1.0 <) Більш складна хеш-функція буде створювати складніший сесійний ID. Хоча колізії з хеш майже не відбуваються і з MD5-хеш, проте розробнику краще використовувати функції SHA-2 або новіше. Розробники також можуть використовувати складні функції sha384 та sha512. Переконайтеся, що ви використовуєте достатньо [ентропії](session.configuration.md#ini.session.entropy-length)для цих функцій.\n    \n-   [session.save\\_path](session.configuration.md#ini.session.save-path)\\=\\[загальнодоступний каталог для читання\\]\n    \n    Якщо встановлено в загальнодоступний каталог для читання всім, наприклад /tmp (за замовчуванням), інші користувачі на сервері можуть захопити сеанси, отримавши список файлів у цьому каталозі.\n","title":"INI-налаштування безпеки сесій","contentType":2,"navigation":[{"features.session.security.management.md":"« Базові засади управління сесіями"},{"ref.session.md":"Функції для роботи із сесіями »"},{"index.md":"PHP Manual"},{"session.security.md":"Безпека сесій"}]}},"__N_SSG":true}