{"pageProps":{"page":{"slug":"tutorial.firstpage.md","content":"# Перша сторінка на PHP\n\nСтворіть файл з ім'ям hello.php у кореневому каталозі веб-сервера (DOCUMENT)\\_ROOT) і запишіть у нього наступне:\n\n**Приклад #1 Перший скрипт на PHP: hello.php**\n\n```php\n<!DOCTYPE html>\n<html>\n    <head>\n        <title>Тестируем PHP</title>\n    </head>\n    <body>\n        <?php echo '<p>Привет, мир!</p>'; ?>\n    </body>\n</html>\n```\n\nВідкрийте цей файл у браузері, набравши ім'я вашого веб-сервера та `/hello.php`. При локальній розробці це посилання може бути чимось на зразок `http://localhost/hello.php`или`http://127.0.0.1/hello.php`Але це залежить від налаштувань вашого сервера. Якщо все налаштовано правильно, файл буде оброблений PHP і браузер виведе наступний текст:\n\n```\n<!DOCTYPE html>\n<html>\n    <head>\n        <title>Тестируем PHP</title>\n    </head>\n    <body>\n        <p>Привет, мир!</p>\n    </body>\n</html>\n```\n\nЦя програма надзвичайно проста, і для створення настільки простої сторінки навіть необов'язково використовувати PHP. Все, що вона робить, це висновок `Hello World`, використовуючи інструкцію PHP [echo](function.echo.md). Зауважте, що файл *не може бути виконуваним* або ще якось відрізнятиметься від інших файлів. Сервер знає, що цей файл повинен бути оброблений PHP, тому що файл має розширення \".php\", про яке в налаштуваннях сервера сказано, що подібні файли повинні передаватися PHP. Розглядайте його як звичайний HTML-файл, якому пощастило отримати набір спеціальних тегів (доступних також і вам), здатних на купу цікавих речей.\n\nЯкщо у вас цей приклад не відображає нічого або виводить вікно завантаження, або якщо ви бачите весь цей файл у текстовому вигляді, то, швидше за все, ваш веб-сервер не має підтримки PHP або налаштований неправильно. Попросіть адміністратора сервера включити таку підтримку. Запропонуйте йому інструкцію зі встановлення: розділ [Установка](install.md) цієї документації. Якщо ж ви розробляєте скрипти на PHP вдома (локально), то також прочитайте цей розділ, щоб переконатися, що ви все налаштували правильно. Переконайтеся, що ви запитуєте файл на сервері через протокол http. Якщо ви просто відкриєте файл із вашої файлової системи, він не буде оброблений PHP. Якщо проблеми все ж таки залишилися, не соромтеся попросити допомоги одним з [» безлічі доступних способів](https://www.php.net/support.php)получения поддержки по PHP.\n\nМета прикладу – показати формат спеціальних тегів PHP. У цьому прикладі ми використали `<?php` як тег, що відкриває, потім йшли команди PHP, що завершуються закриваючим тегом `?>`. . Таким чином можна будь-де \"застрибувати\" і \"вистрибувати\" з режиму PHP в HTML файлі. Докладніше про це можна прочитати в розділі посібника [Основний синтаксис](language.basic-syntax.md)\n\n> **Зауваження** **Зауваження про переклад рядків**\n> \n> Переклади рядків дещо означають у HTML, проте вважається гарною ідеєю підтримувати HTML у легкочитаному вигляді, переносячи його на новий рядок. PHP автоматично видаляє переклад рядка, що йде відразу після тега `?>`. Це може бути надзвичайно корисним, якщо ви використовуєте безліч блоків PHP-коду або підключаєте PHP-файли, які не повинні нічого виводити. У той же час, це може дивувати. Можна поставити пробіл після тега, що закриває `?>` і тоді пробіл буде виведено разом із перекладом рядка, або ж ви можете спеціально додати переклад рядка в останній виклик echo/print із блоку PHP-коду.\n\n> **Зауваження** **Пара слів про текстові редактори**\n> \n> Існує безліч текстових редакторів та інтегрованих середовищ розробки (IDE), в яких ви можете створювати та редагувати файли PHP. Список деяких редакторів міститься у розділі [» Список редакторів PHP](http://en.wikipedia.org/wiki/List_of_PHP_editors). Якщо ви бажаєте порадити будь-який редактор, відвідайте цю сторінку і попросіть додати редактор до списку. Використання редактора з підсвічуванням синтаксису може бути дуже великою підмогою у вашій роботі.\n\n> **Зауваження** **Пара слів про текстові процесори**\n> \n> Текстові процесори (StarOffice Writer, Microsoft Word, Abiword та ін.) здебільшого не підходять для редагування файлів PHP. Якщо ви все ж таки хочете використовувати будь-який з них для тестового скрипту, переконайтеся, що зберігаєте файл як *простий текст* (Plain text), інакше PHP буде не в змозі прочитати і запустити ваш скрипт.\n\nТепер, коли ви успішно створили працюючий PHP-скрипт, саме час створити найзнаменитіший PHP-скрипт! Викличте функцію [phpinfo()](function.phpinfo.md) і ви побачите безліч корисної інформації про вашу систему та налаштування, такий як доступні [зумовлені змінні](language.variables.predefined.md), завантажені PHP-модулі та [параметри налаштування](configuration.md). Приділіть деякий час вивченню цієї важливої ​​інформації.\n\n**Приклад #2 Отримання інформації про систему з PHP**\n\n```php\n<?php phpinfo(); ?>\n```\n","title":"Перша сторінка на PHP","contentType":2,"navigation":[{"tutorial.requirements.md":"Що мені потрібно?"},{"tutorial.useful.md":"Робимо щось корисне »"},{"index.md":"PHP Manual"},{"tutorial.md":"Простий підручник"}]}},"__N_SSG":true}