{"pageProps":{"page":{"slug":"tutorial.requirements.md","content":"# Що мені потрібно?\n\nУ цьому посібнику ми припускаємо, що ваш сервер має підтримку PHP і всі файли, що закінчуються .php, обробляються PHP. У більшості серверів зазвичай використовується це розширення для PHP-файлів, але все ж таки не зайвим буде уточнити це у вашого адміністратора сервера. Отже, якщо ваш сервер підтримує PHP, у вас є все, що потрібно. Просто створюйте файли .php та розміщуйте їх у вашому каталозі Web-сервера – вони будуть оброблятися автоматично. Не потрібно нічого компілювати, не потрібно додаткових програм. Вважайте файли PHP звичайними файлами HTML із набором нових \"чарівних\" тегів, які можуть робити купу різних речей.\n\nНаприклад, ви хочете заощадити на інтернет-каналі та вести розробку локально. У цьому випадку вам потрібно буде встановити веб-сервер, такий як [» Apache](http://httpd.apache.org/), і, зрозуміло, [» PHP](https://www.php.net/downloads.php). Швидше за все, ви також захочете встановити базу даних, наприклад, [» MySQL](http://dev.mysql.com/doc/)\n\nВсе це може бути встановлене як окремо один від одного, так і більш простим способом. У нашому посібнику є [інструкції з встановлення PHP](install.md) (передбачається, що ви вже встановили веб-сервер). Якщо у вас виникли проблеми при встановленні PHP, ми пропонуємо вам поставити запитання у нашому [» списку розсилки з питань встановлення](https://www.php.net/mailing-lists.php). Якщо ж ви вибрали більш простий спосіб, то [» знайдіть вже налаштований пакет](http://wikipedia.org/wiki/List_of_AMP_packages) для вашої операційної системи, який автоматично встановить все вищезгадане кількома кліками миші. Встановлювати веб-сервер із підтримкою PHP досить легко на будь-якій операційній системі, включаючи MacOSX, Linux та Windows. На Linux вам, можливо, знадобляться [» rpmfind](http://www.rpmfind.net/) і [» PBone](http://rpm.pbone.net/) під час пошуку RPM-пакетів. Можна також використовувати [» apt-get](https://packages.debian.org/index)для поиска пакетов под Debian.\n","title":"Що мені потрібно?","contentType":2,"navigation":[{"tutorial.md":"« Простий підручник"},{"tutorial.firstpage.md":"Перша сторінка на PHP »"},{"index.md":"PHP Manual"},{"tutorial.md":"Простий підручник"}]}},"__N_SSG":true}