{"pageProps":{"page":{"slug":"wincache.stats.md","content":"## Скрипт статистики WinCache\n\nПакет WinCache містить PHP-скрипт, wincache.php, який можна використовувати для отримання статистики використання кеша.\n\nЯкщо модуль WinCache був встановлений за допомогою Microsoft Web Platform Installer, то скрипт розташовуватиметься на шляху %SystemDrive%\\\\Program Files\\\\IIS\\\\Windows Cache for PHP\\\\. На 64-розрядних версіях Windows Server, скрипт лежить на шляху %SystemDrive%\\\\Program Files (x86)\\\\IIS\\\\Windows Cache для PHP. Якщо модуль встановлювався самостійно, то wincache.php лежатиме в тому ж каталозі, в який ви розпаковували інсталяційний пакет.\n\nДля використання wincache.php, скопіюйте його в кореневий каталог веб-сайту або будь-який його підкаталог. Щоб захистити скрипт, відкрийте його в текстовому редакторі та змініть значення констант *USERNAME*и*PASSWORD*. Якщо для автентифікації в IIS використовується інший механізм, дотримуйтесь інструкцій у коментарях:\n\n**Приклад #1 Налаштування автентифікації для wincache.php**\n\n```php\n<?php\n/**\n * ======================== CONFIGURATION SETTINGS ==============================\n * If you do not want to use authentication for this page, set USE_AUTHENTICATION to 0.\n * If you use authentication then replace the default password.\n */\ndefine('USE_AUTHENTICATION', 1);\ndefine('USERNAME', 'wincache');\ndefine('PASSWORD', 'wincache');\n\n/**\n * The Basic PHP authentication will work only when IIS is configured to support\n * Anonymous Authentication' and nothing else. If IIS is configured to support/use\n * any other kind of authentication like Basic/Negotiate/Digest etc, this will not work.\n * In that case use the array below to define the names of users in your\n * domain/network/workgroup which you want to grant access to.\n */\n$user_allowed = array('DOMAIN\\user1', 'DOMAIN\\user2', 'DOMAIN\\user3');\n\n/**\n * If the array contains string 'all', then all the users authenticated by IIS\n * will have access to the page. Uncomment the below line and comment above line\n * to grant access to all users who gets authenticated by IIS.\n */\n/* $user_allowed = array('all'); */\n\n/** ===================== END OF CONFIGURATION SETTINGS ========================== */\n?>\n```\n\n> **Зауваження**: Завжди захищайте скрипт wincache.php за допомогою вбудованого механізму або за допомогою механізму автентифікації веб-сервера. Залишаючи доступ до скрипту відкритим ви можете скомпрометувати вашу програму та веб-сервер.\n","title":"Скрипт статистики WinCache","contentType":2,"navigation":[{"wincache.configuration.md":"« Налаштування під час виконання"},{"wincache.sessionhandler.md":"Обробник сесій WinCache »"},{"index.md":"PHP Manual"},{"wincache.setup.md":"Встановлення та налаштування"}]}},"__N_SSG":true}